In [96]:
import crud_operations as co
import sqlparse
from itertools import islice
import re

In [13]:
def processQueries():
    db = co.MySQLDB('pl_queries')
    
    queries = {}
    res = db.readAllQueries()
    for q in res:
        queries[int(q[0])] = q[3]
    return queries

In [14]:
queries = processQueries()

In [52]:
# Try with one query
curr = queries[1]
parsed = sqlparse.parse(curr)
print(parsed[0])
print(parsed[0].tokens)

for tok in parsed[0].tokens:
    # print(tok.ttype, type(tok))
    if (type(tok) == sqlparse.sql.Identifier):
        print(tok.value)

select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
from Employee e natural join Department d
where (d.deptLocation = 'Dubai' or d.deptName = 'Sales') and
        (e.annualSalary >= 7000 and e.annualSalary <= 100000) and
        (e.empName like '_a%' or e.empName like '_i%')
order by e.empName asc, d.deptName desc
[<DML 'select' at 0x10E1B7D00>, <Whitespace ' ' at 0x10E1B7980>, <IdentifierList 'e.empN...' at 0x10E1C39D0>, <Newline ' ' at 0x10E1B7360>, <Keyword 'from' at 0x10E1B7EC0>, <Whitespace ' ' at 0x10E1B76E0>, <Identifier 'Employ...' at 0x10E1C37D0>, <Whitespace ' ' at 0x10E1B5AD0>, <Keyword 'natura...' at 0x10E1B7F30>, <Whitespace ' ' at 0x10E1B5A60>, <Identifier 'Depart...' at 0x10E1C3B50>, <Newline ' ' at 0x10E1B5360>, <Where 'where ...' at 0x10E1C33D0>, <Keyword 'order ...' at 0x10E1A2210>, <Whitespace ' ' at 0x10E1A21A0>, <IdentifierList 'e.empN...' at 0x10E1B1150>]
Employee e
Department d

In [166]:
# For first ten queries, let's substitute:
def parse(queries):
    aliases = ['a', 'b', 'c']
    
    for query in queries:
        print("New Query\n")
        content = query[1]
        print(content)
        curr_alias = 0
        
        parsed = sqlparse.parse(query[1])
        
        if len(parsed) == 1:
            prev_keyword = ""
            for tok in parsed[0].tokens:
                # print(type(tok), tok.ttype, tok.value)
                if(str(tok.ttype) == "Token.Keyword"):
                    prev_keyword = tok.value.lower()
                if(type(tok) == sqlparse.sql.Identifier) and (prev_keyword == "from" or "join" in prev_keyword):
                    # Process tok.value
                    # The order of Department vs. Employee shouldn't matter
                    alias = tok.value.split(" ")
                    print(alias)
                    if(len(alias) > 1 and (alias[-1].lower != "asc" or alias[-1].lower != "desc")):
                        content = content.replace(" " + alias[-1] + " ", " " + aliases[curr_alias] + " ")
                        content = content.replace(alias[-1] + ".", aliases[curr_alias] + ".")
                        curr_alias += 1
                    
                if(type(tok) == sqlparse.sql.IdentifierList):
                    # use regex to make sure is alias one
                    if re.match(r'[a-zA-Z ]+ [a-zA-Z ]+,*', tok.value):
                        sets = tok.value.split(",")
                        for s in sets:
                            alias = s.strip().split(" ")
                            print(alias)
                            if(len(alias) > 1 and (alias[-1].lower() != "asc" and alias[-1].lower() != "desc" and "." not in alias[-1])):
                                content = content.replace(" " + alias[-1] + ",", " " + aliases[curr_alias] + ",")
                                content = content.replace(" " + alias[-1] + "\n", " " + aliases[curr_alias] + "\n")
                                content = content.replace(alias[-1] + ".", aliases[curr_alias] + ".")
                                curr_alias += 1
            print("Parsed: ", (query[0], content))
                    
        else:
            print("more than one")
        print("=============")

In [56]:
def take(n, iterable):
    "Return first n items of the iterable as a list"
    return list(islice(iterable, n))

In [57]:
n = 10
subset = take(n, queries.items())
print(subset)

[(1, "select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nfrom Employee e natural join Department d\nwhere (d.deptLocation = 'Dubai' or d.deptName = 'Sales') and\n        (e.annualSalary >= 7000 and e.annualSalary <= 100000) and\n        (e.empName like '_a%' or e.empName like '_i%')\norder by e.empName asc, d.deptName desc"), (2, "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e join Department d on e.deptID = d.deptID \nWHERE ((d.deptLocation = 'Dubai') OR (d.deptName = 'Sales')) AND (e.annualSalary >= 84000 AND e.annualSalary <= 120000) AND ((e.empName LIKE '_A%' )OR (e.empName LIKE '_I%'))\nORDER BY e.empName,  d.deptName DESC\n\n"), (3, "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e NATURAL JOIN Department d\nWHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND e.annualSalary >= 84000 AND e.annualSalary <= 120000 AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')\nORDER BY e.empName, d.deptName DESC;"), (4, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department d, Employee e\nWHERE e.deptID = d.deptID and (deptLocation = 'Dubai' or deptName = 'Sales') and \n(annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)"), (5, "SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle\nFROM Employee E, Department D\nWHERE (E.deptID = D.deptID) AND (D.deptLocation = 'Dubai' OR D.deptName = 'Sales') AND (E.annualSalary / 12 >= 7000 AND E.annualSalary / 12 <= 10000) AND (E.empName LIKE '_i%' OR E.empName LIKE '_a%')\nORDER BY E.empName, D.deptName DESC"), (6, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department d JOIN Employee e ON d.deptID = e.deptID\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND (annualSalary)/12 >= 7000 AND (annualSalary)/12 <=10000 AND (empName LIKE '_a%' OR empName LIKE '_i%')\nORDER BY empName, deptName DESC;"), (7, "select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nfrom Employee e join Department d\non e.deptID = d.deptID\nwhere d.deptLocation = 'Dubai' \nor d.deptName = 'Sales' \nand ((e.annualSalary / 12) >= 7000 and (e.annualSalary / 12) <= 10000)\nand (e.empName like '_A%' or e.empName like '_I%')\norder by e.empName asc, d.deptName desc"), (8, 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Department d JOIN Employee e ON d.deptID = e.deptID\nWHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (\ne.annualSalary <= 100000 AND e.annualSalary >= 70000) AND (\ne.empName LIKE "_a%" OR e.empName LIKE "_i%")\nORDER BY e.empName ASC, d.deptName DESC\n'), (9, 'SELECT e.empName as Name, e.annualSalary as Salary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee as e\nINNER JOIN Department as d\nON d.deptID = e.deptID\nWHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (e.annualSalary/12 <= 10000 AND e.annualSalary/12 >= 7000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")\nORDER BY d.deptName DESC'), (10, 'SELECT Emp.empName, Emp.annualSalary, Dept.deptName, Dept.deptLocation, Emp.jobTitle\nFROM Department Dept NATURAL JOIN Employee Emp\nWHERE (Dept.deptLocation = "Dubai" OR Dept.deptName = "Sales") AND \n        (Emp.annualSalary >= 12 * 7000 AND Emp.annualSalary <= 12 * 10000) AND \n        (Emp.empName LIKE \'_A%\' OR Emp.empName LIKE \'_I%\')\nORDER BY Emp.empName, Dept.deptName DESC')]

In [144]:
parse(subset)

New Query

select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
from Employee e natural join Department d
where (d.deptLocation = 'Dubai' or d.deptName = 'Sales') and
        (e.annualSalary >= 7000 and e.annualSalary <= 100000) and
        (e.empName like '_a%' or e.empName like '_i%')
order by e.empName asc, d.deptName desc
Parsed:  (1, "select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a natural join Department d\nwhere (b.deptLocation = 'Dubai' or b.deptName = 'Sales') and\n        (a.annualSalary >= 7000 and a.annualSalary <= 100000) and\n        (a.empName like '_a%' or a.empName like '_i%')\norder by a.empName asc, b.deptName desc")
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee e join Department d on e.deptID = d.deptID
WHERE ((d.deptLocation = 'Dubai') OR (d.deptName = 'Sales')) AND (e.annualSalary >= 84000 AND e.annualSalary <= 120000) AND ((e.empName LIKE '_A%' )OR (e.empName LIKE '_I%'))
ORDER BY e.empName,  d.deptName DESC


Parsed:  (2, "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a join Department b on a.deptID = b.deptID \nWHERE ((b.deptLocation = 'Dubai') OR (b.deptName = 'Sales')) AND (a.annualSalary >= 84000 AND a.annualSalary <= 120000) AND ((a.empName LIKE '_A%' )OR (a.empName LIKE '_I%'))\nORDER BY a.empName,  b.deptName DESC\n\n")
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee e NATURAL JOIN Department d
WHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND e.annualSalary >= 84000 AND e.annualSalary <= 120000 AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')
ORDER BY e.empName, d.deptName DESC;
Parsed:  (3, "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a NATURAL JOIN Department d\nWHERE (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND a.annualSalary >= 84000 AND a.annualSalary <= 120000 AND (a.empName LIKE '_A%' OR a.empName LIKE '_I%')\nORDER BY a.empName, b.deptName DESC;")
=============
New Query

SELECT empName, annualSalary, deptName, deptLocation, jobTitle
FROM Department d, Employee e
WHERE e.deptID = d.deptID and (deptLocation = 'Dubai' or deptName = 'Sales') and
(annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)
Parsed:  (4, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department a, Employee b\nWHERE b.deptID = a.deptID and (deptLocation = 'Dubai' or deptName = 'Sales') and \n(annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)")
=============
New Query

SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle
FROM Employee E, Department D
WHERE (E.deptID = D.deptID) AND (D.deptLocation = 'Dubai' OR D.deptName = 'Sales') AND (E.annualSalary / 12 >= 7000 AND E.annualSalary / 12 <= 10000) AND (E.empName LIKE '_i%' OR E.empName LIKE '_a%')
ORDER BY E.empName, D.deptName DESC
Parsed:  (5, "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a, Department b\nWHERE (a.deptID = b.deptID) AND (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND (a.annualSalary / 12 >= 7000 AND a.annualSalary / 12 <= 10000) AND (a.empName LIKE '_i%' OR a.empName LIKE '_a%')\nORDER BY a.empName, b.deptName DESC")
=============
New Query

SELECT empName, annualSalary, deptName, deptLocation, jobTitle
FROM Department d JOIN Employee e ON d.deptID = e.deptID
WHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND (annualSalary)/12 >= 7000 AND (annualSalary)/12 <=10000 AND (empName LIKE '_a%' OR empName LIKE '_i%')
ORDER BY empName, deptName DESC;
Parsed:  (6, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department a JOIN Employee b ON a.deptID = b.deptID\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND (annualSalary)/12 >= 7000 AND (annualSalary)/12 <=10000 AND (empName LIKE '_a%' OR empName LIKE '_i%')\nORDER BY empName, deptName DESC;")
=============
New Query

select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
from Employee e join Department d
on e.deptID = d.deptID
where d.deptLocation = 'Dubai'
or d.deptName = 'Sales'
and ((e.annualSalary / 12) >= 7000 and (e.annualSalary / 12) <= 10000)
and (e.empName like '_A%' or e.empName like '_I%')
order by e.empName asc, d.deptName desc
Parsed:  (7, "select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a join Department d\non a.deptID = b.deptID\nwhere b.deptLocation = 'Dubai' \nor b.deptName = 'Sales' \nand ((a.annualSalary / 12) >= 7000 and (a.annualSalary / 12) <= 10000)\nand (a.empName like '_A%' or a.empName like '_I%')\norder by a.empName asc, b.deptName desc")
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Department d JOIN Employee e ON d.deptID = e.deptID
WHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (
e.annualSalary <= 100000 AND e.annualSalary >= 70000) AND (
e.empName LIKE "_a%" OR e.empName LIKE "_i%")
ORDER BY e.empName ASC, d.deptName DESC

Parsed:  (8, 'SELECT b.empName, b.annualSalary, a.deptName, a.deptLocation, b.jobTitle\nFROM Department a JOIN Employee b ON a.deptID = b.deptID\nWHERE (a.deptLocation = "Dubai" OR a.deptName = "Sales") AND (\nb.annualSalary <= 100000 AND b.annualSalary >= 70000) AND (\nb.empName LIKE "_a%" OR b.empName LIKE "_i%")\nORDER BY b.empName ASC, a.deptName DESC\n')
=============
New Query

SELECT e.empName as Name, e.annualSalary as Salary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee as e
INNER JOIN Department as d
ON d.deptID = e.deptID
WHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (e.annualSalary/12 <= 10000 AND e.annualSalary/12 >= 7000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")
ORDER BY d.deptName DESC
Parsed:  (9, 'SELECT a.empName as Name, a.annualSalary as Salary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee as e\nINNER JOIN Department as d\nON b.deptID = a.deptID\nWHERE (b.deptLocation = "Dubai" OR b.deptName = "Sales") AND (a.annualSalary/12 <= 10000 AND a.annualSalary/12 >= 7000) AND (a.empName LIKE "_A%" OR a.empName LIKE "_I%")\nORDER BY b.deptName DESC')
=============
New Query

SELECT Emp.empName, Emp.annualSalary, Dept.deptName, Dept.deptLocation, Emp.jobTitle
FROM Department Dept NATURAL JOIN Employee Emp
WHERE (Dept.deptLocation = "Dubai" OR Dept.deptName = "Sales") AND
        (Emp.annualSalary >= 12 * 7000 AND Emp.annualSalary <= 12 * 10000) AND
        (Emp.empName LIKE '_A%' OR Emp.empName LIKE '_I%')
ORDER BY Emp.empName, Dept.deptName DESC
Parsed:  (10, 'SELECT b.empName, b.annualSalary, a.deptName, a.deptLocation, b.jobTitle\nFROM Department a NATURAL JOIN Employee Emp\nWHERE (a.deptLocation = "Dubai" OR a.deptName = "Sales") AND \n        (b.annualSalary >= 12 * 7000 AND b.annualSalary <= 12 * 10000) AND \n        (b.empName LIKE \'_A%\' OR b.empName LIKE \'_I%\')\nORDER BY b.empName, a.deptName DESC')
=============

In [167]:
parse(queries.items())

New Query

select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
from Employee e natural join Department d
where (d.deptLocation = 'Dubai' or d.deptName = 'Sales') and
        (e.annualSalary >= 7000 and e.annualSalary <= 100000) and
        (e.empName like '_a%' or e.empName like '_i%')
order by e.empName asc, d.deptName desc
['Employee', 'e']
['Department', 'd']
Parsed:  (1, "select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a natural join Department d\nwhere (b.deptLocation = 'Dubai' or b.deptName = 'Sales') and\n        (a.annualSalary >= 7000 and a.annualSalary <= 100000) and\n        (a.empName like '_a%' or a.empName like '_i%')\norder by a.empName asc, b.deptName desc")
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee e join Department d on e.deptID = d.deptID
WHERE ((d.deptLocation = 'Dubai') OR (d.deptName = 'Sales')) AND (e.annualSalary >= 84000 AND e.annualSalary <= 120000) AND ((e.empName LIKE '_A%' )OR (e.empName LIKE '_I%'))
ORDER BY e.empName,  d.deptName DESC


['Employee', 'e']
['Department', 'd']
Parsed:  (2, "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a join Department b on a.deptID = b.deptID \nWHERE ((b.deptLocation = 'Dubai') OR (b.deptName = 'Sales')) AND (a.annualSalary >= 84000 AND a.annualSalary <= 120000) AND ((a.empName LIKE '_A%' )OR (a.empName LIKE '_I%'))\nORDER BY a.empName,  b.deptName DESC\n\n")
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee e NATURAL JOIN Department d
WHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND e.annualSalary >= 84000 AND e.annualSalary <= 120000 AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')
ORDER BY e.empName, d.deptName DESC;
['Employee', 'e']
['Department', 'd']
Parsed:  (3, "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a NATURAL JOIN Department d\nWHERE (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND a.annualSalary >= 84000 AND a.annualSalary <= 120000 AND (a.empName LIKE '_A%' OR a.empName LIKE '_I%')\nORDER BY a.empName, b.deptName DESC;")
=============
New Query

SELECT empName, annualSalary, deptName, deptLocation, jobTitle
FROM Department d, Employee e
WHERE e.deptID = d.deptID and (deptLocation = 'Dubai' or deptName = 'Sales') and
(annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)
['Department', 'd']
d
['Employee', 'e']
e
Parsed:  (4, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department a, Employee b\nWHERE b.deptID = a.deptID and (deptLocation = 'Dubai' or deptName = 'Sales') and \n(annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)")
=============
New Query

SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle
FROM Employee E, Department D
WHERE (E.deptID = D.deptID) AND (D.deptLocation = 'Dubai' OR D.deptName = 'Sales') AND (E.annualSalary / 12 >= 7000 AND E.annualSalary / 12 <= 10000) AND (E.empName LIKE '_i%' OR E.empName LIKE '_a%')
ORDER BY E.empName, D.deptName DESC
['Employee', 'E']
e
['Department', 'D']
d
Parsed:  (5, "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a, Department b\nWHERE (a.deptID = b.deptID) AND (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND (a.annualSalary / 12 >= 7000 AND a.annualSalary / 12 <= 10000) AND (a.empName LIKE '_i%' OR a.empName LIKE '_a%')\nORDER BY a.empName, b.deptName DESC")
=============
New Query

SELECT empName, annualSalary, deptName, deptLocation, jobTitle
FROM Department d JOIN Employee e ON d.deptID = e.deptID
WHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND (annualSalary)/12 >= 7000 AND (annualSalary)/12 <=10000 AND (empName LIKE '_a%' OR empName LIKE '_i%')
ORDER BY empName, deptName DESC;
['Department', 'd']
['Employee', 'e']
Parsed:  (6, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department a JOIN Employee b ON a.deptID = b.deptID\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND (annualSalary)/12 >= 7000 AND (annualSalary)/12 <=10000 AND (empName LIKE '_a%' OR empName LIKE '_i%')\nORDER BY empName, deptName DESC;")
=============
New Query

select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
from Employee e join Department d
on e.deptID = d.deptID
where d.deptLocation = 'Dubai'
or d.deptName = 'Sales'
and ((e.annualSalary / 12) >= 7000 and (e.annualSalary / 12) <= 10000)
and (e.empName like '_A%' or e.empName like '_I%')
order by e.empName asc, d.deptName desc
['Employee', 'e']
['Department', 'd']
Parsed:  (7, "select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a join Department d\non a.deptID = b.deptID\nwhere b.deptLocation = 'Dubai' \nor b.deptName = 'Sales' \nand ((a.annualSalary / 12) >= 7000 and (a.annualSalary / 12) <= 10000)\nand (a.empName like '_A%' or a.empName like '_I%')\norder by a.empName asc, b.deptName desc")
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Department d JOIN Employee e ON d.deptID = e.deptID
WHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (
e.annualSalary <= 100000 AND e.annualSalary >= 70000) AND (
e.empName LIKE "_a%" OR e.empName LIKE "_i%")
ORDER BY e.empName ASC, d.deptName DESC

['Department', 'd']
['Employee', 'e']
Parsed:  (8, 'SELECT b.empName, b.annualSalary, a.deptName, a.deptLocation, b.jobTitle\nFROM Department a JOIN Employee b ON a.deptID = b.deptID\nWHERE (a.deptLocation = "Dubai" OR a.deptName = "Sales") AND (\nb.annualSalary <= 100000 AND b.annualSalary >= 70000) AND (\nb.empName LIKE "_a%" OR b.empName LIKE "_i%")\nORDER BY b.empName ASC, a.deptName DESC\n')
=============
New Query

SELECT e.empName as Name, e.annualSalary as Salary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee as e
INNER JOIN Department as d
ON d.deptID = e.deptID
WHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (e.annualSalary/12 <= 10000 AND e.annualSalary/12 >= 7000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")
ORDER BY d.deptName DESC
['Employee', 'as', 'e']
['Department', 'as', 'd']
Parsed:  (9, 'SELECT a.empName as Name, a.annualSalary as Salary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee as e\nINNER JOIN Department as d\nON b.deptID = a.deptID\nWHERE (b.deptLocation = "Dubai" OR b.deptName = "Sales") AND (a.annualSalary/12 <= 10000 AND a.annualSalary/12 >= 7000) AND (a.empName LIKE "_A%" OR a.empName LIKE "_I%")\nORDER BY b.deptName DESC')
=============
New Query

SELECT Emp.empName, Emp.annualSalary, Dept.deptName, Dept.deptLocation, Emp.jobTitle
FROM Department Dept NATURAL JOIN Employee Emp
WHERE (Dept.deptLocation = "Dubai" OR Dept.deptName = "Sales") AND
        (Emp.annualSalary >= 12 * 7000 AND Emp.annualSalary <= 12 * 10000) AND
        (Emp.empName LIKE '_A%' OR Emp.empName LIKE '_I%')
ORDER BY Emp.empName, Dept.deptName DESC
['Department', 'Dept']
['Employee', 'Emp']
Parsed:  (10, 'SELECT b.empName, b.annualSalary, a.deptName, a.deptLocation, b.jobTitle\nFROM Department a NATURAL JOIN Employee Emp\nWHERE (a.deptLocation = "Dubai" OR a.deptName = "Sales") AND \n        (b.annualSalary >= 12 * 7000 AND b.annualSalary <= 12 * 10000) AND \n        (b.empName LIKE \'_A%\' OR b.empName LIKE \'_I%\')\nORDER BY b.empName, a.deptName DESC')
=============
New Query

SELECT Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle
FROM Employee NATURAL JOIN Department
WHERE (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales')
AND (Employee.annualSalary/12 >= 7000 AND Employee.annualSalary/12 <= 10000)
AND (SUBSTR(Employee.empName, 2, 1) = 'A'  OR SUBSTR(Employee.empName, 2, 1) = 'I')
['Employee']
['Department']
Parsed:  (11, "SELECT Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle\nFROM Employee NATURAL JOIN Department\nWHERE (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales')\nAND (Employee.annualSalary/12 >= 7000 AND Employee.annualSalary/12 <= 10000)\nAND (SUBSTR(Employee.empName, 2, 1) = 'A'  OR SUBSTR(Employee.empName, 2, 1) = 'I')")
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Department d INNER JOIN Employee e on e.deptID = d.deptID
WHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND (e.annualSalary >= 84000 AND e.annualSalary <= 120000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")
['Department', 'd']
['Employee', 'e']
Parsed:  (12, 'SELECT b.empName, b.annualSalary, a.deptName, a.deptLocation, b.jobTitle\nFROM Department a INNER JOIN Employee b on b.deptID = a.deptID\nWHERE (a.deptLocation = \'Dubai\' OR a.deptName = \'Sales\') AND (b.annualSalary >= 84000 AND b.annualSalary <= 120000) AND (b.empName LIKE "_A%" OR b.empName LIKE "_I%")')
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee e
JOIN Department d ON e.deptID = d.deptID
WHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND (e.annualSalary >= 7000 OR e.annualSalary <= 10000) AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')
ORDER BY e.empName ASC, d.deptName DESC
;
['Employee', 'e']
['Department', 'd']
Parsed:  (13, "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee e\nJOIN Department b ON a.deptID = b.deptID\nWHERE (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND (a.annualSalary >= 7000 OR a.annualSalary <= 10000) AND (a.empName LIKE '_A%' OR a.empName LIKE '_I%')\nORDER BY a.empName ASC, b.deptName DESC\n;")
=============
New Query

SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle
FROM Department D join Employee E
on D.deptID = E.deptID
where (D.deptLocation = "Dubai" or D.deptName= "sales")
and ((E.annualSalary/12) >= 7000 and (E.annualSalary/12) <= 10000)
-- and (E.empName like '_a%' or '_i%')
order by E.empName, D.deptName DESC
['Department', 'D']
['Employee', 'E']
Parsed:  (14, 'SELECT b.empName, b.annualSalary, a.deptName, a.deptLocation, b.jobTitle \nFROM Department a join Employee E\non a.deptID = b.deptID\nwhere (a.deptLocation = "Dubai" or a.deptName= "sales")\nand ((b.annualSalary/12) >= 7000 and (b.annualSalary/12) <= 10000) \n-- and (b.empName like \'_a%\' or \'_i%\')\norder by b.empName, a.deptName DESC')
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee e NATURAL JOIN Department d
WHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (e.annualSalary/12 >= 7000 AND e.annualSalary/12 <=10000) AND (e.empName LIKE "_a%" OR e.empName LIKE "_i%")
ORDER BY e.empName, d.deptName DESC
['Employee', 'e']
['Department', 'd']
Parsed:  (15, 'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a NATURAL JOIN Department d\nWHERE (b.deptLocation = "Dubai" OR b.deptName = "Sales") AND (a.annualSalary/12 >= 7000 AND a.annualSalary/12 <=10000) AND (a.empName LIKE "_a%" OR a.empName LIKE "_i%")\nORDER BY a.empName, b.deptName DESC')
=============
New Query

SELECT empName, annualSalary, deptName, deptLocation, jobTitle
FROM Department, Employee
WHERE deptName = "Sales" AND annualSalary/12 >= 7000 AND annualSalary/12 <= 10000 AND (empName LIKE "_A%" OR empName LIKE "_I%")
AND jobTitle LIKE "Sales%"
ORDER BY empName, deptName DESC
Parsed:  (16, 'SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department, Employee\nWHERE deptName = "Sales" AND annualSalary/12 >= 7000 AND annualSalary/12 <= 10000 AND (empName LIKE "_A%" OR empName LIKE "_I%")\nAND jobTitle LIKE "Sales%"\nORDER BY empName, deptName DESC')
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee e NATURAL JOIN Department d
WHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND (annualSalary / 12 >= 7000 AND annualSalary / 12 <= 10000) AND (empName LIKE '_A%' OR empName LIKE '_I%')
ORDER BY e.empName, d.deptName DESC;
['Employee', 'e']
['Department', 'd']
Parsed:  (17, "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a NATURAL JOIN Department d\nWHERE (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND (annualSalary / 12 >= 7000 AND annualSalary / 12 <= 10000) AND (empName LIKE '_A%' OR empName LIKE '_I%')\nORDER BY a.empName, b.deptName DESC;")
=============
New Query

SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle FROM Employee AS E
JOIN Department AS D ON D.deptID = E.deptId
WHERE
    (D.deptLocation = "Dubai" OR D.deptName = "Sales") AND
    (E.annualSalary / 12 >= 7000 AND E.annualSalary / 12 <= 10000) AND
    (E.empName LIKE "_A%" OR E.empName LIKE "_I%")
ORDER BY E.empName, D.deptName DESC
['Employee', 'AS', 'E']
['Department', 'AS', 'D']
Parsed:  (18, 'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle FROM Employee AS E\nJOIN Department AS b ON b.deptID = a.deptId\nWHERE\n    (b.deptLocation = "Dubai" OR b.deptName = "Sales") AND\n    (a.annualSalary / 12 >= 7000 AND a.annualSalary / 12 <= 10000) AND\n    (a.empName LIKE "_A%" OR a.empName LIKE "_I%")\nORDER BY a.empName, b.deptName DESC')
=============
New Query

SELECT empName, annualSalary, deptName, deptLocation, jobTitle
FROM Employee NATURAL JOIN Department
WHERE (deptLocation = 'Dubai' OR (deptName = 'Sales' AND annualSalary >= 84000 AND annualSalary <= 120000)) AND (empName LIKE '_I%' OR empName LIKE '_A%')
ORDER BY empName ASC, deptName DESC;
['Employee']
['Department']
['empName', 'ASC']
asc
['deptName', 'DESC']
desc
Parsed:  (19, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee NATURAL JOIN Department\nWHERE (deptLocation = 'Dubai' OR (deptName = 'Sales' AND annualSalary >= 84000 AND annualSalary <= 120000)) AND (empName LIKE '_I%' OR empName LIKE '_A%') \nORDER BY empName ASC, deptName DESC;")
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM (Employee e) NATURAL JOIN (Department d)
WHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (e.annualSalary >= 84000 AND e.annualSalary <= 120000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")
ORDER BY e.empName, d.deptName DESC
Parsed:  (20, 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM (Employee e) NATURAL JOIN (Department d)\nWHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (e.annualSalary >= 84000 AND e.annualSalary <= 120000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")\nORDER BY e.empName, d.deptName DESC')
=============
New Query

Select emp.empName, emp.annualSalary, dep.deptName, dep.deptLocation, emp.jobTitle
From Department dep Natural Join Employee emp
WHERE (dep.deptLocation = "Dubai" OR dep.deptName = "Sales") AND (emp.annualSalary / 12 >= 7000 AND emp.annualSalary/12 <= 10000) AND (emp.empName LIKE '_a%' OR emp.empName LIKE '_i%')
['Department', 'dep']
['Employee', 'emp']
Parsed:  (21, 'Select b.empName, b.annualSalary, a.deptName, a.deptLocation, b.jobTitle\nFrom Department a Natural Join Employee emp\nWHERE (a.deptLocation = "Dubai" OR a.deptName = "Sales") AND (b.annualSalary / 12 >= 7000 AND b.annualSalary/12 <= 10000) AND (b.empName LIKE \'_a%\' OR b.empName LIKE \'_i%\')')
=============
New Query

select Employee.empName, Employee.annualSalary, Department.deptName,Department.deptLocation, Employee.jobTitle
from Employee natural join Department
where (Department.deptLocation = 'Dubai' or deptName = 'Sales') and Employee.annualSalary/12>=7000 and Employee.annualSalary/12<= 10000 and (Employee.empName like '_A%' or Employee.empName like '_I%')
order by Employee.empName, Department.deptName desc
['Employee']
['Department']
Parsed:  (22, "select Employee.empName, Employee.annualSalary, Department.deptName,Department.deptLocation, Employee.jobTitle\nfrom Employee natural join Department\nwhere (Department.deptLocation = 'Dubai' or deptName = 'Sales') and Employee.annualSalary/12>=7000 and Employee.annualSalary/12<= 10000 and (Employee.empName like '_A%' or Employee.empName like '_I%')\norder by Employee.empName, Department.deptName desc")
=============
New Query

select E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle
from Employee E join Department D on E.deptID = D.deptID
where (D.deptLocation = 'Dubai' or D.deptName = 'Sales') and ((E.annualSalary/12)>= 7000 and (E.annualSalary/12) <= 10000) and (E.empName LIKE '_A%' or E.empName LIKE '_I%')
order by E.empName, D.deptName desc
['Employee', 'E']
['Department', 'D']
Parsed:  (23, "select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a join Department b on a.deptID = b.deptID\nwhere (b.deptLocation = 'Dubai' or b.deptName = 'Sales') and ((a.annualSalary/12)>= 7000 and (a.annualSalary/12) <= 10000) and (a.empName LIKE '_A%' or a.empName LIKE '_I%')\norder by a.empName, b.deptName desc")
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee e JOIN Department d ON e.deptID = d.deptID
WHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND (e.annualSalary / 12 >= 7000 AND e.annualSalary / 12 <= 10000) AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')
ORDER BY e.empName, d.deptName DESC
['Employee', 'e']
['Department', 'd']
Parsed:  (24, "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a JOIN Department b ON a.deptID = b.deptID \nWHERE (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND (a.annualSalary / 12 >= 7000 AND a.annualSalary / 12 <= 10000) AND (a.empName LIKE '_A%' OR a.empName LIKE '_I%')\nORDER BY a.empName, b.deptName DESC")
=============
New Query

SELECT E1.empName, E1.annualSalary, D1.deptName, D1.deptLocation, E1.jobTitle
FROM (Employee E1 INNER JOIN Department D1 ON D1.deptID = E1.DeptID)
WHERE (D1.deptLocation = 'Dubai' OR D1.deptName = 'Sales') AND (E1.annualSalary/12 >= 7000 AND E1.annualSalary/12 <= 10000) AND (E1.empName LIKE '_A%' OR E1.empName LIKE '_I%')
ORDER BY E1.empName, D1.deptName DESC
Parsed:  (25, "SELECT E1.empName, E1.annualSalary, D1.deptName, D1.deptLocation, E1.jobTitle\nFROM (Employee E1 INNER JOIN Department D1 ON D1.deptID = E1.DeptID)\nWHERE (D1.deptLocation = 'Dubai' OR D1.deptName = 'Sales') AND (E1.annualSalary/12 >= 7000 AND E1.annualSalary/12 <= 10000) AND (E1.empName LIKE '_A%' OR E1.empName LIKE '_I%')\nORDER BY E1.empName, D1.deptName DESC")
=============
New Query

Select Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle
From Department, Employee
Where Employee.deptID = Department.deptID AND Employee.annualSalary>= 94000 AND Employee.annualSalary<= 120000 AND ((Employee.empname LIKE '_a%') OR (Employee.empname LIKE '_i%')) AND ((Department.deptlocation = "Dubai") OR (Department.deptName = "Sales"))
Order by Employee.empname, Department.deptName DESC
Parsed:  (26, 'Select Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle\nFrom Department, Employee\nWhere Employee.deptID = Department.deptID AND Employee.annualSalary>= 94000 AND Employee.annualSalary<= 120000 AND ((Employee.empname LIKE \'_a%\') OR (Employee.empname LIKE \'_i%\')) AND ((Department.deptlocation = "Dubai") OR (Department.deptName = "Sales"))\nOrder by Employee.empname, Department.deptName DESC')
=============
New Query

SELECt Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle
FROM Employee, Department
WHERE (Employee.deptID = Department.deptID) AND (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales') AND (Employee.annualSalary/12 <= 10000.0 && Employee.annualSalary/12 >= 7000.0) AND (Employee.empName LIKE '_a%' OR Employee.empName LIKE '_i%')

Parsed:  (27, "SELECt Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle\nFROM Employee, Department\nWHERE (Employee.deptID = Department.deptID) AND (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales') AND (Employee.annualSalary/12 <= 10000.0 && Employee.annualSalary/12 >= 7000.0) AND (Employee.empName LIKE '_a%' OR Employee.empName LIKE '_i%')")
=============
New Query

SELECT empName, annualSalary, deptName, deptLocation, jobTitle
FROM Department, Employee
WHERE (deptName = "Sales") AND (annualSalary/12 BETWEEN 7000 AND 10000) AND (empName LIKE '_A%' OR empName LIKE '_I%') AND jobTitle LIKE "Sales%"
ORDER BY empName ASC, deptName DESC
['empName', 'ASC']
asc
['deptName', 'DESC']
desc
Parsed:  (28, 'SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department, Employee\nWHERE (deptName = "Sales") AND (annualSalary/12 BETWEEN 7000 AND 10000) AND (empName LIKE \'_A%\' OR empName LIKE \'_I%\') AND jobTitle LIKE "Sales%"\nORDER BY empName ASC, deptName DESC')
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee e INNER JOIN Department d ON e.deptID = d.deptId
WHERE ((d.deptLocation LIKE "Dubai" OR d.deptName LIKE "Sales") AND (e.annualSalary/12 BETWEEN 7000 AND 10000)) AND (e.empName LIKE "_a%" OR e.empName LIKE "_i%")
ORDER BY e.empName ASC, d.deptName DESC
['Employee', 'e']
['Department', 'd']
Parsed:  (29, 'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a INNER JOIN Department b ON a.deptID = b.deptId\nWHERE ((b.deptLocation LIKE "Dubai" OR b.deptName LIKE "Sales") AND (a.annualSalary/12 BETWEEN 7000 AND 10000)) AND (a.empName LIKE "_a%" OR a.empName LIKE "_i%")\nORDER BY a.empName ASC, b.deptName DESC')
=============
New Query

SELECT empName, annualSalary, deptName, deptLocation, jobTitle
FROM Employee e NATURAL JOIN Department d
WHERE
    (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND
    ((e.annualSalary / 12 >= 7000) AND (e.annualSalary / 12 <= 10000)) AND
    (e.empName LIKE '_A%' OR e.empName LIKE '_I%')
ORDER BY e.empName, d.deptName DESC;
['Employee', 'e']
['Department', 'd']
Parsed:  (30, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee a NATURAL JOIN Department d\nWHERE \n    (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND \n    ((a.annualSalary / 12 >= 7000) AND (a.annualSalary / 12 <= 10000)) AND \n    (a.empName LIKE '_A%' OR a.empName LIKE '_I%')\nORDER BY a.empName, b.deptName DESC;")
=============
New Query

SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle
FROM Employee E, Department D
WHERE E.deptId = D.deptId AND (D.deptLocation = "Dubai" OR D.deptName = "Sales")
    AND (E.annualSalary/12 >= 7000 AND E.annualSalary/12 <=10000)
    AND (E.empName LIKE '_A%' OR E.empName LIKE '_I%')
['Employee', 'E']
e
['Department', 'D']
d
Parsed:  (31, 'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a, Department b\nWHERE a.deptId = b.deptId AND (b.deptLocation = "Dubai" OR b.deptName = "Sales")\n    AND (a.annualSalary/12 >= 7000 AND a.annualSalary/12 <=10000) \n    AND (a.empName LIKE \'_A%\' OR a.empName LIKE \'_I%\')')
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee e, Department d
WHERE (d.deptID = e.deptID) AND (d.deptLocation = 'DUBAI' OR d.deptName = 'SALES') AND (e.annualSalary/12 BETWEEN 7000 AND 10000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")
['Employee', 'e']
e
['Department', 'd']
d
Parsed:  (32, 'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a, Department b\nWHERE (b.deptID = a.deptID) AND (b.deptLocation = \'DUBAI\' OR b.deptName = \'SALES\') AND (a.annualSalary/12 BETWEEN 7000 AND 10000) AND (a.empName LIKE "_A%" OR a.empName LIKE "_I%")')
=============
New Query

select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
from Employee e natural join Department d
where (d.deptLocation='Dubai' or d.deptName='Sales')
and (e.annualSalary/12 >= 7000 or e.annualSalary <= 10000)
and (e.empName like '%a%' or e.empName like '%i%')
['Employee', 'e']
['Department', 'd']
Parsed:  (33, "select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a natural join Department d\nwhere (b.deptLocation='Dubai' or b.deptName='Sales')\nand (a.annualSalary/12 >= 7000 or a.annualSalary <= 10000)\nand (a.empName like '%a%' or a.empName like '%i%')")
=============
New Query

SELECT empName, annualSalary, deptName, deptLocation, jobTitle
FROM Employee NATURAL JOIN Department
WHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND annualSalary >= 7000 AND annualSalary <= 100000 AND empName LIKE '_i%'
ORDER BY empName ASC, deptName DESC
['Employee']
['Department']
['empName', 'ASC']
asc
['deptName', 'DESC']
desc
Parsed:  (34, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee NATURAL JOIN Department\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND annualSalary >= 7000 AND annualSalary <= 100000 AND empName LIKE '_i%'\nORDER BY empName ASC, deptName DESC")
=============
New Query

SELECT empName, annualSalary, deptName, deptLocation, jobTitle
FROM Employee e
NATURAL JOIN Department d
WHERE (deptLocation LIKE "Dubai" OR deptName LIKE "Sales") AND
    (annualSalary >= 7000*12 AND annualSalary <= 10000*12) AND
    (empName LIKE "_A%" OR empName LIKE "_I%" OR empName LIKE "_a%" OR empName LIKE "_i%")
ORDER BY empName, deptName DESC
['Employee', 'e']
['Department', 'd']
Parsed:  (35, 'SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee e\nNATURAL JOIN Department d\nWHERE (deptLocation LIKE "Dubai" OR deptName LIKE "Sales") AND\n    (annualSalary >= 7000*12 AND annualSalary <= 10000*12) AND\n    (empName LIKE "_A%" OR empName LIKE "_I%" OR empName LIKE "_a%" OR empName LIKE "_i%")\nORDER BY empName, deptName DESC')
=============
New Query

SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle
FROM Employee E
    JOIN Department D ON D.deptID = E.deptID
WHERE (D.deptLocation = 'Dubai' OR D.deptName = 'Sales') AND
      ((E.annualSalary / 12) >= 7000 AND (E.annualSalary / 12) <= 10000) AND
      (empName LIKE '_A%' OR empName LIKE '_I%' OR empName LIKE '_a%' OR empName LIKE '_i%')
['Employee', 'E']
['Department', 'D']
Parsed:  (36, "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee E\n    JOIN Department b ON b.deptID = a.deptID\nWHERE (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND\n      ((a.annualSalary / 12) >= 7000 AND (a.annualSalary / 12) <= 10000) AND\n      (empName LIKE '_A%' OR empName LIKE '_I%' OR empName LIKE '_a%' OR empName LIKE '_i%')")
=============
New Query

select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
from Employee e inner join Department d on e.deptId = d.deptId
where (d.deptLocation = "Dubai" or d.deptName = "Sales") and
((e.annualSalary / 12) <= 10000 or (e.annualSalary / 12) >= 7000) and
(e.empName like "_A%" or e.empName like "_I%")
['Employee', 'e']
['Department', 'd']
Parsed:  (37, 'select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a inner join Department b on a.deptId = b.deptId\nwhere (b.deptLocation = "Dubai" or b.deptName = "Sales") and \n((a.annualSalary / 12) <= 10000 or (a.annualSalary / 12) >= 7000) and\n(a.empName like "_A%" or a.empName like "_I%")')
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee e NATURAL JOIN Department d
WHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND (e.annualSalary/12 >= 7000 AND e.annualSalary/12 <= 10000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")
ORDER BY e.empName, d.deptName DESC
['Employee', 'e']
['Department', 'd']
Parsed:  (38, 'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a NATURAL JOIN Department d\nWHERE (b.deptLocation = \'Dubai\' OR b.deptName = \'Sales\') AND (a.annualSalary/12 >= 7000 AND a.annualSalary/12 <= 10000) AND (a.empName LIKE "_A%" OR a.empName LIKE "_I%")\nORDER BY a.empName, b.deptName DESC')
=============
New Query

select empName, annualSalary, deptName, deptLocation, jobTitle
from Employee natural join Department
where (deptLocation = "Dubai" or deptName = "Sales")
    and (annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)
    and (empName like "_A%" or empName like "_I%")
order by empName, deptName desc
['Employee']
['Department']
Parsed:  (39, 'select empName, annualSalary, deptName, deptLocation, jobTitle\nfrom Employee natural join Department\nwhere (deptLocation = "Dubai" or deptName = "Sales")\n    and (annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)\n    and (empName like "_A%" or empName like "_I%")\norder by empName, deptName desc')
=============
New Query

SELECT Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle
FROM Employee
INNER JOIN Department on Employee.deptId = Department.deptId
WHERE (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales') AND (Employee.empName LIKE '_I%' OR Employee.empName LIKE '_A%')
GROUP BY Employee.empId
ORDER BY Employee.empName ASC, Department.deptName DESC;
['Employee']
['Department']
Parsed:  (40, "SELECT Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle \nFROM Employee\nINNER JOIN Department on Employee.deptId = Department.deptId\nWHERE (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales') AND (Employee.empName LIKE '_I%' OR Employee.empName LIKE '_A%')\nGROUP BY Employee.empId\nORDER BY Employee.empName ASC, Department.deptName DESC;")
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee as e
JOIN Department as d
ON e.deptID = d.deptID
WHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND (e.annualSalary/12 >= 7000 AND e.annualSalary/12 <= 10000) AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')
ORDER BY e.empName ASC, d.deptName DESC
['Employee', 'as', 'e']
['Department', 'as', 'd']
Parsed:  (41, "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee as e\nJOIN Department as d\nON a.deptID = b.deptID\nWHERE (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND (a.annualSalary/12 >= 7000 AND a.annualSalary/12 <= 10000) AND (a.empName LIKE '_A%' OR a.empName LIKE '_I%')\nORDER BY a.empName ASC, b.deptName DESC")
=============
New Query

Select E.empName,E.annualSalary,D.deptName,D.deptLocation,E.jobTitle
from Employee E,Department D,Salary_Grade S
where E.deptID=D.deptID and E.annualSalary >= S.minAnnualSalary and E.annualSalary <= S.maxAnnualSalary and
(D.deptLocation LIKE 'Dubai' OR D.deptName LIKE 'Sales') and
(E.annualSalary/12 >= 7000 and E.annualSalary/12 <= 10000) and
(E.empName LIKE '_A%' OR E.empName LIKE '_I%')
order by E.empName,D.deptName DESC
['Employee', 'E']
e
['Department', 'D']
d
['Salary_Grade', 'S']
s
Parsed:  (42, "Select a.empName,a.annualSalary,b.deptName,b.deptLocation,a.jobTitle\nfrom Employee a,Department b,Salary_Grade c\nwhere a.deptID=b.deptID and a.annualSalary >= c.minAnnualSalary and a.annualSalary <= c.maxAnnualSalary and\n(b.deptLocation LIKE 'Dubai' OR b.deptName LIKE 'Sales') and \n(a.annualSalary/12 >= 7000 and a.annualSalary/12 <= 10000) and\n(a.empName LIKE '_A%' OR a.empName LIKE '_I%')\norder by a.empName,b.deptName DESC")
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee e, Department d
WHERE e.deptId = d.deptId
    AND (d.deptLocation = "Dubai" OR d.deptName = "Sales")
    AND ((e.empName LIKE "_a%") OR (e.empName LIKE "_i%"));

more than one
=============
New Query

SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
FROM Employee e, Department d
WHERE ((d.deptName = "Sales" AND e.jobTitle LIKE '%Sales%')) AND (e.annualSalary/12 >= 7000 AND e.annualSalary/12 <= 10000) AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%') AND e.annualSalary IN (SELECT e2.annualSalary FROM Employee e2, Salary_Grade s WHERE e2.annualSalary >= s.minAnnualSalary AND e2.annualSalary <= s.maxAnnualSalary)
ORDER BY e.empName, d.deptName DESC
['Employee', 'e']
e
['Department', 'd']
d
Parsed:  (44, 'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a, Department b\nWHERE ((b.deptName = "Sales" AND a.jobTitle LIKE \'%Sales%\')) AND (a.annualSalary/12 >= 7000 AND a.annualSalary/12 <= 10000) AND (a.empName LIKE \'_A%\' OR a.empName LIKE \'_I%\') AND a.annualSalary IN (SELECT e2.annualSalary FROM Employee e2, Salary_Grade s WHERE e2.annualSalary >= s.minAnnualSalary AND e2.annualSalary <= s.maxAnnualSalary)\nORDER BY a.empName, b.deptName DESC')
=============
New Query

SELECT empName, annualSalary, deptName, deptLocation, jobTitle
FROM Employee emp
JOIN Department dept
ON dept.deptID = emp.deptID
WHERE (deptLocation = 'Dubai' OR deptName = 'Sales')
AND (annualSalary >= 84000 AND annualSalary	<= 120000)
AND (empName LIKE '_A%' OR empName LIKE '_I%')
['Employee', 'emp']
['Department', 'dept']
Parsed:  (45, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee emp\nJOIN Department dept\nON b.deptID = a.deptID\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') \nAND (annualSalary >= 84000 AND annualSalary\t<= 120000) \nAND (empName LIKE '_A%' OR empName LIKE '_I%')")
=============
New Query

SELECT e.empName, e.annualSalary/12 as monthlySalary, d.deptName, e.hireDate
FROM Employee e JOIN Department d ON e.deptID = d.deptID
WHERE e.hireDate IN (SELECT MAX(hireDate) FROM Employee where deptID=e.deptID) AND
e.annualSalary >=(SELECT minAnnualSalary FROM Salary_Grade WHERE grade =12) AND e.annualSalary <=(SELECT maxAnnualSalary FROM Salary_Grade WHERE grade =12)
ORDER BY e.empName, monthlySalary DESC
['Employee', 'e']
['Department', 'd']
Parsed:  (46, 'SELECT a.empName, a.annualSalary/12 as monthlySalary, b.deptName, a.hireDate\nFROM Employee a JOIN Department b ON a.deptID = b.deptID\nWHERE a.hireDate IN (SELECT MAX(hireDate) FROM Employee where deptID=a.deptID) AND\na.annualSalary >=(SELECT minAnnualSalary FROM Salary_Grade WHERE grade =12) AND a.annualSalary <=(SELECT maxAnnualSalary FROM Salary_Grade WHERE grade =12)\nORDER BY a.empName, monthlySalary DESC')
=============
New Query

SELECT d.deptName, d.deptLocation, COUNT(e.deptID) as empCnt
FROM Department d LEFT OUTER JOIN Employee e on d.deptID = e.deptID
GROUP BY d.deptID
ORDER BY empCnt ASC, d.deptName DESC
['Department', 'd']
['Employee', 'e']
['empCnt', 'ASC']
asc
['d.deptName', 'DESC']
desc
Parsed:  (47, 'SELECT a.deptName, a.deptLocation, COUNT(b.deptID) as empCnt\nFROM Department a LEFT OUTER JOIN Employee b on a.deptID = b.deptID \nGROUP BY a.deptID\nORDER BY empCnt ASC, a.deptName DESC')
=============
New Query

Select d.deptName, d.deptLocation, Count(e.empID) as empCNT
from Department d Left outer join Employee e On (d.deptID = e.deptID)
group by  d.deptID
order by empCNT, d.deptName DESC
['Department', 'd']
['Employee', 'e']
Parsed:  (48, 'Select a.deptName, a.deptLocation, Count(b.empID) as empCNT\nfrom Department a Left outer join Employee b On (a.deptID = b.deptID)\ngroup by  a.deptID\norder by empCNT, a.deptName DESC')
=============
New Query

SELECT d.deptName, d.deptLocation, COUNT(e.empID) as empCnt
FROM Department d LEFT JOIN Employee e ON (d.deptID = e.deptID)
GROUP BY d.deptID
ORDER BY empCnt, d.deptName DESC;
['Department', 'd']
['Employee', 'e']
Parsed:  (49, 'SELECT a.deptName, a.deptLocation, COUNT(b.empID) as empCnt\nFROM Department a LEFT JOIN Employee b ON (a.deptID = b.deptID)\nGROUP BY a.deptID\nORDER BY empCnt, a.deptName DESC;')
=============
New Query

SELECT d.deptName, d.deptLocation, COUNT(DISTINCT(e.empID))
FROM Employee e RIGHT OUTER JOIN Department d ON e.deptID = d.deptID
GROUP BY d.deptID
ORDER BY COUNT(DISTINCT(e.empID)), d.deptName DESC
['Employee', 'e']
['Department', 'd']
Parsed:  (50, 'SELECT b.deptName, b.deptLocation, COUNT(DISTINCT(a.empID))\nFROM Employee a RIGHT OUTER JOIN Department b ON a.deptID = b.deptID\nGROUP BY b.deptID\nORDER BY COUNT(DISTINCT(a.empID)), b.deptName DESC')
=============
New Query

SELECT d.deptName, d.deptLocation, COUNT(e.empID) as empCNT
FROM Department d
LEFT OUTER JOIN Employee e ON d.deptID = e.deptID
GROUP BY d.deptId
ORDER BY empCNT, d.deptName DESC;
['Department', 'd']
['Employee', 'e']
Parsed:  (51, 'SELECT a.deptName, a.deptLocation, COUNT(b.empID) as empCNT\nFROM Department a \nLEFT OUTER JOIN Employee b ON a.deptID = b.deptID\nGROUP BY a.deptId\nORDER BY empCNT, a.deptName DESC;')
=============
New Query

SELECT d.deptName, d.deptLocation, COUNT(e.empID)
FROM Department d
LEFT OUTER JOIN Employee e
ON d.deptID = e.deptID
GROUP BY d.deptName, d.deptLocation
ORDER BY COUNT(e.empID), d.deptName DESC
['Department', 'd']
['Employee', 'e']
Parsed:  (52, 'SELECT a.deptName, a.deptLocation, COUNT(b.empID)\nFROM Department d\nLEFT OUTER JOIN Employee e\nON a.deptID = b.deptID\nGROUP BY a.deptName, a.deptLocation\nORDER BY COUNT(b.empID), a.deptName DESC')
=============
New Query

SELECT d.deptName, d.deptLocation, COUNT(e.deptID)
FROM Department d LEFT OUTER JOIN Employee e ON d.deptID = e.deptID
GROUP BY d.deptName, d.deptLocation, d.deptID
ORDER BY COUNT(e.deptID), d.deptName DESC
['Department', 'd']
['Employee', 'e']
Parsed:  (53, 'SELECT a.deptName, a.deptLocation, COUNT(b.deptID)\nFROM Department a LEFT OUTER JOIN Employee b ON a.deptID = b.deptID\nGROUP BY a.deptName, a.deptLocation, a.deptID\nORDER BY COUNT(b.deptID), a.deptName DESC')
=============
New Query

SELECT deptName, deptLocation, count(empID) as total_employee
FROM Department LEFT JOIN Employee ON Department.deptID = Employee.deptID
GROUP BY Department.deptID
ORDER BY total_employee ASC, deptName DESC;
['Department']
['Employee']
Parsed:  (54, 'SELECT deptName, deptLocation, count(empID) as total_employee\nFROM Department LEFT JOIN Employee ON Department.deptID = Employee.deptID\nGROUP BY Department.deptID\nORDER BY total_employee ASC, deptName DESC;')
=============
New Query

SELECT d.deptName, d.deptLocation, COUNT(e.empID) AS numEmployees
FROM Department d
LEFT OUTER JOIN Employee e
ON d.deptID = e.deptID
GROUP BY d.deptID
ORDER BY numEmployees ASC, d.deptName DESC
['Department', 'd']
['Employee', 'e']
['numEmployees', 'ASC']
asc
['d.deptName', 'DESC']
desc
Parsed:  (55, 'SELECT a.deptName, a.deptLocation, COUNT(b.empID) AS numEmployees\nFROM Department d\nLEFT OUTER JOIN Employee e\nON a.deptID = b.deptID\nGROUP BY a.deptID\nORDER BY numEmployees ASC, a.deptName DESC')
=============
New Query

SELECT d.deptName, d.deptLocation, COUNT(empID) as empCnt
FROM Department d LEFT OUTER JOIN Employee e ON (d.deptID = e.deptID)
GROUP BY deptName, deptLocation
ORDER BY empCnt, deptName DESC
['Department', 'd']
['Employee', 'e']
Parsed:  (56, 'SELECT a.deptName, a.deptLocation, COUNT(empID) as empCnt\nFROM Department a LEFT OUTER JOIN Employee b ON (a.deptID = b.deptID)\nGROUP BY deptName, deptLocation\nORDER BY empCnt, deptName DESC')
=============
New Query

SELECT d.deptName, d.deptLocation, count(e.empID)
FROM Employee e RIGHT JOIN Department d
        on e.deptID = d.deptID
GROUP BY d.deptID
ORDER BY count(e.empID) ASC, d.deptName DESC
['Employee', 'e']
['Department', 'd']
Parsed:  (57, 'SELECT b.deptName, b.deptLocation, count(a.empID)\nFROM Employee a RIGHT JOIN Department d\n        on a.deptID = b.deptID \nGROUP BY b.deptID\nORDER BY count(a.empID) ASC, b.deptName DESC')
=============
New Query

SELECT d.deptName, d. deptLocation, COUNT(e.empID) as empIDCount
From Department d LEFT Outer Join Employee e ON (d.deptID = e.deptID)
GROUP BY d.deptID
ORDER BY empIDCount, d.deptName DESC
['Department', 'd']
['Employee', 'e']

['Department', 'd']
['Employee', 'e']
Parsed:  (60, 'SELECT a.deptName, a.deptLocation, COUNT(b.empID) AS cnt\nFROM Department a LEFT OUTER JOIN Employee b ON a.deptID = b.deptID\nGROUP BY a.deptID\nORDER BY cnt, a.deptName DESC')
=============
New Query

SELECT d.deptName, d.deptLocation, count(e.empID) AS "count"
FROM Department d LEFT OUTER JOIN Employee e ON (d.deptID = e.deptID)
GROUP BY d.deptID
ORDER BY count, d.deptName DESC
['Department', 'd']
['Employee', 'e']
Parsed:  (61, 'SELECT a.deptName, a.deptLocation, count(b.empID) AS "count"\nFROM Department a LEFT OUTER JOIN Employee b ON (a.deptID = b.deptID)\nGROUP BY a.deptID\nORDER BY count, a.deptName DESC')
=============
New Query

Select D.deptName,D.deptLocation,count(E.empID) AS num_employees
from Employee E RIGHT JOIN Department D ON E.deptID = D.deptID
group by D.deptName,D.deptLocation
order by num_employees,D.deptName DESC

['Employee', 'E']
['Department', 'D']
Parsed:  (62, 'Select b.deptName,b.deptLocation,count(a.empID) AS num_employees\nfrom Employee a RIGHT JOIN Department b ON a.deptID = b.deptID \ngroup by b.deptName,b.deptLocation\norder by num_employees,b.deptName DESC\n')
=============
New Query

SELECT d.deptName, d.deptLocation, COUNT(e.empID) AS empCnt
FROM Department d LEFT OUTER JOIN Employee e ON (d.deptID = e.deptID)
GROUP BY d.deptID
ORDER BY empCnt, d.deptName DESC;
['Department', 'd']
['Employee', 'e']
Parsed:  (63, 'SELECT a.deptName, a.deptLocation, COUNT(b.empID) AS empCnt\nFROM Department a LEFT OUTER JOIN Employee b ON (a.deptID = b.deptID)\nGROUP BY a.deptID\nORDER BY empCnt, a.deptName DESC;')
=============
New Query

SELECT empName, jobTitle, salary/12, Employee.deptID, deptName, grade
FROM Employee JOIN Salary_Grade
    ON Employee.salary > Salary_Grade.minSalary AND Employee.salary <= Salary_Grade.maxSalary
JOIN Department ON Department.deptID = Employee.deptID
WHERE salary/12 > 7000 OR jobTitle <> "IT Support"
['Employee']
['Salary_Grade']
['Department']
Parsed:  (64, 'SELECT empName, jobTitle, salary/12, Employee.deptID, deptName, grade\nFROM Employee JOIN Salary_Grade \n    ON Employee.salary > Salary_Grade.minSalary AND Employee.salary <= Salary_Grade.maxSalary \nJOIN Department ON Department.deptID = Employee.deptID\nWHERE salary/12 > 7000 OR jobTitle <> "IT Support"')
=============
New Query

select ee.empName, ee.jobTitle, ee.salary/12, ee.deptID, deptName, grade
FROM (Employee ee JOIN Department de ON ee.deptID = de.deptID) JOIN Salary_Grade sg ON ee.salary BETWEEN sg.minSalary AND sg.maxSalary
WHERE ee.salary/12 > 7000 OR NOT (ee.jobTitle = "IT Support")
['Salary_Grade', 'sg']
Parsed:  (65, 'select ee.empName, ee.jobTitle, ee.salary/12, ee.deptID, deptName, grade\nFROM (Employee ee JOIN Department de ON ee.deptID = de.deptID) JOIN Salary_Grade a ON ee.salary BETWEEN a.minSalary AND a.maxSalary\nWHERE ee.salary/12 > 7000 OR NOT (ee.jobTitle = "IT Support")')
=============
New Query

SELECT e.empName, e.jobTitle, e.salary / 12, e.deptID, d.deptName, s.grade
FROM Employee e, Department d, Salary_Grade s
WHERE e.deptID = d.deptID
AND e.salary >= s.minSalary AND e.salary <= s.maxSalary
AND (e.salary/12 > 7000 OR e.empID NOT IN
(SELECT empID
FROM Employee
WHERE jobTitle <> 'IT Support'))
['Employee', 'e']
e
['Department', 'd']
d
['Salary_Grade', 's']
s
Parsed:  (66, "SELECT a.empName, a.jobTitle, a.salary / 12, a.deptID, b.deptName, c.grade\nFROM Employee a, Department b, Salary_Grade c\nWHERE a.deptID = b.deptID\nAND a.salary >= c.minSalary AND a.salary <= c.maxSalary\nAND (a.salary/12 > 7000 OR a.empID NOT IN\n(SELECT empID\nFROM Employee\nWHERE jobTitle <> 'IT Support'))")
=============
New Query

SELECT e.empName, e.jobTitle, e.salary/12, e.deptID, d.deptName, s.grade
FROM Employee e NATURAL JOIN Department d JOIN Salary_Grade s ON (e.salary >= s.minSalary AND e.salary <= s.maxSalary)
WHERE e.salary/12 > 7000 OR e.jobTitle <> 'IT Support'
['Employee', 'e']
['Department', 'd']
['Salary_Grade', 's']
Parsed:  (67, "SELECT a.empName, a.jobTitle, a.salary/12, a.deptID, b.deptName, c.grade\nFROM Employee a NATURAL JOIN Department b JOIN Salary_Grade c ON (a.salary >= c.minSalary AND a.salary <= c.maxSalary)\nWHERE a.salary/12 > 7000 OR a.jobTitle <> 'IT Support'")
=============
New Query

Select e.empName, e.jobTitle, e.salary/12 as monthlySal, e.deptID, d.deptName, s.grade
From Employee e, Department d, Salary_Grade s
Where ((e.salary/12)>7000 OR e.jobTitle <> 'IT Support')
AND e.deptID = d.deptID
AND (e.salary between s.minsalary and s.maxsalary)


['Employee', 'e']
e
['Department', 'd']
d
['Salary_Grade', 's']
s
Parsed:  (68, "Select a.empName, a.jobTitle, a.salary/12 as monthlySal, a.deptID, b.deptName, c.grade\nFrom Employee a, Department b, Salary_Grade c\nWhere ((a.salary/12)>7000 OR a.jobTitle <> 'IT Support')\nAND a.deptID = b.deptID\nAND (a.salary between c.minsalary and c.maxsalary)\n\n")
=============
New Query

SELECT empName, jobTitle, salary/12, deptID, deptName, grade
FROM Department NATURAL JOIN Employee
JOIN Salary_Grade
ON salary >= minSalary AND salary <= maxSalary
WHERE salary > 7000 OR jobTitle NOT LIKE 'IT Support'
['Department']
['Employee']
['Salary_Grade']
Parsed:  (69, "SELECT empName, jobTitle, salary/12, deptID, deptName, grade\nFROM Department NATURAL JOIN Employee\nJOIN Salary_Grade\nON salary >= minSalary AND salary <= maxSalary\nWHERE salary > 7000 OR jobTitle NOT LIKE 'IT Support'")
=============
New Query

SELECT empName, jobTitle, salary/12, deptID, deptName, grade
FROM Employee NATURAL JOIN Department, Salary_Grade
WHERE (salary > minSalary AND salary <= maxSalary) AND
(salary/12 > 7000 OR jobTitle NOT LIKE "%IT Support%")


['Employee']
Parsed:  (70, 'SELECT empName, jobTitle, salary/12, deptID, deptName, grade \nFROM Employee NATURAL JOIN Department, Salary_Grade\nWHERE (salary > minSalary AND salary <= maxSalary) AND \n(salary/12 > 7000 OR jobTitle NOT LIKE "%IT Support%")\n\n')
=============
New Query

SELECT empName, jobTitle, salary/12, deptID, deptName, grade
FROM Department NATURAL JOIN Employee, Salary_Grade
WHERE salary >= minSalary and salary <= maxSalary
AND (salary/12 >= 7000 OR jobTitle <> "IT Support")
['Department']
Parsed:  (71, 'SELECT empName, jobTitle, salary/12, deptID, deptName, grade\nFROM Department NATURAL JOIN Employee, Salary_Grade\nWHERE salary >= minSalary and salary <= maxSalary\nAND (salary/12 >= 7000 OR jobTitle <> "IT Support")')
=============
New Query

SELECT DISTINCT e.empName, e.jobTitle, (e.salary/12), e.deptID, d.deptName, s.grade
FROM Employee e NATURAL JOIN Department d LEFT OUTER JOIN Salary_Grade s ON ((e.salary >= s.minSalary) AND (e.salary <= s.maxSalary))
WHERE (e.salary/12) > 7000 OR e.jobTitle <> 'IT Support'
['Employee', 'e']
['Department', 'd']
['Salary_Grade', 's']
Parsed:  (72, "SELECT DISTINCT a.empName, a.jobTitle, (a.salary/12), a.deptID, b.deptName, c.grade\nFROM Employee a NATURAL JOIN Department b LEFT OUTER JOIN Salary_Grade c ON ((a.salary >= c.minSalary) AND (a.salary <= c.maxSalary))\nWHERE (a.salary/12) > 7000 OR a.jobTitle <> 'IT Support'")
=============
New Query

SELECT e.empName, e.jobTitle, e.salary/12.0 as MonthlySal, e.deptID, d.deptName, s.grade
FROM Employee e, Department d, Salary_Grade s
WHERE e.DeptID = d.deptID
AND e.salary BETWEEN s.minSalary AND s.maxSalary AND (((e.salary/12.0)>7000) OR (e.jobTitle <> "IT Support"));
['Employee', 'e']
e
['Department', 'd']
d
['Salary_Grade', 's']
s
Parsed:  (73, 'SELECT a.empName, a.jobTitle, a.salary/12.0 as MonthlySal, a.deptID, b.deptName, c.grade\nFROM Employee a, Department b, Salary_Grade c\nWHERE a.DeptID = b.deptID\nAND a.salary BETWEEN c.minSalary AND c.maxSalary AND (((a.salary/12.0)>7000) OR (a.jobTitle <> "IT Support"));')
=============
New Query

select empName, jobTitle, (salary / 12) as monthlySalary, deptID, deptName, grade
from Employee e natural join Department d
join Salary_Grade s on e.salary >= s.minSalary and e.salary <= s.maxSalary
where salary / 12 > 7000 or jobTitle != 'IT Support'
['Employee', 'e']
['Department', 'd']
['Salary_Grade', 's']
Parsed:  (74, "select empName, jobTitle, (salary / 12) as monthlySalary, deptID, deptName, grade\nfrom Employee a natural join Department d\njoin Salary_Grade c on a.salary >= c.minSalary and a.salary <= c.maxSalary\nwhere salary / 12 > 7000 or jobTitle != 'IT Support'")
=============
New Query

SELECT empName, jobTitle, salary / 12, deptID, deptName, grade
FROM (Employee NATURAL JOIN Department), Salary_Grade
WHERE salary >= minSalary AND salary <= maxSalary AND (salary > 7000 OR jobTitle != 'IT Support');
['Salary_Grade']
Parsed:  (75, "SELECT empName, jobTitle, salary / 12, deptID, deptName, grade\nFROM (Employee NATURAL JOIN Department), Salary_Grade\nWHERE salary >= minSalary AND salary <= maxSalary AND (salary > 7000 OR jobTitle != 'IT Support');")
=============
New Query

SELECT e.empName, e.jobTitle, e.salary/12 AS monthly_salary, d.deptID, d.deptName, g.grade
FROM Employee e, Department d, Salary_Grade g
WHERE ((e.salary/12 > 7000) OR (d.deptName <> "IT Support")) AND (e.salary BETWEEN g.minSalary AND g.maxSalary ) AND (e.deptID = d.deptID)
['Employee', 'e']
e
['Department', 'd']
d
['Salary_Grade', 'g']
g
Parsed:  (76, 'SELECT a.empName, a.jobTitle, a.salary/12 AS monthly_salary, b.deptID, b.deptName, c.grade\nFROM Employee a, Department b, Salary_Grade c\nWHERE ((a.salary/12 > 7000) OR (b.deptName <> "IT Support")) AND (a.salary BETWEEN c.minSalary AND c.maxSalary ) AND (a.deptID = b.deptID)')
=============
New Query

select e.empName, e.jobTitle, e.salary/12, e.deptId, d.deptName, s.grade
from Employee e natural join Department d, Salary_Grade s
where (e.salary/12>7000 or e.jobTitle<>"IT Support") and (e.salary between s.minSalary and s.maxSalary)
['Employee', 'e']
['Department', 'd']
d
['Salary_Grade', 's']
s
Parsed:  (77, 'select a.empName, a.jobTitle, a.salary/12, a.deptId, b.deptName, c.grade\nfrom Employee a natural join Department b, Salary_Grade c\nwhere (a.salary/12>7000 or a.jobTitle<>"IT Support") and (a.salary between c.minSalary and c.maxSalary)')
=============
New Query

SELECT e.empName, e.jobTitle, (e.salary/12) as MonthlySal, d.deptID, d.deptName, s.grade
FROM Employee e, Department d, Salary_Grade s
WHERE e.deptID=d.deptID
AND (e.salary>=s.minSalary AND e.salary<=s.maxSalary)
AND (e.salary/12>7000 OR e.jobTitle<>"IT Support")
['Employee', 'e']
e
['Department', 'd']
d
['Salary_Grade', 's']
s
Parsed:  (78, 'SELECT a.empName, a.jobTitle, (a.salary/12) as MonthlySal, b.deptID, b.deptName, c.grade\nFROM Employee a, Department b, Salary_Grade c\nWHERE a.deptID=b.deptID\nAND (a.salary>=c.minSalary AND a.salary<=c.maxSalary) \nAND (a.salary/12>7000 OR a.jobTitle<>"IT Support")')
=============
New Query

SELECT e.empName, e.jobTitle, e.salary/12.0 as MonthlySal, e.deptID, d.deptName,
s.grade
FROM Employee e, Department d, Salary_Grade s
WHERE e.DeptID = d.deptID
AND e.salary BETWEEN s.minSalary AND s.maxSalary
AND (((e.salary/12.0)>7000) OR (e.jobTitle <> "IT Support"));
['Employee', 'e']
e
['Department', 'd']
d
['Salary_Grade', 's']
s
Parsed:  (79, 'SELECT a.empName, a.jobTitle, a.salary/12.0 as MonthlySal, a.deptID, b.deptName,\nc.grade\nFROM Employee a, Department b, Salary_Grade c\nWHERE a.DeptID = b.deptID\nAND a.salary BETWEEN c.minSalary AND c.maxSalary\nAND (((a.salary/12.0)>7000) OR (a.jobTitle <> "IT Support"));')
=============
New Query

select empName, jobTitle, salary/12, emp.deptID, deptName, grade
from (Employee emp JOIN Department dept on emp.deptID = dept.deptID), Salary_Grade
where (salary > (7000/12) and salary >= minSalary and salary <= maxSalary) ;
['Salary_Grade']
Parsed:  (80, 'select empName, jobTitle, salary/12, emp.deptID, deptName, grade\nfrom (Employee emp JOIN Department dept on emp.deptID = dept.deptID), Salary_Grade\nwhere (salary > (7000/12) and salary >= minSalary and salary <= maxSalary) ;')
=============
New Query

SELECT empName, jobTitle, salary/12, deptID, deptName, grade
FROM Department NATURAL JOIN (SELECT * FROM Employee JOIN Salary_Grade ON salary >= minSalary AND salary <= maxSalary) as sal
WHERE sal.salary/12 > 7000;
['Department']
['(SELECT', '*', 'FROM', 'Employee', 'JOIN', 'Salary_Grade', 'ON', 'salary', '>=', 'minSalary', 'AND', 'salary', '<=', 'maxSalary)', 'as', 'sal']
Parsed:  (81, 'SELECT empName, jobTitle, salary/12, deptID, deptName, grade\nFROM Department NATURAL JOIN (SELECT * FROM Employee JOIN Salary_Grade ON salary >= minSalary AND salary <= maxSalary) as sal\nWHERE a.salary/12 > 7000;')
=============
New Query

SELECT Employee.empName, Employee.jobTitle, Employee.salary/12, Department.deptID, Department.deptName, Salary_Grade.grade
FROM Employee
INNER JOIN Department ON Employee.deptID = Department.deptID
CROSS JOIN Salary_Grade
WHERE (Employee.salary >= Salary_Grade.minSalary AND Employee.salary <= Salary_Grade.maxSalary AND (Employee.salary/12 > 7000 OR Employee.jobTitle <> 'IT Support'))

['Employee']
['Department']
['Salary_Grade']
Parsed:  (82, "SELECT Employee.empName, Employee.jobTitle, Employee.salary/12, Department.deptID, Department.deptName, Salary_Grade.grade\nFROM Employee\nINNER JOIN Department ON Employee.deptID = Department.deptID\nCROSS JOIN Salary_Grade\nWHERE (Employee.salary >= Salary_Grade.minSalary AND Employee.salary <= Salary_Grade.maxSalary AND (Employee.salary/12 > 7000 OR Employee.jobTitle <> 'IT Support'))\n")
=============
New Query

SELECT e.empName, e.jobTitle, e.salary/12 as "Monthly Salary", e.deptID, d.deptName, s.grade
FROM Employee e, Department d, Salary_Grade s
WHERE e.deptID = d.deptID
    AND e.salary between s.minSalary and s.maxSalary
    AND (e.salary/12 > 7000 or e.jobTitle != "IT Support")
['Employee', 'e']
e
['Department', 'd']
d
['Salary_Grade', 's']
s
Parsed:  (83, 'SELECT a.empName, a.jobTitle, a.salary/12 as "Monthly Salary", a.deptID, b.deptName, c.grade\nFROM Employee a, Department b, Salary_Grade c\nWHERE a.deptID = b.deptID\n    AND a.salary between c.minSalary and c.maxSalary\n    AND (a.salary/12 > 7000 or a.jobTitle != "IT Support")')
=============
New Query

select empName, jobTitle, salary/12, emp.deptID, deptName, grade from (Employee emp JOIN Department dept on emp.deptID = dept.deptID), Salary_Grade where (salary > (7000/12) and salary >= minSalary and salary <= maxSalary) ;

more than one
=============
New Query

SELECT e.empName, e.jobTitle, e.salary / 12, e.deptID, d.deptName, sg.grade
FROM Employee e
    JOIN Department d ON e.deptID = d.deptID
    JOIN Salary_Grade sg ON (e.salary >= sg.minSalary) AND (e.salary <= sg.maxSalary)
WHERE (e.salary / 12 > 7000) OR (e.jobTitle <> "IT Support")
['Employee', 'e']
['Department', 'd']
['Salary_Grade', 'sg']
Parsed:  (85, 'SELECT a.empName, a.jobTitle, a.salary / 12, a.deptID, b.deptName, c.grade\nFROM Employee e\n    JOIN Department b ON a.deptID = b.deptID\n    JOIN Salary_Grade c ON (a.salary >= c.minSalary) AND (a.salary <= c.maxSalary)\nWHERE (a.salary / 12 > 7000) OR (a.jobTitle <> "IT Support")')
=============
New Query

SELECT DISTINCT e.empName, e.jobTitle, e.salary/12 as MonthlySal, e.deptID, d.deptName, s.grade
FROM Employee e NATURAL JOIN Department d JOIN Salary_Grade s ON (e.salary <= s.maxSalary AND e.salary >= s.minSalary)
WHERE e.jobTitle <> "IT Support" OR (e.salary/12) > 7000
['Employee', 'e']
['Department', 'd']
['Salary_Grade', 's']
Parsed:  (86, 'SELECT DISTINCT a.empName, a.jobTitle, a.salary/12 as MonthlySal, a.deptID, b.deptName, c.grade\nFROM Employee a NATURAL JOIN Department b JOIN Salary_Grade c ON (a.salary <= c.maxSalary AND a.salary >= c.minSalary)\nWHERE a.jobTitle <> "IT Support" OR (a.salary/12) > 7000')
=============
New Query

SELECT e.empName, e.jobTitle, e.salary/12 AS MonthlySal, d.deptId, d.deptName, s.grade
FROM Employee e, Department d, Salary_Grade s
WHERE (e.deptId = d.deptId) AND (e.salary >= s.minSalary AND e.salary <= s.maxSalary) AND (e.salary/12 > 7000 OR e.jobTitle != "IT Support")
['Employee', 'e']
e
['Department', 'd']
d
['Salary_Grade', 's']
s
Parsed:  (87, 'SELECT a.empName, a.jobTitle, a.salary/12 AS MonthlySal, b.deptId, b.deptName, c.grade\nFROM Employee a, Department b, Salary_Grade c\nWHERE (a.deptId = b.deptId) AND (a.salary >= c.minSalary AND a.salary <= c.maxSalary) AND (a.salary/12 > 7000 OR a.jobTitle != "IT Support")')
=============
New Query

SELECT e.empName, e.jobTitle, e.salary/12 AS MonthlySal, e.deptID, d.deptName, sg.grade
FROM Employee e NATURAL JOIN Department d, Salary_Grade sg
WHERE (e.jobTitle <> "IT Support" OR (e.salary/12) > 7000) AND e.salary BETWEEN sg.minSalary AND sg.maxSalary
['Employee', 'e']
['Department', 'd']
d
['Salary_Grade', 'sg']
sg
Parsed:  (88, 'SELECT a.empName, a.jobTitle, a.salary/12 AS MonthlySal, a.deptID, b.deptName, c.grade\nFROM Employee a NATURAL JOIN Department b, Salary_Grade c\nWHERE (a.jobTitle <> "IT Support" OR (a.salary/12) > 7000) AND a.salary BETWEEN c.minSalary AND c.maxSalary')
=============
New Query

SELECT E.empName, E.jobTitle, (E.salary/12) as monthlySalary, E.deptID, D.deptName, S.grade
FROM Employee E
LEFT OUTER JOIN Salary_Grade S ON E.salary BETWEEN S.minSalary AND S.maxSalary
LEFT OUTER JOIN Department D ON E.deptID = D.deptID
WHERE E.salary/12 > 7000
    OR E.jobTitle NOT LIKE 'IT Support'
ORDER BY S.grade, E.empName DESC
['Employee', 'E']
['Salary_Grade', 'S']
['Department', 'D']
Parsed:  (89, "SELECT a.empName, a.jobTitle, (a.salary/12) as monthlySalary, a.deptID, c.deptName, b.grade\nFROM Employee E\nLEFT OUTER JOIN Salary_Grade b ON a.salary BETWEEN b.minSalary AND b.maxSalary\nLEFT OUTER JOIN Department c ON a.deptID = c.deptID\nWHERE a.salary/12 > 7000\n    OR a.jobTitle NOT LIKE 'IT Support'\nORDER BY b.grade, a.empName DESC")
=============
New Query

SELECT E.empName, E.jobTitle, E.salary / 12, E.deptID, D.deptName, S.grade
FROM Employee E
     JOIN Salary_Grade S ON E.salary BETWEEN S.minSalary AND S.maxSalary
     JOIN Department D ON E.deptID = D.deptID
WHERE E.deptID != 'IT Support' AND E.salary > 12 * 7000
['Employee', 'E']
['Salary_Grade', 'S']
['Department', 'D']
Parsed:  (90, "SELECT a.empName, a.jobTitle, a.salary / 12, a.deptID, c.deptName, b.grade\nFROM Employee a \n     JOIN Salary_Grade b ON a.salary BETWEEN b.minSalary AND b.maxSalary\n     JOIN Department c ON a.deptID = c.deptID\nWHERE a.deptID != 'IT Support' AND a.salary > 12 * 7000")
=============
New Query

select empName, jobTitle, salary / 12 as MonthlySal, deptID, deptName, grade
from (Department natural join Employee) join Salary_Grade
on salary >= minSalary and salary <= maxSalary
where salary / 12 > 7000 or jobTitle <> "IT Support"
['Salary_Grade']
Parsed:  (91, 'select empName, jobTitle, salary / 12 as MonthlySal, deptID, deptName, grade\nfrom (Department natural join Employee) join Salary_Grade\non salary >= minSalary and salary <= maxSalary\nwhere salary / 12 > 7000 or jobTitle <> "IT Support"')
=============
New Query

Select DISTINCT empName,jobTitle,(salary/12),deptID,deptName,grade
from Employee Natural Join Department,Salary_Grade
where (salary>=minSalary and salary<=maxSalary ) and (salary > 7000 or jobTitle NOT LIKE "IT Support")


['Employee']
Parsed:  (92, 'Select DISTINCT empName,jobTitle,(salary/12),deptID,deptName,grade\nfrom Employee Natural Join Department,Salary_Grade\nwhere (salary>=minSalary and salary<=maxSalary ) and (salary > 7000 or jobTitle NOT LIKE "IT Support")\n\n')
=============
New Query

SELECT e.empName, e.jobTitle, e.salary/12.0 as MonthlySal, e.deptID, d.deptName, s.grade
FROM Employee e, Department d, Salary_Grade s
WHERE e.DeptID = d.deptID
    AND e.salary BETWEEN s.minSalary AND s.maxSalary
    AND (((e.salary/12.0)>7000) OR (e.jobTitle <> "IT Support"));
['Employee', 'e']
e
['Department', 'd']
d
['Salary_Grade', 's']
s

['Salary_Grade']
Parsed:  (95, 'SELECT empName, jobTitle, salary / 12, deptID, deptName, grade\nFROM (Employee NATURAL JOIN Department) JOIN Salary_Grade \n        ON (Employee.salary >= Salary_Grade.minSalary AND Employee.salary <= Salary_Grade.maxSalary)\nWHERE salary / 12 > 7000 OR jobTitle <> "IT Support";')
=============
New Query

SELECT e.empName, e.jobTitle, e.salary/12.0 as MontlySal, e.deptID, d.deptName, s.grade
FROM Employee e, Department d, Salary_Grade s
WHERE e.deptID = d.deptID
    AND e.salary BETWEEN s.minSalary AND s.maxSalary
    AND (((e.salary/12.0) > 7000) OR (e.jobTitle <> 'IT Support'));
['Employee', 'e']
e
['Department', 'd']
d
['Salary_Grade', 's']
s
Parsed:  (96, "SELECT a.empName, a.jobTitle, a.salary/12.0 as MontlySal, a.deptID, b.deptName, c.grade\nFROM Employee a, Department b, Salary_Grade c\nWHERE a.deptID = b.deptID\n    AND a.salary BETWEEN c.minSalary AND c.maxSalary\n    AND (((a.salary/12.0) > 7000) OR (a.jobTitle <> 'IT Support'));")
=============
New Query

SELECT * FROM Employee WHERE deptID = (SELECT deptID FROM Department WHERE deptLocation = 'London')
['Employee']
Parsed:  (97, "SELECT * FROM Employee WHERE deptID = (SELECT deptID FROM Department WHERE deptLocation = 'London')")
=============
New Query

SELECT *
FROM Employee
WHERE Employee.salary >
(SELECT minSalary
FROM Salary_Grade
WHERE Salary_Grade.grade = 12) AND Employee.salary < (SELECT maxSalary
FROM Salary_Grade
WHERE Salary_Grade.grade = 13) AND Employee.deptID = (SELECT deptID FROM Department WHERE deptLocation = "London")
['Employee']
Parsed:  (98, 'SELECT *\nFROM Employee\nWHERE Employee.salary >\n(SELECT minSalary\nFROM Salary_Grade\nWHERE Salary_Grade.grade = 12) AND Employee.salary < (SELECT maxSalary\nFROM Salary_Grade\nWHERE Salary_Grade.grade = 13) AND Employee.deptID = (SELECT deptID FROM Department WHERE deptLocation = "London")')
=============
New Query

SELECT ee.*
FROM Employee ee JOIN Salary_Grade sg ON (sg.grade = 13 OR sg.grade = 12) AND
     ee.salary <= sg.maxSalary AND ee.salary >= sg.minSalary
WHERE ee.deptID IN (SELECT de.deptID FROM Department de WHERE de.deptLocation = "LONDON")
['Employee', 'ee']
['Salary_Grade', 'sg']
Parsed:  (99, 'SELECT a.*\nFROM Employee a JOIN Salary_Grade b ON (b.grade = 13 OR b.grade = 12) AND \n     a.salary <= b.maxSalary AND a.salary >= b.minSalary\nWHERE a.deptID IN (SELECT de.deptID FROM Department de WHERE de.deptLocation = "LONDON")')
=============
New Query

SELECT *
FROM Employee e
WHERE e.empID IN
(SELECT e.empID
FROM Employee e, Department d
WHERE e.deptID = d.deptID
AND d.deptLocation = 'London'
AND e.empID IN
(SELECT e.empID
FROM Employee e, Salary_Grade s
WHERE (e.salary BETWEEN s.minSalary AND s.maxSalary)
AND s.grade IN (12, 13)))
['Employee', 'e']
Parsed:  (100, "SELECT *\nFROM Employee e\nWHERE a.empID IN\n(SELECT a.empID\nFROM Employee e, Department d\nWHERE a.deptID = d.deptID\nAND d.deptLocation = 'London'\nAND a.empID IN\n(SELECT a.empID\nFROM Employee e, Salary_Grade s\nWHERE (a.salary BETWEEN s.minSalary AND s.maxSalary)\nAND s.grade IN (12, 13)))")
=============
New Query

SELECT e.empID, e.empName, e.jobTitle, e.managerID, e.hireDate, e.salary, e.comission, e.deptID
FROM Employee e NATURAL JOIN Department d JOIN Salary_Grade s ON (e.salary > s.minSalary AND e.salary < s.maxSalary)
WHERE d.deptLocation = 'London' AND (s.grade = 12 OR s.grade = 13)
['Employee', 'e']
['Department', 'd']
['Salary_Grade', 's']
Parsed:  (101, "SELECT a.empID, a.empName, a.jobTitle, a.managerID, a.hireDate, a.salary, a.comission, a.deptID\nFROM Employee a NATURAL JOIN Department b JOIN Salary_Grade c ON (a.salary > c.minSalary AND a.salary < c.maxSalary)\nWHERE b.deptLocation = 'London' AND (c.grade = 12 OR c.grade = 13)")
=============
New Query

Select empID, empName, jobTitle,managerID, hireDate, salary, comission, e.deptID
From Employee e, Department d, Salary_Grade s
Where s.grade IN (12,13)
AND e.salary Between s.minSalary And s.maxSalary
AND e.deptID=d.deptID
AND d.deptLocation = 'London'
['Employee', 'e']
e
['Department', 'd']
d
['Salary_Grade', 's']
s
Parsed:  (102, "Select empID, empName, jobTitle,managerID, hireDate, salary, comission, a.deptID\nFrom Employee a, Department b, Salary_Grade c\nWhere c.grade IN (12,13)\nAND a.salary Between c.minSalary And c.maxSalary\nAND a.deptID=b.deptID\nAND b.deptLocation = 'London'")
=============
New Query

SELECT *
FROM Employee
WHERE deptID = (SELECT deptID FROM Department WHERE deptLocation = 'London')
AND salary >= (SELECT minSalary FROM Salary_Grade WHERE grade = 12) AND salary <= (SELECT maxSalary FROM Salary_Grade WHERE grade = 13)
['Employee']
Parsed:  (103, "SELECT *\nFROM Employee\nWHERE deptID = (SELECT deptID FROM Department WHERE deptLocation = 'London')\nAND salary >= (SELECT minSalary FROM Salary_Grade WHERE grade = 12) AND salary <= (SELECT maxSalary FROM Salary_Grade WHERE grade = 13)")
=============
New Query

SELECT empID, empName, jobTitle, managerID, hireDate, salary, comission, deptID
FROM Employee NATURAL JOIN Department, Salary_Grade
WHERE
(Employee.salary > Salary_Grade.minSalary AND Employee.salary < Salary_Grade.maxSalary)
AND (Salary_Grade.grade = 12 OR Salary_Grade.grade = 13) AND Department.deptLocation = "London"
['Employee']
Parsed:  (104, 'SELECT empID, empName, jobTitle, managerID, hireDate, salary, comission, deptID\nFROM Employee NATURAL JOIN Department, Salary_Grade\nWHERE\n(Employee.salary > Salary_Grade.minSalary AND Employee.salary < Salary_Grade.maxSalary)\nAND (Salary_Grade.grade = 12 OR Salary_Grade.grade = 13) AND Department.deptLocation = "London"')
=============
New Query

SELECT empID, empName, jobTitle, managerID, hireDate, salary, comission, deptID
FROM Employee NATURAL JOIN Department, Salary_Grade
WHERE grade in (12, 13)
AND salary >= minSalary AND salary <= maxSalary
AND deptLocation = "London"
['Employee']
Parsed:  (105, 'SELECT empID, empName, jobTitle, managerID, hireDate, salary, comission, deptID\nFROM Employee NATURAL JOIN Department, Salary_Grade\nWHERE grade in (12, 13) \nAND salary >= minSalary AND salary <= maxSalary\nAND deptLocation = "London"')
=============
New Query

SELECT DISTINCT e.*
FROM (Employee e NATURAL JOIN Department d) LEFT OUTER JOIN Salary_Grade s ON (s.grade = 12 OR s.grade = 13)
WHERE d.deptLocation = 'London'
['Salary_Grade', 's']
Parsed:  (106, "SELECT DISTINCT e.*\nFROM (Employee e NATURAL JOIN Department d) LEFT OUTER JOIN Salary_Grade a ON (a.grade = 12 OR a.grade = 13)\nWHERE d.deptLocation = 'London'")
=============
New Query

SELECT *
FROM Employee
WHERE empID IN (SELECT e.empID
FROM Employee e, Salary_Grade s
WHERE (e.salary BETWEEN s.minSalary AND s.maxSalary) AND s.grade IN (12,13))
AND deptID IN (SELECT d.deptID
FROM Department d
WHERE d.deptLocation = "London");

more than one
=============
New Query

select empID, empName, jobTitle, managerID, hireDate, salary, comission, deptID
from Employee e natural join Department d
join Salary_Grade s on e.salary >= s.minSalary and e.salary <= s.maxSalary
where (grade = 12 or grade = 13) and deptLocation = 'London'
['Employee', 'e']
['Department', 'd']
['Salary_Grade', 's']
Parsed:  (108, "select empID, empName, jobTitle, managerID, hireDate, salary, comission, deptID\nfrom Employee a natural join Department d\njoin Salary_Grade c on a.salary >= c.minSalary and a.salary <= c.maxSalary\nwhere (grade = 12 or grade = 13) and deptLocation = 'London'")
=============
New Query

SELECT E.*
FROM Employee E
WHERE (E.salary <= (SELECT maxSalary from Salary_Grade where grade = 13) AND E.salary >= (SELECT minSalary from Salary_Grade where grade = 12)) AND (E.deptID in (SELECT deptID FROM Department WHERE deptLocation = 'London'));
['Employee', 'E']
Parsed:  (109, "SELECT a.*\nFROM Employee E\nWHERE (a.salary <= (SELECT maxSalary from Salary_Grade where grade = 13) AND a.salary >= (SELECT minSalary from Salary_Grade where grade = 12)) AND (a.deptID in (SELECT deptID FROM Department WHERE deptLocation = 'London'));")
=============
New Query

select *
from Employee
where empID in
(select empID
from Department natural join Employee, Salary_Grade s
where (Employee.salary between s.minSalary and s.maxSalary) and (s.grade in (12,13)) and (Department.deptLocation="London"))
['Employee']
Parsed:  (110, 'select *\nfrom Employee\nwhere empID in\n(select empID\nfrom Department natural join Employee, Salary_Grade s\nwhere (Employee.salary between s.minSalary and s.maxSalary) and (s.grade in (12,13)) and (Department.deptLocation="London"))')
=============
New Query

SELECT emp.*
FROM Employee emp, Department d, Salary_Grade s
WHERE emp.deptID=d.deptID AND s.grade IN (12,13) and d.deptLocation = "London" AND salary<=maxSalary AND salary>=minSalary
['Employee', 'emp']
emp
['Department', 'd']
d
['Salary_Grade', 's']
s
Parsed:  (111, 'SELECT a.*\nFROM Employee a, Department b, Salary_Grade c\nWHERE a.deptID=b.deptID AND c.grade IN (12,13) and b.deptLocation = "London" AND salary<=maxSalary AND salary>=minSalary')
=============
New Query

SELECT *
FROM Employee
WHERE empID IN (SELECT e.empID
    FROM Employee e, Salary_Grade s
    WHERE (e.salary BETWEEN s.minSalary AND s.maxSalary)
    AND s.grade IN (12,13))
AND deptID IN (SELECT d.deptID
    FROM Department d
    WHERE d.deptLocation = "London");
['Employee']
Parsed:  (112, 'SELECT *\nFROM Employee\nWHERE empID IN (SELECT e.empID\n    FROM Employee e, Salary_Grade s\n    WHERE (e.salary BETWEEN s.minSalary AND s.maxSalary)\n    AND s.grade IN (12,13))\nAND deptID IN (SELECT d.deptID\n    FROM Department d\n    WHERE d.deptLocation = "London");')
=============
New Query

SELECT *
FROM Employee
WHERE
    deptID = (SELECT deptID
              FROM Department
              WHERE deptLocation = "London")
['Employee']
Parsed:  (113, 'SELECT *\nFROM Employee\nWHERE\n    deptID = (SELECT deptID\n              FROM Department\n              WHERE deptLocation = "London")')
=============
New Query

SELECT Employee.*
FROM (SELECT *
      FROM Employee
      WHERE Employee.deptID in (SELECT Department.deptID FROM Department WHERE Department.deptLocation = 'London')) as Employee, Salary_Grade
WHERE
    (Employee.salary >= Salary_Grade.minSalary and Employee.salary <= Salary_Grade.maxSalary and (Salary_Grade.grade = 12 or Salary_Grade.grade = 13))

Parsed:  (114, "SELECT Employee.*\nFROM (SELECT * \n      FROM Employee\n      WHERE Employee.deptID in (SELECT Department.deptID FROM Department WHERE Department.deptLocation = 'London')) as Employee, Salary_Grade\nWHERE \n    (Employee.salary >= Salary_Grade.minSalary and Employee.salary <= Salary_Grade.maxSalary and (Salary_Grade.grade = 12 or Salary_Grade.grade = 13))\n")
=============
New Query

SELECT *
FROM Employee
WHERE deptID IN (SELECT deptID FROM Department WHERE deptLocation = 'London') AND salary >= (SELECT minSalary FROM Salary_Grade WHERE grade = 12) AND salary <= (SELECT maxSalary FROM Salary_Grade where grade = 13);

more than one
=============
New Query

SELECT *
FROM Employee
WHERE Employee.Salary >
       (SELECT Salary_Grade.minSalary
       FROM Salary_Grade
       WHERE Salary_Grade.grade = 12) AND
       Employee.Salary <
       (SELECT Salary_Grade.maxSalary
       FROM Salary_Grade
       WHERE Salary_Grade.grade = 13) AND
       'London' =
       (SELECT Department.deptLocation
        FROM Department
        WHERE Department.deptID = Employee.deptID)
['Employee']
Parsed:  (116, "SELECT *\nFROM Employee\nWHERE Employee.Salary >\n       (SELECT Salary_Grade.minSalary\n       FROM Salary_Grade\n       WHERE Salary_Grade.grade = 12) AND\n       Employee.Salary <\n       (SELECT Salary_Grade.maxSalary\n       FROM Salary_Grade\n       WHERE Salary_Grade.grade = 13) AND\n       'London' =\n       (SELECT Department.deptLocation\n        FROM Department\n        WHERE Department.deptID = Employee.deptID)")
=============
New Query

SELECT *
FROM Employee

    WHERE empID IN (SELECT e.empID
FROM Employee e, Salary_Grade s
WHERE (e.salary BETWEEN s.minSalary AND s.maxSalary) AND s.grade IN (12,13))
AND deptID IN (SELECT d.deptID
FROM Department d
WHERE d.deptLocation = "London");
['Employee']
Parsed:  (117, 'SELECT *\nFROM Employee \n\n    WHERE empID IN (SELECT e.empID\nFROM Employee e, Salary_Grade s\nWHERE (e.salary BETWEEN s.minSalary AND s.maxSalary) AND s.grade IN (12,13))\nAND deptID IN (SELECT d.deptID\nFROM Department d\nWHERE d.deptLocation = "London");')
=============
New Query

SELECT *
FROM Employee
WHERE empID IN (SELECT ee.empID FROM Employee ee Join Salary_Grade sg ON (sg.grade = 12 OR sg.grade = 13) AND ee.salary Between sg.minSalary and sg.maxSalary) and deptID in (SElECT deptID from Department Where deptLocation = "London")
['Employee']
Parsed:  (118, 'SELECT *\nFROM Employee\nWHERE empID IN (SELECT ee.empID FROM Employee ee Join Salary_Grade sg ON (sg.grade = 12 OR sg.grade = 13) AND ee.salary Between sg.minSalary and sg.maxSalary) and deptID in (SElECT deptID from Department Where deptLocation = "London")')
=============
New Query

select empID, empName, jobTitle, managerID, hireDate,salary, comission, emp.deptID from (Employee emp JOIN Department dept on emp.deptID = dept.deptID), Salary_Grade where deptLocation = 'London' and (grade = 12 or grade = 13) and (salary >= minSalary and salary <= maxSalary);



more than one
=============
New Query

SELECT e.empID, e.empName, e.jobTitle, e.managerID, e.hireDate, e.salary, e.comission, e.deptID
FROM Employee e JOIN Department d ON (e.deptID = d.deptID)
WHERE
    d.deptLocation = "London"

    AND e.salary >= (
    SELECT minSalary
    FROM Salary_Grade
    WHERE grade = 12
)

    AND e.salary <= (
    SELECT maxSalary
    FROM Salary_Grade
    WHERE grade = 13
)
['Employee', 'e']
['Department', 'd']
Parsed:  (120, 'SELECT a.empID, a.empName, a.jobTitle, a.managerID, a.hireDate, a.salary, a.comission, a.deptID\nFROM Employee a JOIN Department b ON (a.deptID = b.deptID)\nWHERE\n    b.deptLocation = "London"\n\n    AND a.salary >= (\n    SELECT minSalary\n    FROM Salary_Grade\n    WHERE grade = 12\n)\n\n    AND a.salary <= (\n    SELECT maxSalary\n    FROM Salary_Grade\n    WHERE grade = 13\n)')
=============
New Query

SELECT DISTINCT e.empID, e.empName, e.jobTitle, e.managerID, e.hireDate, e.salary, e.comission, e.deptID
FROM Salary_Grade s, Department d, Employee e
WHERE s.grade IN (12,13) AND (e.salary BETWEEN s.minSalary AND s.maxSalary) AND e.deptID IN (SELECT d.deptID FROM Department d WHERE d.deptLocation="London")

Parsed:  (121, 'SELECT DISTINCT e.empID, e.empName, e.jobTitle, e.managerID, e.hireDate, e.salary, e.comission, e.deptID\nFROM Salary_Grade s, Department d, Employee e\nWHERE s.grade IN (12,13) AND (e.salary BETWEEN s.minSalary AND s.maxSalary) AND e.deptID IN (SELECT d.deptID FROM Department d WHERE d.deptLocation="London")')
=============
New Query

SELECT e.*
FROM Employee e, Salary_Grade s, Department d
WHERE ((s.grade = 12 AND e.salary > s.minSalary AND e.salary < s.maxSalary) OR (s.grade = 13 AND e.salary > s.minSalary AND e.salary < s.maxSalary)) AND e.deptID = d.deptID AND deptLocation = "London"
['Employee', 'e']
e
['Salary_Grade', 's']
s
['Department', 'd']
d
Parsed:  (122, 'SELECT a.*\nFROM Employee a, Salary_Grade b, Department c\nWHERE ((b.grade = 12 AND a.salary > b.minSalary AND a.salary < b.maxSalary) OR (b.grade = 13 AND a.salary > b.minSalary AND a.salary < b.maxSalary)) AND a.deptID = c.deptID AND deptLocation = "London"')
=============
New Query

SELECT *
FROM Employee em
WHERE em.empID IN (SELECT e.empID
FROM Employee e NATURAL JOIN Department d, Salary_Grade sg
WHERE d.deptLocation = "London" AND sg.grade in (12, 13) AND e.salary BETWEEN sg.minSalary AND sg.maxSalary)
['Employee', 'em']
Parsed:  (123, 'SELECT *\nFROM Employee em\nWHERE a.empID IN (SELECT e.empID\nFROM Employee e NATURAL JOIN Department d, Salary_Grade sg\nWHERE d.deptLocation = "London" AND sg.grade in (12, 13) AND e.salary BETWEEN sg.minSalary AND sg.maxSalary)')
=============
New Query

SELECT *
FROM Employee
WHERE empName = ANY(SELECT empName
FROM Department LEFT OUTER JOIN Employee on Department.deptID = Employee.deptID
WHERE deptLocation = "London")


['Employee']
Parsed:  (124, 'SELECT *\nFROM Employee\nWHERE empName = ANY(SELECT empName\nFROM Department LEFT OUTER JOIN Employee on Department.deptID = Employee.deptID\nWHERE deptLocation = "London")\n\n')
=============
New Query

select DISTINCT empID, empName, jobTitle, managerID, hireDate, salary, comission, Employee.deptID
from Employee, Salary_Grade, Department
where (grade = 13 or grade = 12) AND Employee.deptID = Department.deptID AND deptLocation = 'London';
Parsed:  (125, "select DISTINCT empID, empName, jobTitle, managerID, hireDate, salary, comission, Employee.deptID\nfrom Employee, Salary_Grade, Department\nwhere (grade = 13 or grade = 12) AND Employee.deptID = Department.deptID AND deptLocation = 'London';")
=============
New Query

SELECT E.*
FROM Employee E
LEFT OUTER JOIN Salary_Grade S ON E.salary BETWEEN S.minSalary AND S.maxSalary
LEFT OUTER JOIN Department D ON E.deptID = D.deptID
WHERE S.grade IN (12, 13)
    AND D.deptLocation LIKE 'LONDON'
ORDER BY E.empId
['Employee', 'E']
['Salary_Grade', 'S']
['Department', 'D']
Parsed:  (126, "SELECT a.*\nFROM Employee E\nLEFT OUTER JOIN Salary_Grade b ON a.salary BETWEEN b.minSalary AND b.maxSalary\nLEFT OUTER JOIN Department c ON a.deptID = c.deptID\nWHERE b.grade IN (12, 13)\n    AND c.deptLocation LIKE 'LONDON'\nORDER BY a.empId")
=============
New Query

SELECT *
FROM Employee
WHERE salary BETWEEN (SELECT minSalary FROM Salary_Grade WHERE grade = 12)
             AND
             (SELECT maxSalary FROM Salary_Grade WHERE grade = 13)
      AND deptID IN (SELECT deptID FROM Department WHERE deptLocation = 'London')
['Employee']
Parsed:  (127, "SELECT *\nFROM Employee\nWHERE salary BETWEEN (SELECT minSalary FROM Salary_Grade WHERE grade = 12)\n             AND\n             (SELECT maxSalary FROM Salary_Grade WHERE grade = 13)\n      AND deptID IN (SELECT deptID FROM Department WHERE deptLocation = 'London')")
=============
New Query

select empID, empName, jobTitle, managerID, hireDate, salary, comission, deptID
from (Department natural join Employee) join Salary_Grade
on salary >= minSalary and salary <= maxSalary
where (grade = 12 or grade = 13) and deptLocation = "London"
['Salary_Grade']
Parsed:  (128, 'select empID, empName, jobTitle, managerID, hireDate, salary, comission, deptID\nfrom (Department natural join Employee) join Salary_Grade\non salary >= minSalary and salary <= maxSalary\nwhere (grade = 12 or grade = 13) and deptLocation = "London"')
=============
New Query

Select *
from Employee
where empName IN
(
Select empName
from Employee,Department,Salary_Grade
where Employee.deptID = Department.deptID and (salary >= minSalary and salary <= maxSalary) and grade IN (12,13) and deptLocation LIKE 'London'
)


['Employee']
Parsed:  (129, "Select *\nfrom Employee\nwhere empName IN\n(\nSelect empName\nfrom Employee,Department,Salary_Grade\nwhere Employee.deptID = Department.deptID and (salary >= minSalary and salary <= maxSalary) and grade IN (12,13) and deptLocation LIKE 'London'\n)\n\n")
=============
New Query

SELECT *
FROM Employee
WHERE empID IN (SELECT e.empID
                FROM Employee e, Salary_Grade s
                WHERE (e.salary BETWEEN s.minSalary AND s.maxSalary)
                        AND s.grade IN (12,13))
                        AND deptID IN (SELECT d.deptID
                                       FROM Department d
                                       WHERE d.deptLocation = "London");
['Employee']
Parsed:  (130, 'SELECT *\nFROM Employee\nWHERE empID IN (SELECT e.empID\n                FROM Employee e, Salary_Grade s\n                WHERE (e.salary BETWEEN s.minSalary AND s.maxSalary)\n                        AND s.grade IN (12,13))\n                        AND deptID IN (SELECT d.deptID\n                                       FROM Department d\n                                       WHERE d.deptLocation = "London");')
=============
New Query

SELECT *
FROM Employee
WHERE empID IN (SELECT e.empID
FROM Employee e, Salary_Grade s
WHERE (e.salary BETWEEN s.minSalary AND s.maxSalary)
AND s.grade IN (12,13))
AND deptID IN (SELECT d.deptID
FROM Department d
WHERE d.deptLocation = "London");
['Employee']
Parsed:  (131, 'SELECT *\nFROM Employee\nWHERE empID IN (SELECT e.empID\nFROM Employee e, Salary_Grade s\nWHERE (e.salary BETWEEN s.minSalary AND s.maxSalary)\nAND s.grade IN (12,13))\nAND deptID IN (SELECT d.deptID\nFROM Department d\nWHERE d.deptLocation = "London");')
=============
New Query

SELECT *
FROM Employee
WHERE deptID IN (
    SELECT deptID
    FROM Department
    WHERE deptLocation = "London"
) AND salary >= (
    SELECT minSalary
    FROM Salary_Grade
    WHERE grade = 12
) AND salary <= (
    SELECT maxSalary
    FROM Salary_Grade
    WHERE grade = 13
);
['Employee']
Parsed:  (132, 'SELECT *\nFROM Employee\nWHERE deptID IN (\n    SELECT deptID\n    FROM Department\n    WHERE deptLocation = "London"\n) AND salary >= (\n    SELECT minSalary\n    FROM Salary_Grade\n    WHERE grade = 12\n) AND salary <= (\n    SELECT maxSalary\n    FROM Salary_Grade\n    WHERE grade = 13\n);')
=============
New Query

SELECT *
FROM Employee
WHERE empID IN (SELECT e.empID
                FROM Employee e, Salary_Grade s
                WHERE(e.salary BETWEEN s.minSalary AND s.maxSalary)
                AND s.grade IN (12, 13))
                AND deptID IN (SELECT d.deptID
                               FROM Department d
                               WHERE d.deptLocation = 'London');
['Employee']
Parsed:  (133, "SELECT *\nFROM Employee\nWHERE empID IN (SELECT e.empID\n                FROM Employee e, Salary_Grade s\n                WHERE(e.salary BETWEEN s.minSalary AND s.maxSalary)\n                AND s.grade IN (12, 13))\n                AND deptID IN (SELECT d.deptID\n                               FROM Department d\n                               WHERE d.deptLocation = 'London');")
=============
New Query

SELECT FirstName, LastName, NetId, SUM(Credits)
FROM Students NATURAL JOIN Enrollments
GROUP BY NetId
HAVING SUM(Credits) > 12
ORDER BY SUM(Credits) DESC, Firstname ASC;



more than one
=============
New Query

select distinct ss.FirstName, ss.LastName, ss.NetId, temp.sc
from Students ss, (select e.NetId, sum(e.Credits) as sc  from Students s natural join Enrollments e
      group by e.NetId) as temp
where ss.NetId = temp.NetId and temp.sc > 12
ORDER BY temp.sc DESC , ss.FirstName ASC;
['Students', 'ss']
ss
['(select', 'e.NetId']
e.netid
['sum(e.Credits)', 'as', 'sc', '', 'from', 'Students', 's', 'natural', 'join', 'Enrollments', 'e', '\n', '', '', '', '', '', 'group', 'by', 'e.NetId)', 'as', 'temp']
temp
Parsed:  (135, 'select distinct a.FirstName, a.LastName, a.NetId, c.sc\nfrom Students a, (select b, sum(e.Credits) as sc  from Students s natural join Enrollments e \n      group by e.NetId) as c\nwhere a.NetId = c.NetId and c.sc > 12\nORDER BY c.sc DESC , a.FirstName ASC;')
=============
New Query

SELECT FirstName, LastName, s.NetId, SUM(e.Credits)
FROM Students s
NATURAL JOIN Enrollments e
GROUP BY NetId
HAVING SUM(e.Credits) > 12
ORDER BY SUM(e.Credits) DESC, FirstName ASC

['Students', 's']
['Enrollments', 'e']
Parsed:  (136, 'SELECT FirstName, LastName, a.NetId, SUM(b.Credits)\nFROM Students s\nNATURAL JOIN Enrollments e\nGROUP BY NetId\nHAVING SUM(b.Credits) > 12\nORDER BY SUM(b.Credits) DESC, FirstName ASC\n')
=============
New Query

SELECT FirstName, LastName, NetId, SUM(Credits)
FROM Students Natural Join Enrollments
Group by NetId
Having SUM(Credits) > 12
ORDER by SUM(Credits) DESC, FirstName
['Students']
['Enrollments']
Parsed:  (137, 'SELECT FirstName, LastName, NetId, SUM(Credits)\nFROM Students Natural Join Enrollments\nGroup by NetId\nHaving SUM(Credits) > 12\nORDER by SUM(Credits) DESC, FirstName')
=============
New Query

SELECT FirstName, LastName, NetId, SUM(Credits) as total_credits
FROM Students s NATURAL JOIN Enrollments e
GROUP BY NetId
HAVING total_credits > 12
ORDER BY total_credits DESC, FirstName ASC
['Students', 's']
['Enrollments', 'e']
Parsed:  (138, 'SELECT FirstName, LastName, NetId, SUM(Credits) as total_credits\nFROM Students a NATURAL JOIN Enrollments e\nGROUP BY NetId\nHAVING total_credits > 12\nORDER BY total_credits DESC, FirstName ASC')
=============
New Query

SELECT FirstName, LastName, S.NetId, totalc
FROM Students S, (Select NetID, Sum(Credits) as totalc
    From Enrollments E
    Group BY NetId
    Having Sum(Credits) > 12) Eg
Where S.NetId = Eg.NetId


ORDER BY totalc Desc, S.FirstName

['Students', 'S']
s
['(Select', 'NetID']
netid
['Sum(Credits)', 'as', 'totalc\n', '', '', '', 'From', 'Enrollments', 'E\n', '', '', '', 'Group', 'BY', 'NetId\n', '', '', '', 'Having', 'Sum(Credits)', '>', '12)', 'Eg']
eg
['totalc', 'Desc']
desc
['S.FirstName']
s.firstname
Parsed:  (139, 'SELECT FirstName, LastName, a.NetId, totalc\nFROM Students a, (Select b, Sum(Credits) as totalc\n    From Enrollments E\n    Group BY NetId\n    Having Sum(Credits) > 12) c\nWhere a.NetId = c.NetId\n\n\nORDER BY totalc Desc, a.FirstName\n')
=============
New Query

SELECT FirstName, LastName, NetId, (SELECT SUM(Credits) FROM Enrollments WHERE Students.NetId=Enrollments.NetId) AS CreditHours
From Students
WHERE (SELECT SUM(Credits) FROM Enrollments WHERE Students.NetId=Enrollments.NetId) > 12
ORDER BY CreditHours DESC, FirstName ASC
['Students']
['CreditHours', 'DESC']
desc
['FirstName', 'ASC']
asc
Parsed:  (140, 'SELECT FirstName, LastName, NetId, (SELECT SUM(Credits) FROM Enrollments WHERE Students.NetId=Enrollments.NetId) AS CreditHours\nFrom Students\nWHERE (SELECT SUM(Credits) FROM Enrollments WHERE Students.NetId=Enrollments.NetId) > 12\nORDER BY CreditHours DESC, FirstName ASC')
=============
New Query

SELECT FirstName, LastName, Students.NetId, SUM(Credits)
FROM Students JOIN Enrollments ON Enrollments.NetId = Students.NetId
GROUP BY Students.NetId
HAVING SUM(Credits)>12
ORDER BY SUM(Credits) DESC, FirstName ASC
['Students']
['Enrollments']
Parsed:  (141, 'SELECT FirstName, LastName, Students.NetId, SUM(Credits)\nFROM Students JOIN Enrollments ON Enrollments.NetId = Students.NetId\nGROUP BY Students.NetId\nHAVING SUM(Credits)>12\nORDER BY SUM(Credits) DESC, FirstName ASC')
=============
New Query

select FirstName, LastName, NetId, sum(Credits)
from Students as s natural join Enrollments as e
group by NetId
having sum(Credits) > 12
order by sum(Credits) desc, FirstName asc

['Students', 'as', 's']
['Enrollments', 'as', 'e']
Parsed:  (142, 'select FirstName, LastName, NetId, sum(Credits) \nfrom Students as a natural join Enrollments as b \ngroup by NetId\nhaving sum(Credits) > 12\norder by sum(Credits) desc, FirstName asc\n')
=============
New Query

Select Stu.FirstName, Stu.LastName, Stu.NetId, sum(En.Credits) as tot
From Students Stu Join Enrollments En on Stu.NetId = En.NetId
Group by En.NetId
Having tot >= 13
Order by tot Desc, Stu.FirstName Asc;
['Students', 'Stu']
['Enrollments', 'En']
['tot', 'Desc']
desc
['Stu.FirstName', 'Asc']
asc
Parsed:  (143, 'Select a.FirstName, a.LastName, a.NetId, sum(b.Credits) as tot\nFrom Students a Join Enrollments b on a.NetId = b.NetId\nGroup by b.NetId\nHaving tot >= 13\nOrder by tot Desc, a.FirstName Asc;')
=============
New Query

SELECT FirstName, LastName, NetId, SUM(Credits)
FROM Enrollments NATURAL JOIN Students
GROUP BY NetId
HAVING SUM(Credits) > 12
ORDER BY SUM(Credits) DESC, FirstName

['Enrollments']
['Students']
Parsed:  (144, 'SELECT FirstName, LastName, NetId, SUM(Credits)\nFROM Enrollments NATURAL JOIN Students\nGROUP BY NetId\nHAVING SUM(Credits) > 12\nORDER BY SUM(Credits) DESC, FirstName\n')
=============
New Query

select A.FirstName, A.LastName, A.NetId, sum(B.Credits) as TotalCredits
from Students A, Enrollments B
where A.NetId = B.NetId
group by A.NetId
having TotalCredits > 12
order by TotalCredits desc, A.FirstName;
['Students', 'A']
a
['Enrollments', 'B']
b
['TotalCredits', 'desc']
desc
['A.FirstName']
a.firstname
Parsed:  (145, 'select a.FirstName, a.LastName, a.NetId, sum(b.Credits) as TotalCredits\nfrom Students a, Enrollments b\nwhere a.NetId = b.NetId\ngroup by a.NetId\nhaving TotalCredits > 12\norder by TotalCredits desc, a.FirstName;')
=============
New Query

Select FirstName, LastName, s.NetId, tot
FROM Students s JOIN
                    (Select NetId, SUM(Credits) as tot
                    FROM Enrollments
                    GROUP by NetId
                    HAVING tot > 12) d
                ON s.NetId = d.NetId
ORDER BY tot DESC, FirstName ASC




['Students', 's']
['(Select', 'NetId,', 'SUM(Credits)', 'as', 'tot\n', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'FROM', 'Enrollments\n', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'GROUP', 'by', 'NetId\n', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'HAVING', 'tot', '>', '12)', 'd']
['tot', 'DESC']
desc
['FirstName', 'ASC']
asc
Parsed:  (146, 'Select FirstName, LastName, a.NetId, tot\nFROM Students a JOIN \n                    (Select NetId, SUM(Credits) as tot\n                    FROM Enrollments\n                    GROUP by NetId\n                    HAVING tot > 12) d\n                ON a.NetId = b.NetId\nORDER BY tot DESC, FirstName ASC\n\n\n\n')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, SUM(e.Credits) as tot
FROM Students s NATURAL JOIN Enrollments e
GROUP BY NetId
HAVING tot > 12
ORDER BY tot DESC, s.FirstName
['Students', 's']
['Enrollments', 'e']
['tot', 'DESC']
desc
['s.FirstName']
s.firstname
Parsed:  (147, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits) as tot\nFROM Students a NATURAL JOIN Enrollments e\nGROUP BY NetId\nHAVING tot > 12\nORDER BY tot DESC, a.FirstName')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, E.CreditSum
FROM Students S NATURAL JOIN (
      SELECT NetId, SUM(Credits) AS CreditSum
      FROM Enrollments
      GROUP BY NetId
    ) E
WHERE E.CreditSum > 12
ORDER BY E.CreditSum DESC, S.FirstName ASC;

more than one
=============
New Query

Select *
From (Select Distinct FirstName, LastName, Enrollments.NetId, sum(credits) as creds
From Students, Enrollments
Where Students.NetId = Enrollments.NetId
Group By Enrollments.NetId, FirstName, LastName
) as a
Where a.creds > 12
Order By  a.creds DESC, FirstName ASC;
['(Select', 'Distinct', 'FirstName,', 'LastName,', 'Enrollments.NetId,', 'sum(credits)', 'as', 'creds\nFrom', 'Students,', 'Enrollments\nWhere', 'Students.NetId', '=', 'Enrollments.NetId\nGroup', 'By', 'Enrollments.NetId,', 'FirstName,', 'LastName\n)', 'as', 'a']
Parsed:  (149, 'Select * \nFrom (Select Distinct FirstName, LastName, Enrollments.NetId, sum(credits) as creds\nFrom Students, Enrollments\nWhere Students.NetId = Enrollments.NetId\nGroup By Enrollments.NetId, FirstName, LastName\n) as a\nWhere a.creds > 12\nOrder By  a.creds DESC, FirstName ASC;')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, SUM(e.Credits)
FROM Students s Natural Join Enrollments e
GROUP BY e.NetId
HAVING SUM(e.Credits) > 12
Order By SUM(e.Credits) Desc, s.NetId

['Students', 's']
['Enrollments', 'e']
Parsed:  (150, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFROM Students a Natural Join Enrollments e\nGROUP BY b.NetId\nHAVING SUM(b.Credits) > 12\nOrder By SUM(b.Credits) Desc, a.NetId')
=============
New Query

SELECT temp.FirstName, temp.LastName, temp.NetId, temp.total FROM
(SELECT NetId, FirstName, LastName, SUM(Credits) AS total
FROM Enrollments NATURAL JOIN Students
GROUP BY NetId) as temp
WHERE temp.total > 12
ORDER BY temp.total DESC, temp.FirstName ASC
['(SELECT', 'NetId,', 'FirstName,', 'LastName,', 'SUM(Credits)', 'AS', 'total\nFROM', 'Enrollments', 'NATURAL', 'JOIN', 'Students\nGROUP', 'BY', 'NetId)', 'as', 'temp']
Parsed:  (151, 'SELECT a.FirstName, a.LastName, a.NetId, a.total FROM\n(SELECT NetId, FirstName, LastName, SUM(Credits) AS total\nFROM Enrollments NATURAL JOIN Students\nGROUP BY NetId) as temp\nWHERE a.total > 12\nORDER BY a.total DESC, a.FirstName ASC')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, t.TotalCredits
FROM Students s	JOIN
    (SELECT NetId, SUM(Credits) AS TotalCredits
    FROM Enrollments
    GROUP BY NetId) t ON s.NetId = t.NetId
WHERE t.TotalCredits > 12
ORDER BY t.TotalCredits DESC, s.FirstName
['Students', 's']
['(SELECT', 'NetId,', 'SUM(Credits)', 'AS', 'TotalCredits\n', '', '', '', 'FROM', 'Enrollments\n', '', '', '', 'GROUP', 'BY', 'NetId)', 't']
Parsed:  (152, 'SELECT a.FirstName, a.LastName, a.NetId, b.TotalCredits\nFROM Students s\tJOIN \n    (SELECT NetId, SUM(Credits) AS TotalCredits\n    FROM Enrollments\n    GROUP BY NetId) b ON a.NetId = b.NetId\nWHERE b.TotalCredits > 12\nORDER BY b.TotalCredits DESC, a.FirstName')
=============
New Query

SElECT FirstName, LastName, NetId, SumCredit
FROM Students NATURAL JOIN (
        SELECT SUM(Credits) AS SumCredit, NetId
        FROM Enrollments
        GROUP BY NetId)  C
WHERE SumCredit > 12
ORDER BY SumCredit DESC, FirstName
['Students']
['(\n', '', '', '', '', '', '', '', 'SELECT', 'SUM(Credits)', 'AS', 'SumCredit,', 'NetId', '', '\n', '', '', '', '', '', '', '', 'FROM', 'Enrollments', '\n', '', '', '', '', '', '', '', 'GROUP', 'BY', 'NetId)', '', 'C']
['SumCredit', 'DESC']
desc
['FirstName']
firstname
Parsed:  (153, 'SElECT FirstName, LastName, NetId, SumCredit  \nFROM Students NATURAL JOIN (\n        SELECT SUM(Credits) AS SumCredit, NetId  \n        FROM Enrollments \n        GROUP BY NetId)  a   \nWHERE SumCredit > 12\nORDER BY SumCredit DESC, FirstName')
=============
New Query

SELECT S.FirstName, S.LastName, E.NetId, SUM(E.Credits)
FROM Students S, Enrollments E
WHERE S.NetId = E.NetId
GROUP BY E.NetId
HAVING SUM(E.Credits) > 12
ORDER BY SUM(E.Credits) DESC, S.FirstName;

more than one
=============
New Query

SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits) as Nima
FROM Students, Enrollments, (SELECT b.NetId, SUM(b.Credits) as shabi From Enrollments as b Group BY b.NetId)as Cao
WHERE Students.NetId = Enrollments.NetId AND Students.NetId = Cao.NetId AND Cao.shabi > 12
GROUP BY NetId
ORDER BY  Nima DESC , Students.FirstName;
['Nima', 'DESC']
desc
['Students.FirstName']
students.firstname
Parsed:  (155, 'SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits) as Nima\nFROM Students, Enrollments, (SELECT b.NetId, SUM(b.Credits) as shabi From Enrollments as b Group BY b.NetId)as Cao\nWHERE Students.NetId = Enrollments.NetId AND Students.NetId = Cao.NetId AND Cao.shabi > 12\nGROUP BY NetId\nORDER BY  Nima DESC , Students.FirstName;')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, StoTC.TC
FROM (SELECT S.NetId, SUM(E.Credits) as TC
FROM Students S, Enrollments E
WHERE S.NetId=E.NetId
GROUP BY S.NetID) AS StoTC, Students S
WHERE StoTC.TC>12 and S.NetId=StoTC.NetId
ORDER BY StoTC.TC DESC, S.FirstName







Parsed:  (156, 'SELECT S.FirstName, S.LastName, S.NetId, StoTC.TC\nFROM (SELECT S.NetId, SUM(E.Credits) as TC\nFROM Students S, Enrollments E\nWHERE S.NetId=E.NetId\nGROUP BY S.NetID) AS StoTC, Students S\nWHERE StoTC.TC>12 and S.NetId=StoTC.NetId\nORDER BY StoTC.TC DESC, S.FirstName\n\n\n\n\n\n\n')
=============
New Query

SELECT
    Students.FirstName,
    Students.LastName,
    Students.NetId,
    sum(Enrollments.Credits)
FROM
    Students, Enrollments
WHERE
    Students.NetId = Enrollments.NetId
GROUP BY Students.FirstName, Students.LastName, Students.NetId

Having sum(Enrollments.Credits) > 12

ORDER BY

    sum(Enrollments.Credits) DESC,
    Students.FirstName ASC;
Parsed:  (157, 'SELECT \n    Students.FirstName,\n    Students.LastName,\n    Students.NetId,\n    sum(Enrollments.Credits)\nFROM \n    Students, Enrollments\nWHERE \n    Students.NetId = Enrollments.NetId\nGROUP BY Students.FirstName, Students.LastName, Students.NetId\n\nHaving sum(Enrollments.Credits) > 12\n\nORDER BY\n    \n    sum(Enrollments.Credits) DESC,\n    Students.FirstName ASC;')
=============
New Query

select FirstName, LastName, NetID, sum(Credits)
from Students Natural Join Enrollments
group by NetId
having sum(Credits) > 12
order by sum(Credits) DESC, FirstName ASC
['Students']
['Enrollments']
Parsed:  (158, 'select FirstName, LastName, NetID, sum(Credits)\nfrom Students Natural Join Enrollments\ngroup by NetId\nhaving sum(Credits) > 12\norder by sum(Credits) DESC, FirstName ASC')
=============
New Query

select S.FirstName, S.LastName, E.NetId, SUM(E.Credits) as numCredits
FROM Students S join Enrollments E on S.NetId = E.NetId
group by E.NetId
having numCredits > 12
order by numCredits desc, S.FirstName

['Students', 'S']
['Enrollments', 'E']
['numCredits', 'desc']
desc
['S.FirstName']
s.firstname
Parsed:  (159, 'select a.FirstName, a.LastName, b.NetId, SUM(b.Credits) as numCredits \nFROM Students a join Enrollments b on a.NetId = b.NetId\ngroup by b.NetId\nhaving numCredits > 12\norder by numCredits desc, a.FirstName\n')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, SUM(E.Credits)
FROM Students S JOIN Enrollments E
ON S.NetId = E.NetId
GROUP BY E.NetId
HAVING SUM(E.Credits) > 12
ORDER BY SUM(E.Credits) DESC, S.FirstName

['Students', 'S']
['Enrollments', 'E']
Parsed:  (160, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFROM Students a JOIN Enrollments E\nON a.NetId = b.NetId\nGROUP BY b.NetId\nHAVING SUM(b.Credits) > 12\nORDER BY SUM(b.Credits) DESC, a.FirstName\n')
=============
New Query

select S.FirstName,S.LastName, S.NetId, sum(E.Credits) as total
from Students S
join Enrollments E on S.NetId=E.NetId
group by E.NetId
having total>12
order by total desc, S.FirstName asc;
['Students', 'S']
['Enrollments', 'E']
['total', 'desc']
desc
['S.FirstName', 'asc']
asc
Parsed:  (161, 'select a.FirstName,a.LastName, a.NetId, sum(b.Credits) as total\nfrom Students S\njoin Enrollments b on a.NetId=b.NetId\ngroup by b.NetId\nhaving total>12\norder by total desc, a.FirstName asc;')
=============
New Query

Select s.FirstName, s.LastName, s.NetID, sub.total
From  Students s, (
Select e.netid, sum(e.credits) AS total
From Enrollments e
Group by e.netid
) sub
Where s.netid = sub.netid && sub.total > 12
Order by sub.total DESC, s.firstname

['Students', 's']
s
['(\nSelect', 'e.netid']
e.netid
['sum(e.credits)', 'AS', 'total\nFrom', 'Enrollments', 'e\nGroup', 'by', 'e.netid\n)', 'sub']
sub
Parsed:  (162, 'Select a.FirstName, a.LastName, a.NetID, c.total\nFrom  Students a, (\nSelect b, sum(e.credits) AS total\nFrom Enrollments e\nGroup by b\n) c\nWhere a.netid = c.netid && c.total > 12\nOrder by c.total DESC, a.firstname\n')
=============
New Query

SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits) FROM Students JOIN Enrollments ON Students.NetId = Enrollments.NetId GROUP BY Students.FirstName, Students.LastName, Students.NetId HAVING SUM(Enrollments.Credits) > 12 ORDER BY SUM(Enrollments.Credits) DESC, Students.FirstName ASC
['Students']
['Enrollments']
Parsed:  (163, 'SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits) FROM Students JOIN Enrollments ON Students.NetId = Enrollments.NetId GROUP BY Students.FirstName, Students.LastName, Students.NetId HAVING SUM(Enrollments.Credits) > 12 ORDER BY SUM(Enrollments.Credits) DESC, Students.FirstName ASC')
=============
New Query

SELECT  FirstName, LastName, s.NetId, SUM(Credits) AS total_credits
FROM    Students s LEFT JOIN Enrollments e ON s.NetId = e.NetId
GROUP BY NetId
HAVING  total_credits > 12
ORDER BY total_credits DESC, FirstName ASC
['Students', 's']
['Enrollments', 'e']
Parsed:  (164, 'SELECT  FirstName, LastName, a.NetId, SUM(Credits) AS total_credits\nFROM    Students a LEFT JOIN Enrollments b ON a.NetId = b.NetId\nGROUP BY NetId\nHAVING  total_credits > 12\nORDER BY total_credits DESC, FirstName ASC')
=============
New Query

SELECT FirstName, LastName, Students.NetId, TotalCredits
FROM Students, (SELECT NetId, SUM(Credits) AS TotalCredits FROM Enrollments GROUP BY NetId) AS StudentWorkLoads
WHERE Students.NetId = StudentWorkLoads.NetId AND StudentWorkLoads.TotalCredits > 12
ORDER BY TotalCredits DESC, FirstName ASC;
['TotalCredits', 'DESC']
desc
['FirstName', 'ASC']
asc
Parsed:  (165, 'SELECT FirstName, LastName, Students.NetId, TotalCredits\nFROM Students, (SELECT NetId, SUM(Credits) AS TotalCredits FROM Enrollments GROUP BY NetId) AS StudentWorkLoads\nWHERE Students.NetId = StudentWorkLoads.NetId AND StudentWorkLoads.TotalCredits > 12\nORDER BY TotalCredits DESC, FirstName ASC;')
=============
New Query

SELECT FirstName, LastName, Students.NetId, SUM(Credits)
FROM Students INNER JOIN Enrollments ON (Students.NetId = Enrollments.NetId)
GROUP BY Students.NetId
HAVING SUM(Credits) > 12
ORDER BY SUM(Credits) DESC, FirstName ASC


['Students']
['Enrollments']
Parsed:  (166, 'SELECT FirstName, LastName, Students.NetId, SUM(Credits)\nFROM Students INNER JOIN Enrollments ON (Students.NetId = Enrollments.NetId)\nGROUP BY Students.NetId\nHAVING SUM(Credits) > 12\nORDER BY SUM(Credits) DESC, FirstName ASC\n\n')
=============
New Query

SELECT s.FirstName , s.LastName, s.NetId, a.sum_credit
FROM (SELECT SUM(Credits) sum_credit, NetId FROM Enrollments GROUP BY NetId) a JOIN Students s ON a.NetId = s.NetId
WHERE a.sum_credit > 12
ORDER BY a.sum_credit DESC, s.FirstName ASC
['(SELECT', 'SUM(Credits)', 'sum_credit,', 'NetId', 'FROM', 'Enrollments', 'GROUP', 'BY', 'NetId)', 'a']
['Students', 's']
Parsed:  (167, 'SELECT b.FirstName , b.LastName, b.NetId, a.sum_credit\nFROM (SELECT SUM(Credits) sum_credit, NetId FROM Enrollments GROUP BY NetId) a JOIN Students b ON a.NetId = b.NetId\nWHERE a.sum_credit > 12\nORDER BY a.sum_credit DESC, b.FirstName ASC')
=============
New Query

select s.FirstName, s.LastName, e.NetId, sum(e.Credits) as creds
from Students s join Enrollments e on s.NetId = e.NetId
group by e.NetId
having creds > 12
order by creds desc, s.FirstName;

more than one
=============
New Query

SELECT FirstName, LastName, s.NetId, SUM(e.Credits)
FROM Enrollments e JOIN Students s ON s.NetId = e.NetId JOIN Courses c ON c.CRN = e.CRN
GROUP BY s.NetId
HAVING SUM(e.Credits) > 12
ORDER BY SUM(e.Credits) DESC, FirstName;
['Enrollments', 'e']
['Students', 's']
['Courses', 'c']
Parsed:  (169, 'SELECT FirstName, LastName, b.NetId, SUM(a.Credits)\nFROM Enrollments a JOIN Students b ON b.NetId = a.NetId JOIN Courses c ON c.CRN = a.CRN\nGROUP BY b.NetId\nHAVING SUM(a.Credits) > 12\nORDER BY SUM(a.Credits) DESC, FirstName;')
=============
New Query

SELECT FirstName, LastName, NetId, total_credits
FROM
(SELECT FirstName, LastName, s.NetId, SUM(Credits) as total_credits
FROM Students s
NATURAL JOIN Enrollments e
GROUP BY s.NetId) AS sub
WHERE total_credits > 12
ORDER BY total_credits DESC, FirstName
['(SELECT', 'FirstName,', 'LastName,', 's.NetId,', 'SUM(Credits)', 'as', 'total_credits\nFROM', 'Students', 's\nNATURAL', 'JOIN', 'Enrollments', 'e\nGROUP', 'BY', 's.NetId)', 'AS', 'sub']
Parsed:  (170, 'SELECT FirstName, LastName, NetId, total_credits\nFROM\n(SELECT FirstName, LastName, s.NetId, SUM(Credits) as total_credits\nFROM Students s\nNATURAL JOIN Enrollments e\nGROUP BY s.NetId) AS sub\nWHERE total_credits > 12\nORDER BY total_credits DESC, FirstName')
=============
New Query

SELECT s.FirstName, s.LastName, e.NetId, sum(e.Credits) sum_creds
FROM Enrollments e NATURAL JOIN Students s
GROUP by e.NetId
HAVING sum(e.Credits) > 12
ORDER by sum_creds DESC, s.firstName ASC
['Enrollments', 'e']
['Students', 's']
Parsed:  (171, 'SELECT b.FirstName, b.LastName, a.NetId, sum(a.Credits) sum_creds\nFROM Enrollments a NATURAL JOIN Students s\nGROUP by a.NetId\nHAVING sum(a.Credits) > 12\nORDER by sum_creds DESC, b.firstName ASC')
=============
New Query

SELECT S.FirstName, S.LastName, E.NetId, SUM(E.Credits)
FROM Enrollments E LEFT JOIN Students S
ON E.NetId = S.NetId
GROUP BY NetId
HAVING SUM(E.Credits)>12
ORDER BY SUM(E.Credits) DESC, S.FirstName ;
['Enrollments', 'E']
['Students', 'S']
Parsed:  (172, 'SELECT b.FirstName, b.LastName, a.NetId, SUM(a.Credits)\nFROM Enrollments a LEFT JOIN Students S\nON a.NetId = b.NetId\nGROUP BY NetId\nHAVING SUM(a.Credits)>12 \nORDER BY SUM(a.Credits) DESC, b.FirstName ;')
=============
New Query

SELECT FirstName, LastName, NetId, SUM(Credits)
FROM Students NATURAL JOIN Enrollments
GROUP BY NetId
HAVING SUM(Credits) > 12
ORDER BY SUM(Credits) DESC, FirstName
['Students']
['Enrollments']
Parsed:  (173, 'SELECT FirstName, LastName, NetId, SUM(Credits)\nFROM Students NATURAL JOIN Enrollments\nGROUP BY NetId\nHAVING SUM(Credits) > 12\nORDER BY SUM(Credits) DESC, FirstName')
=============
New Query

Select Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits)
from Students, Enrollments
where Students.NetId = Enrollments.NetId
group by Students.NetId
having sum(Credits) > 12
order by sum(Credits) DESC, Students.FirstName ASC



Parsed:  (174, 'Select Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits)\nfrom Students, Enrollments\nwhere Students.NetId = Enrollments.NetId\ngroup by Students.NetId\nhaving sum(Credits) > 12 \norder by sum(Credits) DESC, Students.FirstName ASC\n\n\n')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, temp.sumCredits
From Students s,    (SELECT NetId, SUM(Credits) sumCredits
                    FROM Enrollments
                    GROUP BY NetId
                    HAVING SUM(Credits) > 12) AS temp
WHERE s.NetId = temp.NetId
ORDER BY temp.SumCredits DESC, s.FirstName
['Students', 's']
s
['(SELECT', 'NetId']
netid
['SUM(Credits)', 'sumCredits\n', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'FROM', 'Enrollments\n', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'GROUP', 'BY', 'NetId\n', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'HAVING', 'SUM(Credits)', '>', '12)', 'AS', 'temp']
temp
Parsed:  (175, 'SELECT a.FirstName, a.LastName, a.NetId, c.sumCredits\nFrom Students a,    (SELECT b, SUM(Credits) sumCredits\n                    FROM Enrollments\n                    GROUP BY b\n                    HAVING SUM(Credits) > 12) AS c\nWHERE a.NetId = c.NetId\nORDER BY c.SumCredits DESC, a.FirstName')
=============
New Query

SELECT FirstName, LastName, NetId, SUM(Credits)
FROM Students NATURAL JOIN Enrollments
GROUP BY NetId
HAVING SUM(Credits)>12
ORDER BY SUM(Credits) DESC, FirstName
['Students']
['Enrollments']
Parsed:  (176, 'SELECT FirstName, LastName, NetId, SUM(Credits)\nFROM Students NATURAL JOIN Enrollments \nGROUP BY NetId\nHAVING SUM(Credits)>12\nORDER BY SUM(Credits) DESC, FirstName')
=============
New Query

SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits) as Credits
FROM Students
INNER JOIN Enrollments ON Students.NetId=Enrollments.NetID
GROUP BY Students.NetId
HAVING Credits > 12
ORDER BY Credits DESC, Students.FirstName
['Students']
['Enrollments']
['Credits', 'DESC']
desc
['Students.FirstName']
students.firstname
Parsed:  (177, 'SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits) as Credits\nFROM Students\nINNER JOIN Enrollments ON Students.NetId=Enrollments.NetID\nGROUP BY Students.NetId\nHAVING Credits > 12\nORDER BY Credits DESC, Students.FirstName')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, SUM(e.Credits)
FROM Students s NATURAL JOIN Enrollments e
GROUP BY FirstName, LastName, NetId
HAVING SUM(e.Credits) > 12
ORDER BY SUM(e.Credits) DESC, s.FirstName;
['Students', 's']
['Enrollments', 'e']
Parsed:  (178, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFROM Students a NATURAL JOIN Enrollments e\nGROUP BY FirstName, LastName, NetId\nHAVING SUM(b.Credits) > 12\nORDER BY SUM(b.Credits) DESC, a.FirstName;')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, SUM(e.Credits)
FROM Students s
  JOIN Enrollments e ON s.NetId = e.NetId
GROUP BY NetId HAVING SUM(Credits) > 12
ORDER BY SUM(e.Credits) DESC, s.FirstName ASC;

['Students', 's']
['Enrollments', 'e']
Parsed:  (179, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFROM Students s\n  JOIN Enrollments b ON a.NetId = b.NetId\nGROUP BY NetId HAVING SUM(Credits) > 12\nORDER BY SUM(b.Credits) DESC, a.FirstName ASC;')
=============
New Query

SELECT S1.FirstName, S1.LastName, S1.NetID, temp.CRD
FROM Students S1, (SELECT S.NetId, SUM(Credits) AS CRD
    FROM Students S NATURAL JOIN Enrollments E
    GROUP BY S.NetId) AS temp

WHERE temp.CRD > 12 AND S1.NetId = temp.NetId
ORDER BY temp.CRD DESC, S1.FirstName
['Students', 'S1']
s1
['(SELECT', 'S.NetId']
s.netid
['SUM(Credits)', 'AS', 'CRD\n', '', '', '', 'FROM', 'Students', 'S', 'NATURAL', 'JOIN', 'Enrollments', 'E\n', '', '', '', 'GROUP', 'BY', 'S.NetId)', 'AS', 'temp']
temp
Parsed:  (180, 'SELECT a.FirstName, a.LastName, a.NetID, c.CRD\nFROM Students a, (SELECT b, SUM(Credits) AS CRD\n    FROM Students S NATURAL JOIN Enrollments E\n    GROUP BY S.NetId) AS c\n    \nWHERE c.CRD > 12 AND a.NetId = c.NetId\nORDER BY c.CRD DESC, a.FirstName ')
=============
New Query

SELECT FirstName,LastName,Students.NetId,SUM(credits)
FROM Enrollments LEFT OUTER JOIN Students
 ON Enrollments.NetId = Students.NetId
GROUP BY NetId
HAVING SUM(Credits) > 12
ORDER BY SUM(credits) DESC ,FirstName ASC;
['Enrollments']
['Students']
Parsed:  (181, 'SELECT FirstName,LastName,Students.NetId,SUM(credits)\nFROM Enrollments LEFT OUTER JOIN Students\n ON Enrollments.NetId = Students.NetId\nGROUP BY NetId \nHAVING SUM(Credits) > 12\nORDER BY SUM(credits) DESC ,FirstName ASC;')
=============
New Query

select FirstName, LastName, NetId, sum(Enrollments.Credits) as total
from Students natural join Enrollments
group by Students.NetId
having total >12
order by total DESC, Students.FirstName



['Students']
['Enrollments']
['total', 'DESC']
desc
['Students.FirstName']
students.firstname
Parsed:  (182, 'select FirstName, LastName, NetId, sum(Enrollments.Credits) as total\nfrom Students natural join Enrollments\ngroup by Students.NetId\nhaving total >12\norder by total DESC, Students.FirstName\n\n\n')
=============
New Query

SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits)
FROM Students
NATURAL JOIN Enrollments
GROUP BY Students.NetId
HAVING SUM(Enrollments.Credits) > 12
ORDER BY SUM(Enrollments.Credits) DESC, Students.FirstName ASC;
['Students']
['Enrollments']
Parsed:  (183, 'SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits) \nFROM Students\nNATURAL JOIN Enrollments \nGROUP BY Students.NetId \nHAVING SUM(Enrollments.Credits) > 12 \nORDER BY SUM(Enrollments.Credits) DESC, Students.FirstName ASC;')
=============
New Query

select s.FirstName, s.LastName, s.NetId, a.sum_credits from Students s join (select NetId,sum(credits) as sum_credits from Enrollments group by NetId having sum(credits) > 12 ) as a on s.NetId = a.NetId order by a.sum_credits desc, s.FirstName
['Students', 's']
['(select', 'NetId,sum(credits)', 'as', 'sum_credits', 'from', 'Enrollments', 'group', 'by', 'NetId', 'having', 'sum(credits)', '>', '12', ')', 'as', 'a']
Parsed:  (184, 'select b.FirstName, b.LastName, b.NetId, b.sum_credits from Students b join (select NetId,sum(credits) as sum_credits from Enrollments group by NetId having sum(credits) > 12 ) as b on b.NetId = b.NetId order by b.sum_credits desc, b.FirstName')
=============
New Query

SELECT FirstName, LastName, Students.NetId, SUM(Credits)
FROM Students, Enrollments
WHERE Students.NetId = Enrollments.NetId
GROUP BY FirstName, LastName, Students.NetId
HAVING SUM(Credits) > 12
ORDER BY SUM(Credits) DESC, FirstName
Parsed:  (185, 'SELECT FirstName, LastName, Students.NetId, SUM(Credits)\nFROM Students, Enrollments\nWHERE Students.NetId = Enrollments.NetId\nGROUP BY FirstName, LastName, Students.NetId\nHAVING SUM(Credits) > 12\nORDER BY SUM(Credits) DESC, FirstName')
=============
New Query

select Students.FirstName, Students.LastName, Students.NetId, sum(Enrollments.Credits) as CreditsSum
from Students
join Enrollments on Students.NetId=Enrollments.NetId
group by NetId
having sum(Enrollments.Credits) > 12
order by CreditsSum desc, FirstName
['Students']
['Enrollments']
['CreditsSum', 'desc']
desc
['FirstName']
firstname
Parsed:  (186, 'select Students.FirstName, Students.LastName, Students.NetId, sum(Enrollments.Credits) as CreditsSum\nfrom Students\njoin Enrollments on Students.NetId=Enrollments.NetId\ngroup by NetId\nhaving sum(Enrollments.Credits) > 12\norder by CreditsSum desc, FirstName')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, SUM(e.Credits) as credits
FROM Students s INNER JOIN Enrollments e
ON s.NetId = e.NetId
GROUP BY s.NetId
HAVING credits > 12
ORDER BY credits DESC, s.FirstName;
['Students', 's']
['Enrollments', 'e']
['credits', 'DESC']
desc
['s.FirstName']
s.firstname
Parsed:  (187, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits) as credits\nFROM Students a INNER JOIN Enrollments e\nON a.NetId = b.NetId\nGROUP BY a.NetId\nHAVING credits > 12\nORDER BY credits DESC, a.FirstName;')
=============
New Query

select
    FirstName, LastName, s.NetId, total.totalCredits
from
    Students s
    inner join
        (select
            NetId, sum(Credits) totalCredits
        from
            Enrollments
        group by NetId
        having totalCredits > 12) total
    on total.NetId = s.NetId
order by
    total.totalCredits desc, s.FirstName asc

['Students', 's']
['(select', '\n', '', '', '', '', '', '', '', '', '', '', '', 'NetId,', 'sum(Credits)', 'totalCredits\n', '', '', '', '', '', '', '', 'from', '\n', '', '', '', '', '', '', '', '', '', '', '', 'Enrollments\n', '', '', '', '', '', '', '', 'group', 'by', 'NetId\n', '', '', '', '', '', '', '', 'having', 'totalCredits', '>', '12)', 'total']
Parsed:  (188, 'select \n    FirstName, LastName, a.NetId, b.totalCredits\nfrom\n    Students s\n    inner join\n        (select \n            NetId, sum(Credits) totalCredits\n        from \n            Enrollments\n        group by NetId\n        having totalCredits > 12) total\n    on b.NetId = a.NetId\norder by \n    b.totalCredits desc, a.FirstName asc \n')
=============
New Query

select * from (select Students.FirstName, Students.LastName, Students.NetId, sum(Enrollments.credits) as total from Students, Enrollments
where Students.NetId = Enrollments.NetId
GROUP BY Students.NetId
Order by total DESC,  Students.FirstName) as T
where T.total > 12

['(select', 'Students.FirstName,', 'Students.LastName,', 'Students.NetId,', 'sum(Enrollments.credits)', 'as', 'total', 'from', 'Students,', 'Enrollments\nwhere', 'Students.NetId', '=', 'Enrollments.NetId', '\nGROUP', 'BY', 'Students.NetId\nOrder', 'by', 'total', 'DESC,', '', 'Students.FirstName)', 'as', 'T']
Parsed:  (189, 'select * from (select Students.FirstName, Students.LastName, Students.NetId, sum(Enrollments.credits) as total from Students, Enrollments\nwhere Students.NetId = Enrollments.NetId \nGROUP BY Students.NetId\nOrder by total DESC,  Students.FirstName) as T\nwhere a.total > 12\n')
=============
New Query

SELECT FirstName, LastName, NetId, SUM(Credits) AS TotalCredit
FROM Students NATURAL JOIN Enrollments
GROUP BY NetId
HAVING TotalCredit > 12
ORDER BY TotalCredit DESC, FirstName
['Students']
['Enrollments']
['TotalCredit', 'DESC']
desc
['FirstName']
firstname
Parsed:  (190, 'SELECT FirstName, LastName, NetId, SUM(Credits) AS TotalCredit\nFROM Students NATURAL JOIN Enrollments\nGROUP BY NetId\nHAVING TotalCredit > 12\nORDER BY TotalCredit DESC, FirstName ')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, SUM(e.Credits) as total_credits FROM
	Students s
	join Enrollments e on s.NetId = e.NetId
	GROUP BY s.NetId HAVING total_credits > 12
	ORDER BY total_credits DESC, s.FirstName ASC;
['Students', 's']
['Enrollments', 'e']
Parsed:  (191, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits) as total_credits FROM\n\tStudents s\n\tjoin Enrollments b on a.NetId = b.NetId\n\tGROUP BY a.NetId HAVING total_credits > 12 \n\tORDER BY total_credits DESC, a.FirstName ASC;')
=============
New Query

SELECT FirstName, LastName, Students.NetId, SUM(Enrollments.Credits)
FROM Students, Enrollments
WHERE Students.NetId = Enrollments.NetId
GROUP BY Enrollments.NetId
HAVING SUM(Enrollments.Credits) > 12
ORDER BY SUM(Enrollments.Credits) DESC, FirstName ASC;
Parsed:  (192, 'SELECT FirstName, LastName, Students.NetId, SUM(Enrollments.Credits)\nFROM Students, Enrollments\nWHERE Students.NetId = Enrollments.NetId\nGROUP BY Enrollments.NetId\nHAVING SUM(Enrollments.Credits) > 12\nORDER BY SUM(Enrollments.Credits) DESC, FirstName ASC;')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, sum(E.Credits) as total
FROM Students S JOIN Enrollments E ON S.NetId=E.NetId
GROUP BY NetId
HAVING total > 12
ORDER BY total DESC, S.FirstName ASC
['Students', 'S']
['Enrollments', 'E']
['total', 'DESC']
desc
['S.FirstName', 'ASC']
asc
Parsed:  (193, 'SELECT a.FirstName, a.LastName, a.NetId, sum(b.Credits) as total\nFROM Students a JOIN Enrollments b ON a.NetId=b.NetId\nGROUP BY NetId\nHAVING total > 12\nORDER BY total DESC, a.FirstName ASC')
=============
New Query

select
s.FirstName,
s.LastName,
s.NetId,
sum(e.Credits)
from Students s inner join Enrollments e on s.NetId=e.NetId
group by s.FirstName, s.LastName, s.NetId
having sum(e.Credits)>12
order by sum(e.Credits) desc, s.FirstName

['Students', 's']
['Enrollments', 'e']
Parsed:  (194, 'select \na.FirstName,\na.LastName, \na.NetId,\nsum(b.Credits)\nfrom Students a inner join Enrollments b on a.NetId=b.NetId\ngroup by a.FirstName, a.LastName, a.NetId\nhaving sum(b.Credits)>12\norder by sum(b.Credits) desc, a.FirstName\n')
=============
New Query

SELECT Students.FirstName, Students.LastName, Enrollments.NetId, sum(Enrollments.Credits)
FROM Students,Enrollments
WHERE Students.NetId=Enrollments.NetId
GROUP BY Enrollments.NetId
HAVING sum(Enrollments.Credits)>=13
ORDER BY sum(Enrollments.Credits) DESC, Students.FirstName
Parsed:  (195, 'SELECT Students.FirstName, Students.LastName, Enrollments.NetId, sum(Enrollments.Credits)\nFROM Students,Enrollments \nWHERE Students.NetId=Enrollments.NetId\nGROUP BY Enrollments.NetId\nHAVING sum(Enrollments.Credits)>=13\nORDER BY sum(Enrollments.Credits) DESC, Students.FirstName')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, SUM(E.Credits)
FROM Students S LEFT OUTER JOIN Enrollments E ON S.NetId = E.NetId
GROUP BY S.NetId
HAVING SUM(E.Credits) > 12
ORDER BY SUM(E.Credits) DESC, S.FirstNAme
['Students', 'S']
['Enrollments', 'E']
Parsed:  (196, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFROM Students a LEFT OUTER JOIN Enrollments b ON a.NetId = b.NetId\nGROUP BY a.NetId\nHAVING SUM(b.Credits) > 12\nORDER BY SUM(b.Credits) DESC, a.FirstNAme')
=============
New Query

select s.FirstName, s.Lastname, s.NetId, sum(e.Credits)
from Students s
inner join Enrollments e
on s.NetId = e.NetId
group by s.NetId
having sum(e.Credits) > 12
order by sum(e.Credits) desc, s.FirstName asc;
['Students', 's']
['Enrollments', 'e']
Parsed:  (197, 'select a.FirstName, a.Lastname, a.NetId, sum(b.Credits)\nfrom Students s\ninner join Enrollments e\non a.NetId = b.NetId\ngroup by a.NetId\nhaving sum(b.Credits) > 12\norder by sum(b.Credits) desc, a.FirstName asc;')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, T.SumCredits
FROM Students AS S,
(SELECT NetId, SUM(Credits) AS SumCredits FROM Enrollments GROUP BY NetId) AS T
WHERE S.NetId = T.NetId AND T.SumCredits > 12
ORDER BY T.SumCredits DESC, S.FirstName;

more than one
=============
New Query

select FirstName, LastName, NetId, total
from (
select FirstName as FirstName, LastName as LastName, S.NetId as NetId, sum(Credits) as total
from Students as S
left join Enrollments as E on S.NetId = E.NetId

group by S.NetId
order by total desc, FirstName asc
) as NM
where total > 12
['(\nselect', 'FirstName', 'as', 'FirstName,', 'LastName', 'as', 'LastName,', 'S.NetId', 'as', 'NetId,', 'sum(Credits)', 'as', 'total\nfrom', 'Students', 'as', 'S\nleft', 'join', 'Enrollments', 'as', 'E', 'on', 'S.NetId', '=', 'E.NetId\n\ngroup', 'by', 'S.NetId\norder', 'by', 'total', 'desc,', 'FirstName', 'asc\n)', 'as', 'NM']
Parsed:  (199, 'select FirstName, LastName, NetId, total\nfrom (\nselect FirstName as FirstName, LastName as LastName, S.NetId as NetId, sum(Credits) as total\nfrom Students as S\nleft join Enrollments as E on S.NetId = E.NetId\n\ngroup by S.NetId\norder by total desc, FirstName asc\n) as NM\nwhere total > 12')
=============
New Query

SELECT stud.FirstName, stud.LastName, stud.NetId, enr.Creds
FROM Students stud
NATURAL JOIN (SELECT NetId, SUM(Credits) as Creds FROM Enrollments GROUP BY NetId) enr
WHERE enr.Creds > 12
ORDER BY enr.Creds DESC, stud.FirstName ASC;
['Students', 'stud']
['(SELECT', 'NetId,', 'SUM(Credits)', 'as', 'Creds', 'FROM', 'Enrollments', 'GROUP', 'BY', 'NetId)', 'enr']
Parsed:  (200, 'SELECT a.FirstName, a.LastName, a.NetId, b.Creds\nFROM Students stud\nNATURAL JOIN (SELECT NetId, SUM(Credits) as Creds FROM Enrollments GROUP BY NetId) enr\nWHERE b.Creds > 12\nORDER BY b.Creds DESC, a.FirstName ASC;')
=============
New Query

select * from (select Students.FirstName, Students.LastName, Students.NetId, sum(Enrollments.Credits) as tot from Students left join Enrollments on Enrollments.NetId = Students.NetId group by Students.NetId order by tot desc, Students.FirstName asc) x where x.tot > 12
['(select', 'Students.FirstName,', 'Students.LastName,', 'Students.NetId,', 'sum(Enrollments.Credits)', 'as', 'tot', 'from', 'Students', 'left', 'join', 'Enrollments', 'on', 'Enrollments.NetId', '=', 'Students.NetId', 'group', 'by', 'Students.NetId', 'order', 'by', 'tot', 'desc,', 'Students.FirstName', 'asc)', 'x']
Parsed:  (201, 'select * from (select Students.FirstName, Students.LastName, Students.NetId, sum(Enrollments.Credits) as tot from Students left join Enrollments on Enrollments.NetId = Students.NetId group by Students.NetId order by tot desc, Students.FirstName asc) a where a.tot > 12    ')
=============
New Query

SELECT Students.FirstName, Students.LastName, Students.NetId, Sum(Enrollments.Credits) AS my_sum
FROM Students
JOIN Enrollments on Students.NetId = Enrollments.NetId
GROUP BY NetId
HAVING Sum(Enrollments.Credits) > 12
ORDER BY my_sum DESC, FirstName ASC;
['Students']
['Enrollments']
Parsed:  (202, 'SELECT Students.FirstName, Students.LastName, Students.NetId, Sum(Enrollments.Credits) AS my_sum\nFROM Students\nJOIN Enrollments on Students.NetId = Enrollments.NetId \nGROUP BY NetId\nHAVING Sum(Enrollments.Credits) > 12\nORDER BY my_sum DESC, FirstName ASC;')
=============
New Query

select FirstName, LastName, NetId, SUM(Credits)
from Students natural join Enrollments
group by NetId
Having SUM(Credits) > 12
order by SUM(Credits) desc, FirstName asc
['Students']
['Enrollments']
Parsed:  (203, 'select FirstName, LastName, NetId, SUM(Credits)\nfrom Students natural join Enrollments\ngroup by NetId\nHaving SUM(Credits) > 12\norder by SUM(Credits) desc, FirstName asc')
=============
New Query

SELECT Students.FirstName,
    Students.LastName,
    Students.NetId,
    (SELECT SUM(Enrollments.Credits) FROM Enrollments WHERE Enrollments.NetId = Students.NetId) AS totCredits
    FROM Students
    HAVING totCredits > 12
    ORDER BY totCredits DESC, Students.FirstName

['Students']
['totCredits', 'DESC']
desc
['Students.FirstName']
students.firstname
Parsed:  (204, 'SELECT Students.FirstName,\n    Students.LastName,\n    Students.NetId,\n    (SELECT SUM(Enrollments.Credits) FROM Enrollments WHERE Enrollments.NetId = Students.NetId) AS totCredits \n    FROM Students\n    HAVING totCredits > 12\n    ORDER BY totCredits DESC, Students.FirstName')
=============
New Query

SELECT Students.FirstName, Students.LastName, sub.NetId, sub.cred
FROM Students NATURAL JOIN (SELECT NetId, SUM(Credits) as cred
FROM Enrollments
GROUP BY NetId
HAVING SUM(Credits) > 12) as sub
ORDER BY sub.cred DESC, Students.FirstName ASC;
['Students']
['(SELECT', 'NetId,', 'SUM(Credits)', 'as', 'cred\nFROM', 'Enrollments', '\nGROUP', 'BY', 'NetId\nHAVING', 'SUM(Credits)', '>', '12)', 'as', 'sub']
Parsed:  (205, 'SELECT Students.FirstName, Students.LastName, a.NetId, a.cred\nFROM Students NATURAL JOIN (SELECT NetId, SUM(Credits) as cred\nFROM Enrollments \nGROUP BY NetId\nHAVING SUM(Credits) > 12) as sub\nORDER BY a.cred DESC, Students.FirstName ASC;')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, E.Total
FROM Students S
JOIN (
    SELECT NetId, SUM(Credits) AS Total
    FROM Enrollments
    GROUP BY NetId
    HAVING SUM(Credits) > 12
) AS E ON S.NetId = E.NetId
ORDER BY E.Total DESC, S.FirstName
['Students', 'S']
['(\n', '', '', '', 'SELECT', 'NetId,', 'SUM(Credits)', 'AS', 'Total\n', '', '', '', 'FROM', 'Enrollments\n', '', '', '', 'GROUP', 'BY', 'NetId\n', '', '', '', 'HAVING', 'SUM(Credits)', '>', '12\n)', 'AS', 'E']
Parsed:  (206, 'SELECT a.FirstName, a.LastName, a.NetId, b.Total\nFROM Students S\nJOIN (\n    SELECT NetId, SUM(Credits) AS Total\n    FROM Enrollments\n    GROUP BY NetId\n    HAVING SUM(Credits) > 12\n) AS b ON a.NetId = b.NetId\nORDER BY b.Total DESC, a.FirstName')
=============
New Query

SELECT FirstName, LastName, NetId, total_credit
FROM Students NATURAL JOIN (SELECT NetId, SUM(Credits) AS total_credit FROM Students NATURAL JOIN Enrollments GROUP BY NetId) AS Credits
WHERE total_credit > 12
ORDER BY total_credit DESC, FirstName ASC;
['Students']
['(SELECT', 'NetId,', 'SUM(Credits)', 'AS', 'total_credit', 'FROM', 'Students', 'NATURAL', 'JOIN', 'Enrollments', 'GROUP', 'BY', 'NetId)', 'AS', 'Credits']
Parsed:  (207, 'SELECT FirstName, LastName, NetId, total_credit\nFROM Students NATURAL JOIN (SELECT NetId, SUM(Credits) AS total_credit FROM Students NATURAL JOIN Enrollments GROUP BY NetId) AS Credits\nWHERE total_credit > 12\nORDER BY total_credit DESC, FirstName ASC;')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, SUM(e.Credits) AS credits
FROM Students s
NATURAL JOIN Enrollments e
GROUP BY s.NetId
HAVING SUM(e.Credits) > 12
ORDER BY credits DESC, s.FirstName ASC
['Students', 's']
['Enrollments', 'e']
['credits', 'DESC']
desc
['s.FirstName', 'ASC']
asc
Parsed:  (208, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits) AS credits\nFROM Students s\nNATURAL JOIN Enrollments e\nGROUP BY a.NetId\nHAVING SUM(b.Credits) > 12\nORDER BY credits DESC, a.FirstName ASC')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, SUM(E.Credits) FROM Students S
INNER JOIN Enrollments E ON S.NetId = E.NetId
GROUP BY E.NetId
HAVING SUM(E.Credits) > 12
ORDER BY SUM(E.Credits) DESC, FirstName

['Students', 'S']
['Enrollments', 'E']
Parsed:  (209, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits) FROM Students S\nINNER JOIN Enrollments b ON a.NetId = b.NetId\nGROUP BY b.NetId\nHAVING SUM(b.Credits) > 12\nORDER BY SUM(b.Credits) DESC, FirstName\n')
=============
New Query

SELECT s.FirstName, s.LastName, NetId, e.x
FROM Students s NATURAL JOIN
    (SELECT NetId, SUM(Credits) AS x FROM Enrollments GROUP BY NetID HAVING SUM(Credits) > 12) e
ORDER BY x DESC, s.FirstName
['Students', 's']
['(SELECT', 'NetId,', 'SUM(Credits)', 'AS', 'x', 'FROM', 'Enrollments', 'GROUP', 'BY', 'NetID', 'HAVING', 'SUM(Credits)', '>', '12)', 'e']
['x', 'DESC']
desc
['s.FirstName']
s.firstname
Parsed:  (210, 'SELECT a.FirstName, a.LastName, NetId, b.x\nFROM Students a NATURAL JOIN\n    (SELECT NetId, SUM(Credits) AS x FROM Enrollments GROUP BY NetID HAVING SUM(Credits) > 12) e\nORDER BY x DESC, a.FirstName')
=============
New Query

SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits) AS TotalCredit
FROM Students JOIN Enrollments ON Students.NetId = Enrollments.NetId
GROUP BY Enrollments.NetId HAVING TotalCredit > 12
ORDER BY TotalCredit DESC, Students.FirstName;
['Students']
['Enrollments']
['TotalCredit', 'DESC']
desc
['Students.FirstName']
students.firstname
Parsed:  (211, 'SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits) AS TotalCredit \nFROM Students JOIN Enrollments ON Students.NetId = Enrollments.NetId \nGROUP BY Enrollments.NetId HAVING TotalCredit > 12 \nORDER BY TotalCredit DESC, Students.FirstName;')
=============
New Query

SELECT FirstName, LastName, NetId, SumCredits
FROM Students stud NATURAL JOIN (SELECT NetId, SUM(Credits) SumCredits
                                    FROM Enrollments
                                    GROUP BY NetId) as temp
WHERE temp.SumCredits > 12
ORDER BY SumCredits DESC, FirstName
['Students', 'stud']
['(SELECT', 'NetId,', 'SUM(Credits)', 'SumCredits\n', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'FROM', 'Enrollments\n', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'GROUP', 'BY', 'NetId)', 'as', 'temp']
['SumCredits', 'DESC']
desc
['FirstName']
firstname
Parsed:  (212, 'SELECT FirstName, LastName, NetId, SumCredits\nFROM Students a NATURAL JOIN (SELECT NetId, SUM(Credits) SumCredits\n                                    FROM Enrollments\n                                    GROUP BY NetId) as temp\nWHERE b.SumCredits > 12\nORDER BY SumCredits DESC, FirstName')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, SUM(E.Credits)
FROM Students as S INNER JOIN Enrollments as E ON S.NetId = E.NetId
GROUP BY NetId
HAVING SUM(E.Credits) >= 13
ORDER BY SUM(E.Credits) DESC, S.FirstName ASC
['Students', 'as', 'S']
['Enrollments', 'as', 'E']
Parsed:  (213, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFROM Students as a INNER JOIN Enrollments as b ON a.NetId = b.NetId\nGROUP BY NetId\nHAVING SUM(b.Credits) >= 13\nORDER BY SUM(b.Credits) DESC, a.FirstName ASC')
=============
New Query

Select FirstName, LastName, NetId, temp.tcredits
From Students s Natural Join (SELECT NetID, SUM(Credits) as tcredits
                                FROM Enrollments
                                Group By NetId) as temp
Where temp.tcredits > 12
ORDER BY temp.tcredits DESC, FirstName ASC;


more than one
=============
New Query

select S.FirstName, S.LastName, E.NetId, E.Credit
from Students as S inner join (select NetId, sum(Credits) as Credit from Enrollments group by NetId) as E on S.NetId = E.NetId
where E.Credit > 12
order by E.Credit DESC, S.FirstName ASC;
['Students', 'as', 'S']
['(select', 'NetId,', 'sum(Credits)', 'as', 'Credit', 'from', 'Enrollments', 'group', 'by', 'NetId)', 'as', 'E']
Parsed:  (215, 'select a.FirstName, a.LastName, b.NetId, b.Credit\nfrom Students as a inner join (select NetId, sum(Credits) as Credit from Enrollments group by NetId) as b on a.NetId = b.NetId\nwhere b.Credit > 12\norder by b.Credit DESC, a.FirstName ASC;')
=============
New Query

SELECT Students.FirstName, Students.LastName, a.NetId, a.Credits
FROM Students NATURAL JOIN

(
SELECT NetId, sum(Credits) AS Credits
FROM Enrollments
GROUP BY NetId
HAVING sum(Credits) > 12

)AS a

ORDER BY Credits DESC, FirstName

#ON Students.NetID = a.NetID
['Students']
['(\nSELECT', 'NetId,', 'sum(Credits)', 'AS', 'Credits\nFROM', 'Enrollments\nGROUP', 'BY', 'NetId\nHAVING', 'sum(Credits)', '>', '12\n\n)AS', 'a']
['Credits', 'DESC']
desc
['FirstName', '\n\n#ON']


#on
Parsed:  (216, 'SELECT Students.FirstName, Students.LastName, a.NetId, a.Credits\nFROM Students NATURAL JOIN\n\n(\nSELECT NetId, sum(Credits) AS Credits\nFROM Enrollments\nGROUP BY NetId\nHAVING sum(Credits) > 12\n\n)AS a\n\nORDER BY Credits DESC, FirstName \n\n#ON Students.NetID = a.NetID')
=============
New Query

SELECT FirstName, LastName, Students.NetId, temp.hours
FROM Students,
     (SELECT sum(Credits) as hours, NetID
      FROM Enrollments
      GROUP BY NetID) as temp
WHERE temp.hours > 12 AND Students.NetId = temp.NetID
ORDER BY temp.hours desc, FirstName ASC;
Parsed:  (217, 'SELECT FirstName, LastName, Students.NetId, temp.hours\nFROM Students, \n     (SELECT sum(Credits) as hours, NetID\n      FROM Enrollments\n      GROUP BY NetID) as temp\nWHERE temp.hours > 12 AND Students.NetId = temp.NetID\nORDER BY temp.hours desc, FirstName ASC;')
=============
New Query

SELECT FirstName, LastName, NetId, SUM(Credits) as TotalHours
FROM Students NATURAL JOIN Enrollments
GROUP BY NetId
HAVING TotalHours > 12
ORDER BY TotalHours desc, FirstName asc;
['Students']
['Enrollments']
['TotalHours', 'desc']
desc
['FirstName', 'asc']
asc
Parsed:  (218, 'SELECT FirstName, LastName, NetId, SUM(Credits) as TotalHours\nFROM Students NATURAL JOIN Enrollments\nGROUP BY NetId\nHAVING TotalHours > 12\nORDER BY TotalHours desc, FirstName asc;')
=============
New Query

SELECT Students.FirstName, Students.LastName, Students.NetId, StudentCredit.TotalCredit
FROM Students, (SELECT SUM(Credits) AS TotalCredit, NetId
FROM Enrollments
GROUP BY NetId) as StudentCredit
WHERE Students.NetId = StudentCredit.NetId AND StudentCredit.TotalCredit > 12
ORDER BY TotalCredit DESC, Students.FirstName ASC;
['TotalCredit', 'DESC']
desc
['Students.FirstName', 'ASC']
asc
Parsed:  (219, 'SELECT Students.FirstName, Students.LastName, Students.NetId, StudentCredit.TotalCredit\nFROM Students, (SELECT SUM(Credits) AS TotalCredit, NetId\nFROM Enrollments\nGROUP BY NetId) as StudentCredit\nWHERE Students.NetId = StudentCredit.NetId AND StudentCredit.TotalCredit > 12\nORDER BY TotalCredit DESC, Students.FirstName ASC;')
=============
New Query

SELECT FirstName, LastName, Students.NetId, sum_credit
FROM Students NATURAL JOIN (
    SELECT sum(Credits) AS sum_credit, NetId
    FROM Enrollments E
    group by NetId
)S
where sum_credit > 12
ORDER BY sum_credit DESC, FirstName ASC;
['Students']
['(\n', '', '', '', 'SELECT', 'sum(Credits)', 'AS', 'sum_credit,', 'NetId\n', '', '', '', 'FROM', 'Enrollments', 'E\n', '', '', '', 'group', 'by', 'NetId\n)S']
Parsed:  (220, 'SELECT FirstName, LastName, Students.NetId, sum_credit\nFROM Students NATURAL JOIN (\n    SELECT sum(Credits) AS sum_credit, NetId\n    FROM Enrollments E\n    group by NetId\n)S\nwhere sum_credit > 12\nORDER BY sum_credit DESC, FirstName ASC;')
=============
New Query

select FirstName, LastName, NetId, sum(Credits)
from Students natural join Enrollments
group by NetId
having sum(Credits)>12
order by sum(Credits) desc, FirstName

['Students']
['Enrollments']
Parsed:  (221, 'select FirstName, LastName, NetId, sum(Credits)\nfrom Students natural join Enrollments\ngroup by NetId\nhaving sum(Credits)>12\norder by sum(Credits) desc, FirstName\n')
=============
New Query

SELECT DISTINCT Students.FirstName, Students.LastName, Students.NetID, Hours.Cre
FROM Students LEFT JOIN (
    SELECT NetId, SUM(Credits) AS Cre
    FROM Enrollments
    GROUP BY NetId
    HAVING SUM(Credits) > 12
) Hours
ON Students.NetId = Hours.NetId
WHERE Hours.Cre > 12
ORDER BY Hours.Cre DESC, Students.FirstName ASC
['Students']
['(\n', '', '', '', 'SELECT', 'NetId,', 'SUM(Credits)', 'AS', 'Cre\n', '', '', '', 'FROM', 'Enrollments\n', '', '', '', 'GROUP', 'BY', 'NetId\n', '', '', '', 'HAVING', 'SUM(Credits)', '>', '12\n)', 'Hours']
Parsed:  (222, 'SELECT DISTINCT Students.FirstName, Students.LastName, Students.NetID, a.Cre\nFROM Students LEFT JOIN (\n    SELECT NetId, SUM(Credits) AS Cre\n    FROM Enrollments\n    GROUP BY NetId\n    HAVING SUM(Credits) > 12\n) Hours\nON Students.NetId = a.NetId\nWHERE a.Cre > 12\nORDER BY a.Cre DESC, Students.FirstName ASC')
=============
New Query

SELECT FirstName, LastName, NetId, SUM(Credits)
FROM Students A NATURAL JOIN Enrollments B
GROUP BY NetId
HAVING SUM(Credits) > 12
ORDER BY SUM(Credits) DESC, FirstName;

more than one
=============
New Query

SELECT FirstName, LastName, temp.NetId, total FROM ((SELECT NetId, SUM(Credits) AS total  FROM Enrollments GROUP BY NetId)AS temp JOIN Students AS s ON temp.NetId = s.NetId) WHERE total > 12  ORDER BY total DESC, FirstName ASC
['total', 'DESC']
desc
['FirstName', 'ASC']
asc
Parsed:  (224, 'SELECT FirstName, LastName, temp.NetId, total FROM ((SELECT NetId, SUM(Credits) AS total  FROM Enrollments GROUP BY NetId)AS temp JOIN Students AS s ON temp.NetId = s.NetId) WHERE total > 12  ORDER BY total DESC, FirstName ASC')
=============
New Query

select FirstName, LastName, Students.NetId as ID, SumCredits from (select NetId, sum(Credits) as SumCredits from Enrollments group by NetId) as temp, Students where temp.SumCredits>12 and temp.NetId=Students.NetId order by SumCredits desc, FirstName
['SumCredits', 'desc']
desc
['FirstName']
firstname
Parsed:  (225, 'select FirstName, LastName, Students.NetId as ID, SumCredits from (select NetId, sum(Credits) as SumCredits from Enrollments group by NetId) as temp, Students where temp.SumCredits>12 and temp.NetId=Students.NetId order by SumCredits desc, FirstName')
=============
New Query

SELECT FirstName, LastName, NetID, sum(Credits)
FROM Students NATURAL JOIN  Enrollments
GROUP BY NetID
HAVING sum(Credits)>12
ORDER BY sum(Credits) DESC, FirstName
['Students']
['Enrollments']
Parsed:  (226, 'SELECT FirstName, LastName, NetID, sum(Credits)\nFROM Students NATURAL JOIN  Enrollments\nGROUP BY NetID\nHAVING sum(Credits)>12\nORDER BY sum(Credits) DESC, FirstName')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetID, SUM(E.Credits) as TotalCredits
FROM Students S JOIN Enrollments E
    ON S.NetID = E.NetID
GROUP BY E.NetID
HAVING TotalCredits > 12
ORDER BY TotalCredits DESC,
        S.FirstName ASC ;


more than one
=============
New Query

select FirstName, LastName, NetId, SUM(Credits)
from Students S Natural Join Enrollments E
group by NetId
having SUM(Credits) > 12
order by SUM(Credits) DESC, FirstName ASC;
['Students', 'S']
['Enrollments', 'E']
Parsed:  (228, 'select FirstName, LastName, NetId, SUM(Credits)\nfrom Students a Natural Join Enrollments E\ngroup by NetId\nhaving SUM(Credits) > 12\norder by SUM(Credits) DESC, FirstName ASC;')
=============
New Query

SELECT s.FirstName, s.LastName, e.NetId, Sum(Credits)
FROM Students s, Enrollments e, Courses c
WHERE s.NetId=e.NetId AND e.CRN=c.CRN
GROUP BY e.NetID
HAVING Sum(Credits)>12
ORDER BY Sum(Credits) DESC, s.FirstName;


more than one
=============
New Query

SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits)
FROM Students, Enrollments
WHERE Students.NetId = Enrollments.NetId
GROUP BY Students.FirstName, Students.LastName, Students.NetId
HAVING SUM(Enrollments.Credits) > 12
ORDER BY SUM(Enrollments.Credits) DESC, Students.FirstName ASC
Parsed:  (230, 'SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits)\nFROM Students, Enrollments\nWHERE Students.NetId = Enrollments.NetId \nGROUP BY Students.FirstName, Students.LastName, Students.NetId\nHAVING SUM(Enrollments.Credits) > 12\nORDER BY SUM(Enrollments.Credits) DESC, Students.FirstName ASC')
=============
New Query

SELECT *
FROM (
    SELECT FirstName, LastName, NetId, Sum(Credits) AS TotalCredits
    FROM Students NATURAL JOIN Enrollments
    GROUP BY NetId
    ORDER BY TotalCredits DESC, FirstName)
    AS Temp
WHERE Temp.TotalCredits > 12
['(\n', '', '', '', 'SELECT', 'FirstName,', 'LastName,', 'NetId,', 'Sum(Credits)', 'AS', 'TotalCredits\n', '', '', '', 'FROM', 'Students', 'NATURAL', 'JOIN', 'Enrollments\n', '', '', '', 'GROUP', 'BY', 'NetId\n', '', '', '', 'ORDER', 'BY', 'TotalCredits', 'DESC,', 'FirstName)\n', '', '', '', 'AS', 'Temp']
Parsed:  (231, 'SELECT * \nFROM (\n    SELECT FirstName, LastName, NetId, Sum(Credits) AS TotalCredits\n    FROM Students NATURAL JOIN Enrollments\n    GROUP BY NetId\n    ORDER BY TotalCredits DESC, FirstName)\n    AS Temp\nWHERE a.TotalCredits > 12')
=============
New Query

SELECT DISTINCT FirstName, LastName, NetId, SUM(Credits) AS Total_Credits
FROM Students NATURAL JOIN Enrollments
GROUP BY NetId
HAVING SUM(Credits) > 12
ORDER BY Total_Credits DESC, FirstName;
['Students']
['Enrollments']
Parsed:  (232, 'SELECT DISTINCT FirstName, LastName, NetId, SUM(Credits) AS Total_Credits\nFROM Students NATURAL JOIN Enrollments\nGROUP BY NetId\nHAVING SUM(Credits) > 12\nORDER BY Total_Credits DESC, FirstName;')
=============
New Query

SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits) as TotalCredits
FROM Students
INNER JOIN Enrollments ON Students.NetId = Enrollments.NetId
GROUP BY Students.NetId
HAVING TotalCredits > 12
ORDER BY TotalCredits DESC, Students.FirstName;

more than one
=============
New Query

SELECT s2.FirstName, s2.LastName, s2.NetId, sum(Credits) as TotalCredits
FROM Students s2 LEFT JOIN Enrollments e2
    ON s2.NetId = e2.NetId
    GROUP BY s2.NetId
Having TotalCredits > 12
ORDER BY TotalCredits desc, s2.FirstName;




more than one
=============
New Query

SELECT FirstName, LastName, Students.NetId, SUM(Credits)
FROM Students NATURAL JOIN Enrollments
GROUP BY Students.NetId
HAVING SUM(Credits) > 12
ORDER BY SUM(Credits) DESC, FirstName
['Students']
['Enrollments']
Parsed:  (235, 'SELECT FirstName, LastName, Students.NetId, SUM(Credits)\nFROM Students NATURAL JOIN Enrollments\nGROUP BY Students.NetId\nHAVING SUM(Credits) > 12\nORDER BY SUM(Credits) DESC, FirstName')
=============
New Query

SELECT DISTINCT St.FirstName, St.LastName, St.NetId, ( SELECT SUM(Credits)
        FROM Enrollments En2
        WHERE En2.NetId = St.NetId
        GROUP BY En2.NetId
      ) AS Total_credits
FROM Students St, Enrollments En
WHERE ( SELECT SUM(Credits)
        FROM Enrollments En2
        WHERE En2.NetId = St.NetId
        GROUP BY En2.NetId
      ) > 12
ORDER BY Total_credits DESC, St.FirstName

['Students', 'St']
st
['Enrollments', 'En']
en
Parsed:  (236, 'SELECT DISTINCT a.FirstName, a.LastName, a.NetId, ( SELECT SUM(Credits)\n        FROM Enrollments En2\n        WHERE En2.NetId = a.NetId\n        GROUP BY En2.NetId\n      ) AS Total_credits\nFROM Students a, Enrollments b\nWHERE ( SELECT SUM(Credits)\n        FROM Enrollments En2\n        WHERE En2.NetId = a.NetId\n        GROUP BY En2.NetId\n      ) > 12\nORDER BY Total_credits DESC, a.FirstName')
=============
New Query

SELECT Students.FirstName, Students.LastName, Enrollments.NetId, SUM(Enrollments.Credits)
FROM Students RIGHT JOIN Enrollments
ON Students.NetId = Enrollments.NetId
GROUP BY NetId
HAVING SUM(Enrollments.Credits) > 12
ORDER BY SUM(Enrollments.Credits) DESC, Students.FirstName;

more than one
=============
New Query

SELECT FirstName, LastName, NetId, temp2.Credits
    FROM (
    SELECT temp.NetID, temp.Credits
    FROM (SELECT NetId, SUM(Credits) as Credits
        FROM Students NATURAL JOIN Enrollments
        GROUP BY NetId) as temp
    WHERE temp.Credits > 12 ) as temp2 NATURAL JOIN Students
ORDER BY temp2.Credits DESC, FirstName ASC
['(\n', '', '', '', 'SELECT', 'temp.NetID,', 'temp.Credits', '\n', '', '', '', 'FROM', '(SELECT', 'NetId,', 'SUM(Credits)', 'as', 'Credits\n', '', '', '', '', '', '', '', 'FROM', 'Students', 'NATURAL', 'JOIN', 'Enrollments\n', '', '', '', '', '', '', '', 'GROUP', 'BY', 'NetId)', 'as', 'temp\n', '', '', '', 'WHERE', 'temp.Credits', '>', '12', ')', 'as', 'temp2']
['Students']
Parsed:  (238, 'SELECT FirstName, LastName, NetId, a.Credits\n    FROM (\n    SELECT temp.NetID, temp.Credits \n    FROM (SELECT NetId, SUM(Credits) as Credits\n        FROM Students NATURAL JOIN Enrollments\n        GROUP BY NetId) as temp\n    WHERE temp.Credits > 12 ) as a NATURAL JOIN Students\nORDER BY a.Credits DESC, FirstName ASC')
=============
New Query

SELECT firstName, lastName, NetId, SUM(Credits)
FROM Students NATURAL JOIN Enrollments
GROUP BY NetID
HAVING SUM(Credits) > 12
ORDER BY SUM(Credits) DESC, firstName ASC;

more than one
=============
New Query

SELECT t.FirstName, t.LastName, t.NetId, t.sm
FROM
(SELECT SUM(E.Credits) as sm, S.NetId, S.FirstName, S.LastName
FROM Students S
NATURAL JOIN Enrollments E
GROUP BY E.NetId)
as t
WHERE t.sm > 12
ORDER BY t.sm desc, t.FirstName

['(SELECT', 'SUM(E.Credits)', 'as', 'sm,', 'S.NetId,', 'S.FirstName,', 'S.LastName\nFROM', 'Students', 'S', '\nNATURAL', 'JOIN', 'Enrollments', 'E\nGROUP', 'BY', 'E.NetId)\nas', 't']
Parsed:  (240, 'SELECT a.FirstName, a.LastName, a.NetId, a.sm\nFROM\n(SELECT SUM(E.Credits) as sm, S.NetId, S.FirstName, S.LastName\nFROM Students S \nNATURAL JOIN Enrollments E\nGROUP BY E.NetId)\nas t\nWHERE a.sm > 12\nORDER BY a.sm desc, a.FirstName \n')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, SUM(Credits) as hours
FROM Students s NATURAL JOIN Enrollments e
GROUP BY NetId
HAVING SUM(Credits) > 12
ORDER BY hours DESC, s.FirstName



#Group Enrollments by netID
#Aggregate the credit hours for each group (netID)
#Return students who take more than 12 credit hours


#GROUP BY NetId
#HAVING SUM(Credits) > 12
['Students', 's']
['Enrollments', 'e']
['hours', 'DESC']
desc
['s.FirstName\n\n\n\n#Group']
s.firstname



#group
Parsed:  (241, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(Credits) as hours\nFROM Students a NATURAL JOIN Enrollments b \nGROUP BY NetId\nHAVING SUM(Credits) > 12\nORDER BY hours DESC, a.FirstName\n\n\n\n#Group Enrollments by netID\n#Aggregate the credit hours for each group (netID)\n#Return students who take more than 12 credit hours\n\n\n#GROUP BY NetId\n#HAVING SUM(Credits) > 12')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, SUM(e.Credits) AS "Total Credit"
FROM Students AS s, Enrollments e
WHERE e.NetId = s.NetId
GROUP BY e.NetId
HAVING SUM(e.Credits) > 12
ORDER BY SUM(Credits) DESC, s.FirstName ASC;
['Students', 'AS', 's']
s
['Enrollments', 'e']
e
Parsed:  (242, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits) AS "Total Credit"\nFROM Students AS a, Enrollments b\nWHERE b.NetId = a.NetId\nGROUP BY b.NetId\nHAVING SUM(b.Credits) > 12\nORDER BY SUM(Credits) DESC, a.FirstName ASC;')
=============
New Query

SELECT Students.FirstName, Students.LastName, Enrollments.NetId, SUM(Enrollments.Credits)
FROM Enrollments INNER JOIN Students
WHERE Students.NetId = Enrollments.NetId
GROUP BY Enrollments.NetId
HAVING SUM(Enrollments.Credits) > 12
ORDER BY SUM(Enrollments.Credits) DESC, Students.FirstName ASC;
['Enrollments']
['Students']
Parsed:  (243, 'SELECT Students.FirstName, Students.LastName, Enrollments.NetId, SUM(Enrollments.Credits)\nFROM Enrollments INNER JOIN Students\nWHERE Students.NetId = Enrollments.NetId\nGROUP BY Enrollments.NetId\nHAVING SUM(Enrollments.Credits) > 12\nORDER BY SUM(Enrollments.Credits) DESC, Students.FirstName ASC;')
=============
New Query

SELECT s.Firstname, s.LastName, s.NetId, c.tCredits
FROM Students s,
    (SELECT NetId, sum(Credits) as tCredits
     FROM Enrollments
     GROUP BY NetID) c
WHERE c.NetID = s.NetId and c.tCredits > 12
ORDER BY tCredits DESC, FirstName ASC
['Students', 's']
s
['(SELECT', 'NetId']
netid
['sum(Credits)', 'as', 'tCredits\n', '', '', '', '', 'FROM', 'Enrollments\n', '', '', '', '', 'GROUP', 'BY', 'NetID)', 'c']
c
['tCredits', 'DESC']
desc
['FirstName', 'ASC']
asc
Parsed:  (244, 'SELECT a.Firstname, a.LastName, a.NetId, c.tCredits\nFROM Students a, \n    (SELECT b, sum(Credits) as tCredits\n     FROM Enrollments\n     GROUP BY NetID) c\nWHERE c.NetID = a.NetId and c.tCredits > 12\nORDER BY tCredits DESC, FirstName ASC')
=============
New Query

SELECT s.FirstName, s.LastName, e.NetId, SUM(e.Credits) as sumcredits
From Students s JOIN Enrollments e on (s.NetId = e.NetId)
GROUP BY e.NetId
HAVING sumcredits > 12
ORDER BY sumcredits DESC, s.FirstName

['Students', 's']
['Enrollments', 'e']
['sumcredits', 'DESC']
desc
['s.FirstName']
s.firstname
Parsed:  (245, 'SELECT a.FirstName, a.LastName, b.NetId, SUM(b.Credits) as sumcredits\nFrom Students a JOIN Enrollments b on (a.NetId = b.NetId)\nGROUP BY b.NetId \nHAVING sumcredits > 12\nORDER BY sumcredits DESC, a.FirstName \n')
=============
New Query

SELECT FirstName, LastName, Students.NetId, SUM(Credits)
FROM Students, Enrollments
WHERE Students.NetId = Enrollments.NetId
GROUP BY FirstName, LastName, Students.NetId
HAVING SUM(Credits) > 12
ORDER BY SUM(Credits) DESC, FirstName ASC
Parsed:  (246, 'SELECT FirstName, LastName, Students.NetId, SUM(Credits)\nFROM Students, Enrollments\nWHERE Students.NetId = Enrollments.NetId\nGROUP BY FirstName, LastName, Students.NetId\nHAVING SUM(Credits) > 12\nORDER BY SUM(Credits) DESC, FirstName ASC')
=============
New Query

SELECT *
FROM
    ( SELECT S.FirstName, S.LastName, S.NetID, SUM(E.Credits) as Credits
      FROM Students S, Enrollments E
      WHERE S.NetID = E.NetID
      GROUP BY NetID) AS temp
WHERE temp.Credits >  12
ORDER BY Credits DESC, FirstName;
['(', 'SELECT', 'S.FirstName,', 'S.LastName,', 'S.NetID,', 'SUM(E.Credits)', 'as', 'Credits\n', '', '', '', '', '', 'FROM', 'Students', 'S,', 'Enrollments', 'E', '\n', '', '', '', '', '', 'WHERE', 'S.NetID', '=', 'E.NetID', '\n', '', '', '', '', '', 'GROUP', 'BY', 'NetID)', 'AS', 'temp']
['Credits', 'DESC']
desc
['FirstName']
firstname
Parsed:  (247, 'SELECT *\nFROM \n    ( SELECT S.FirstName, S.LastName, S.NetID, SUM(E.Credits) as Credits\n      FROM Students S, Enrollments E \n      WHERE S.NetID = E.NetID \n      GROUP BY NetID) AS temp\nWHERE a.Credits >  12\nORDER BY Credits DESC, FirstName;')
=============
New Query

SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits)
FROM Students
JOIN Enrollments ON Students.NetId=Enrollments.NetId
GROUP BY Students.NetId
HAVING SUM(Enrollments.Credits) > 12
ORDER BY SUM(Enrollments.Credits) DESC, Students.FirstName ASC;





more than one
=============
New Query

SELECT A.FirstName, A.LastName, A.NetID, SUM(B.Credits)
FROM Students A, Enrollments B
WHERE A.NetId = B.NetId
Group BY B.NetId
Having SUM(B.Credits)>12
ORDER BY SUM(B.Credits) DESC, A.FirstName



-- WHERE (
--         SELECT SUM(B.Credits)
--         Group BY B.NetId
--         Having COUNT(B.Credits)>3
--         )
    #    ORDER BY DESC)
#ORDER BY A.FirstName
['Students', 'A']
a
['Enrollments', 'B']
b
Parsed:  (249, 'SELECT a.FirstName, a.LastName, a.NetID, SUM(b.Credits)\nFROM Students a, Enrollments b\nWHERE a.NetId = b.NetId\nGroup BY b.NetId \nHaving SUM(b.Credits)>12\nORDER BY SUM(b.Credits) DESC, a.FirstName\n\n\n\n-- WHERE (\n--         SELECT SUM(b.Credits)\n--         Group BY b.NetId\n--         Having COUNT(b.Credits)>3\n--         )\n    #    ORDER BY DESC)\n#ORDER BY a.FirstName')
=============
New Query

SELECT FirstName, LastName, NetId, sum_credit
from Students natural join (
    select sum(Credits) as sum_credit, NetId
    FROM Enrollments E
    group by NetId) as A
where sum_credit > 12
Order by sum_credit DESC, FirstName
['Students']
['(\n', '', '', '', 'select', 'sum(Credits)', 'as', 'sum_credit,', 'NetId\n', '', '', '', 'FROM', 'Enrollments', 'E\n', '', '', '', 'group', 'by', 'NetId)', 'as', 'A']
Parsed:  (250, 'SELECT FirstName, LastName, NetId, sum_credit\nfrom Students natural join (\n    select sum(Credits) as sum_credit, NetId\n    FROM Enrollments E\n    group by NetId) as A\nwhere sum_credit > 12\nOrder by sum_credit DESC, FirstName')
=============
New Query

SELECT FirstName, LastName, S.NetId, SUM(Credits)
FROM Students S, Enrollments E
WHERE S.NetId = E.NetId
GROUP BY FirstName, LastName, S.NetId
HAVING SUM(Credits) > 12
ORDER BY SUM(Credits) DESC, FirstName
['Students', 'S']
s
['Enrollments', 'E']
e
Parsed:  (251, 'SELECT FirstName, LastName, a.NetId, SUM(Credits)\nFROM Students a, Enrollments b\nWHERE a.NetId = b.NetId\nGROUP BY FirstName, LastName, a.NetId\nHAVING SUM(Credits) > 12\nORDER BY SUM(Credits) DESC, FirstName')
=============
New Query

select FirstName, LastName, NetId, sum(Credits) as totalCredits
from Students natural join Enrollments
group by NetId
having sum(Credits) > 12
order by totalCredits DESC, FirstName ASC
['Students']
['Enrollments']
['totalCredits', 'DESC']
desc
['FirstName', 'ASC']
asc
Parsed:  (252, 'select FirstName, LastName, NetId, sum(Credits) as totalCredits \nfrom Students natural join Enrollments\ngroup by NetId\nhaving sum(Credits) > 12\norder by totalCredits DESC, FirstName ASC')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, temp.C
FROM Students S, (SELECT NetId, SUM(Credits) as C
                  FROM Enrollments
                  GROUP BY NetId) as temp
WHERE S.NetId = temp.NetId and temp.C > 12
ORDER BY temp.C DESC, S.Firstname
['Students', 'S']
s
['(SELECT', 'NetId']
netid
['SUM(Credits)', 'as', 'C\n', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'FROM', 'Enrollments\n', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'GROUP', 'BY', 'NetId)', 'as', 'temp']
temp
Parsed:  (253, 'SELECT a.FirstName, a.LastName, a.NetId, c.C\nFROM Students a, (SELECT b, SUM(Credits) as C\n                  FROM Enrollments\n                  GROUP BY NetId) as c\nWHERE a.NetId = c.NetId and c.C > 12\nORDER BY c.C DESC, a.Firstname')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, temp.totCredits
FROM Students s, (SELECT e.NetId AS net, SUM(e.Credits) AS totCredits FROM Enrollments e GROUP BY e.NetId HAVING SUM(e.Credits) > 12) AS temp
WHERE s.NetId = temp.net
ORDER BY temp.totCredits DESC, s.FirstName ASC;
['Students', 's']
s
['(SELECT', 'e.NetId', 'AS', 'net']
net
['SUM(e.Credits)', 'AS', 'totCredits', 'FROM', 'Enrollments', 'e', 'GROUP', 'BY', 'e.NetId', 'HAVING', 'SUM(e.Credits)', '>', '12)', 'AS', 'temp']
temp
Parsed:  (254, 'SELECT a.FirstName, a.LastName, a.NetId, c.totCredits\nFROM Students a, (SELECT e.NetId AS b, SUM(e.Credits) AS totCredits FROM Enrollments e GROUP BY e.NetId HAVING SUM(e.Credits) > 12) AS c\nWHERE a.NetId = c.net\nORDER BY c.totCredits DESC, a.FirstName ASC;')
=============
New Query

Select FirstName, LastName, Netid, SUM(Credits)
FROM Students NATURAL JOIN Enrollments
GROUP BY NetId
HAVING SUM(Credits)>12
ORDER BY SUM(Credits) DESC, FirstName
['Students']
['Enrollments']
Parsed:  (255, 'Select FirstName, LastName, Netid, SUM(Credits)\nFROM Students NATURAL JOIN Enrollments\nGROUP BY NetId\nHAVING SUM(Credits)>12\nORDER BY SUM(Credits) DESC, FirstName')
=============
New Query

select s.FirstName, s.LastName, s.NetId, hr.sm from Students s join (
select NetId, sum(Credits) as sm from Enrollments e group by e.NetID) hr on s.NetId=hr.NetId
where hr.sm > 12 order by hr.sm desc, s.FirstName
['Students', 's']
['(\nselect', 'NetId,', 'sum(Credits)', 'as', 'sm', 'from', 'Enrollments', 'e', 'group', 'by', 'e.NetID)', 'hr']
Parsed:  (256, 'select a.FirstName, a.LastName, a.NetId, b.sm from Students a join (\nselect NetId, sum(Credits) as sm from Enrollments e group by e.NetID) b on a.NetId=b.NetId\nwhere b.sm > 12 order by b.sm desc, a.FirstName')
=============
New Query

SELECT FirstName, LastName, NetId, (
    SELECT SUM(Credits) from Enrollments WHERE NetId=Students.Netid
) FROM Students WHERE (
    SELECT SUM(Credits) from Enrollments WHERE NetId=Students.Netid
) > 12 order by (
    SELECT SUM(Credits) from Enrollments WHERE NetId=Students.Netid
) DESC, FirstName;
['Students']
Parsed:  (257, 'SELECT FirstName, LastName, NetId, (\n    SELECT SUM(Credits) from Enrollments WHERE NetId=Students.Netid \n) FROM Students WHERE (\n    SELECT SUM(Credits) from Enrollments WHERE NetId=Students.Netid \n) > 12 order by (\n    SELECT SUM(Credits) from Enrollments WHERE NetId=Students.Netid \n) DESC, FirstName;')
=============
New Query

select Students.FirstName,
	   Students.LastName,
       Students.NetId,
       g.Credits
from Students

inner join (
  select Enrollments.NetId, sum(Enrollments.Credits) as Credits
  from Enrollments
  group by Enrollments.NetId
) as g on g.NetId = Students.NetId
where g.Credits > 12
order by g.Credits desc, Students.FirstName asc;
['Students']
['(\n', '', 'select', 'Enrollments.NetId,', 'sum(Enrollments.Credits)', 'as', 'Credits\n', '', 'from', 'Enrollments\n', '', 'group', 'by', 'Enrollments.NetId\n)', 'as', 'g']
Parsed:  (258, 'select Students.FirstName, \n\t   Students.LastName,\n       Students.NetId,\n       a.Credits\nfrom Students\n\ninner join (\n  select Enrollments.NetId, sum(Enrollments.Credits) as Credits\n  from Enrollments\n  group by Enrollments.NetId\n) as a on a.NetId = Students.NetId\nwhere a.Credits > 12\norder by a.Credits desc, Students.FirstName asc;')
=============
New Query

Select S.FirstName, S.LastName, S.NetId, SUM(E.credits) from Students S
JOIN Enrollments E ON S.NetId=E.NetId
GROUP by NetId
HAVING SUM(E.credits)>12
ORDER BY SUM(E.credits) DESC, S.FirstName ASC


['Students', 'S']
['Enrollments', 'E']
Parsed:  (259, 'Select a.FirstName, a.LastName, a.NetId, SUM(b.credits) from Students a \nJOIN Enrollments b ON a.NetId=b.NetId\nGROUP by NetId\nHAVING SUM(b.credits)>12\nORDER BY SUM(b.credits) DESC, a.FirstName ASC\n\n')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, SUM(E.Credits)
FROM Students S, Enrollments E
WHERE S.NetId = E.NetId
GROUP BY S.FirstName, S.LastName, S.NetId
HAVING SUM(E.Credits) > 12
ORDER BY SUM(E.Credits) DESC, S.FirstName
['Students', 'S']
s
['Enrollments', 'E']
e
Parsed:  (260, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFROM Students a, Enrollments b\nWHERE a.NetId = b.NetId\nGROUP BY a.FirstName, a.LastName, a.NetId\nHAVING SUM(b.Credits) > 12\nORDER BY SUM(b.Credits) DESC, a.FirstName')
=============
New Query

select FirstName, LastName,Students.NetId,sum(Enrollments.Credits) as SC
from Students
right join Enrollments
on Students.NetId=Enrollments.NetId
group by Students.NetId
having SC>12
order by SC DESC,Firstname ASC

['Students']
['Enrollments']
['SC', 'DESC']

desc
['Firstname', 'ASC']
asc
Parsed:  (261, 'select FirstName, LastName,Students.NetId,sum(Enrollments.Credits) as SC\nfrom Students \nright join Enrollments\non Students.NetId=Enrollments.NetId\ngroup by Students.NetId\nhaving SC>12\norder by SC DESC,Firstname ASC\n')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, Sum(e.Credits) as totalCredits
FROM Students s NATURAL JOIN Enrollments e
GROUP BY s.NetId
HAVING SUM(e.Credits) > 12
ORDER BY totalCredits DESC, s.FirstName ASC
['Students', 's']
['Enrollments', 'e']
['totalCredits', 'DESC']
desc
['s.FirstName', 'ASC']
asc
Parsed:  (262, 'SELECT a.FirstName, a.LastName, a.NetId, Sum(b.Credits) as totalCredits\nFROM Students a NATURAL JOIN Enrollments e\nGROUP BY a.NetId\nHAVING SUM(b.Credits) > 12\nORDER BY totalCredits DESC, a.FirstName ASC')
=============
New Query

SELECT  FirstName, LastName, NetId, SUM(Credits)
FROM    Students s NATURAL JOIN Enrollments e
GROUP BY LastName, FirstName, NetId
HAVING SUM(Credits) > 12
ORDER BY SUM(Credits) DESC, FirstName ASC;
['Students', 's']
['Enrollments', 'e']
Parsed:  (263, 'SELECT  FirstName, LastName, NetId, SUM(Credits) \nFROM    Students a NATURAL JOIN Enrollments e\nGROUP BY LastName, FirstName, NetId\nHAVING SUM(Credits) > 12\nORDER BY SUM(Credits) DESC, FirstName ASC;')
=============
New Query

select firstName, lastName, NetId, sum(Credits) as totalCredits from Enrollments natural join Students group by NetId having totalCredits > 12 order by totalCredits desc, firstName;
['Enrollments']
['Students']
['totalCredits', 'desc']
desc
['firstName']
firstname
Parsed:  (264, 'select firstName, lastName, NetId, sum(Credits) as totalCredits from Enrollments natural join Students group by NetId having totalCredits > 12 order by totalCredits desc, firstName;')
=============
New Query

SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits)
FROM Students
NATURAL JOIN Enrollments
GROUP BY FirstName, LastName, NetId
HAVING SUM(Credits) > 12
ORDER BY SUM(Credits) DESC, FirstName ASC;
['Students']
['Enrollments']
Parsed:  (265, 'SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Enrollments.Credits)\nFROM Students\nNATURAL JOIN Enrollments\nGROUP BY FirstName, LastName, NetId\nHAVING SUM(Credits) > 12\nORDER BY SUM(Credits) DESC, FirstName ASC;')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetID, SUM(e.Credits) as totalcreds
FROM Students s NATURAL JOIN Enrollments e
GROUP BY s.NetId, s.FirstName, s.LastName
HAVING totalcreds > 12
ORDER BY totalcreds DESC, s.FirstName ASC

['Students', 's']
['Enrollments', 'e']
['totalcreds', 'DESC']
desc
['s.FirstName', 'ASC']
asc
Parsed:  (266, 'SELECT a.FirstName, a.LastName, a.NetID, SUM(b.Credits) as totalcreds\nFROM Students a NATURAL JOIN Enrollments e\nGROUP BY a.NetId, a.FirstName, a.LastName\nHAVING totalcreds > 12\nORDER BY totalcreds DESC, a.FirstName ASC\n')
=============
New Query

SELECT DISTINCT s.FirstName, s.LastName, s.NetId, T.creds
FROM Students s, (SELECT SUM(Credits) as creds, NetId FROM Enrollments GROUP BY NetId) AS T
WHERE T.creds > 12 AND s.NetId = T.NetId ORDER BY T.creds DESC, s.FirstName ASC
['Students', 's']
s
['(SELECT', 'SUM(Credits)', 'as', 'creds']
creds
['NetId', 'FROM', 'Enrollments', 'GROUP', 'BY', 'NetId)', 'AS', 'T']
t
Parsed:  (267, 'SELECT DISTINCT a.FirstName, a.LastName, a.NetId, c.creds\nFROM Students a, (SELECT SUM(Credits) as b, NetId FROM Enrollments GROUP BY NetId) AS c\nWHERE c.creds > 12 AND a.NetId = c.NetId ORDER BY c.creds DESC, a.FirstName ASC')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, enrollInfo.totalCredits
FROM Students AS S, (SELECT NetId, SUM(Credits) As totalCredits
    FROM Enrollments
    GROUP BY NetId) AS enrollInfo
WHERE S.NetId = enrollInfo.NetId
    AND enrollInfo.totalCredits > 12
ORDER BY enrollInfo.totalCredits DESC, S.FirstName;
['Students', 'AS', 'S']
s
['(SELECT', 'NetId']
netid
['SUM(Credits)', 'As', 'totalCredits\n', '', '', '', 'FROM', 'Enrollments\n', '', '', '', 'GROUP', 'BY', 'NetId)', 'AS', 'enrollInfo']
enrollinfo
Parsed:  (268, 'SELECT a.FirstName, a.LastName, a.NetId, c.totalCredits\nFROM Students AS a, (SELECT b, SUM(Credits) As totalCredits\n    FROM Enrollments\n    GROUP BY NetId) AS c\nWHERE a.NetId = c.NetId\n    AND c.totalCredits > 12\nORDER BY c.totalCredits DESC, a.FirstName;')
=============
New Query

Select S.FirstName, S.LastName, S.NetId, SUM(E.Credits)
FROM Students S INNER JOIN Enrollments E ON S.NetId = E.NetId
GROUP BY NetId
HAVING SUM(E.Credits) > 12
ORDER BY SUM(E.Credits) DESC, S.FirstName ASC
['Students', 'S']
['Enrollments', 'E']
Parsed:  (269, 'Select a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFROM Students a INNER JOIN Enrollments b ON a.NetId = b.NetId\nGROUP BY NetId\nHAVING SUM(b.Credits) > 12\nORDER BY SUM(b.Credits) DESC, a.FirstName ASC')
=============
New Query

SELECT FirstName, LastName, NetId, TotalCredits.total
FROM Students NATURAL JOIN (SELECT NetId, SUM(credits) as total
                FROM Enrollments
                GROUP BY NetId
                HAVING SUM(Credits) > 12) AS TotalCredits

ORDER BY TotalCredits.total DESC, FirstName




['Students']
['(SELECT', 'NetId,', 'SUM(credits)', 'as', 'total\n', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'FROM', 'Enrollments\n', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'GROUP', 'BY', 'NetId\n', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'HAVING', 'SUM(Credits)', '>', '12)', 'AS', 'TotalCredits']
Parsed:  (270, 'SELECT FirstName, LastName, NetId, a.total\nFROM Students NATURAL JOIN (SELECT NetId, SUM(credits) as total\n                FROM Enrollments\n                GROUP BY NetId\n                HAVING SUM(Credits) > 12) AS TotalCredits\n\nORDER BY a.total DESC, FirstName\n\n\n\n')
=============
New Query

select s.FirstName, s.LastName, e.NetId, sum(e.Credits)
from Students s, Enrollments e
where e.NetID = s.NetID
group by e.NetId, s.FirstName, s.LastName
HAVING  sum(e.Credits) > 12
order by sum(e.Credits) DESC, s.FirstName;

more than one
=============
New Query

SELECT *
FROM
    (SELECT s.FirstName as fn, s.LastName, s.NetId, SUM(e.Credits) as creditSum
    FROM Students s, Enrollments e
    WHERE s.NetId = e.NetId
    GROUP BY s.NetId) as t
WHERE t.creditSum > 12
ORDER BY t.creditSum DESC, t.fn



['(SELECT', 's.FirstName', 'as', 'fn,', 's.LastName,', 's.NetId,', 'SUM(e.Credits)', 'as', 'creditSum\n', '', '', '', 'FROM', 'Students', 's,', 'Enrollments', 'e\n', '', '', '', 'WHERE', 's.NetId', '=', 'e.NetId\n', '', '', '', 'GROUP', 'BY', 's.NetId)', 'as', 't']
Parsed:  (272, 'SELECT *\nFROM \n    (SELECT s.FirstName as fn, s.LastName, s.NetId, SUM(e.Credits) as creditSum\n    FROM Students s, Enrollments e\n    WHERE s.NetId = e.NetId\n    GROUP BY s.NetId) as t\nWHERE a.creditSum > 12\nORDER BY a.creditSum DESC, a.fn\n\n\n')
=============
New Query

SELECT Students.FirstName, Students.LastName, Students.NetId, SUM(Credits)
FROM Students
JOIN Enrollments
ON Students.NetId=Enrollments.NetId
GROUP BY Students.NetId
HAVING (SUM(Credits) > 12)
ORDER BY SUM(Credits) desc, FirstName asc;

more than one
=============
New Query

SELECT * FROM (SELECT FirstName, LastName, NetId, SUM(credits) as credits FROM (SELECT * FROM Students S NATURAL JOIN Enrollments E) as temp GROUP BY NetID) as temp2 WHERE (credits > 12) ORDER BY credits DESC, FirstName
['(SELECT', 'FirstName,', 'LastName,', 'NetId,', 'SUM(credits)', 'as', 'credits', 'FROM', '(SELECT', '*', 'FROM', 'Students', 'S', 'NATURAL', 'JOIN', 'Enrollments', 'E)', 'as', 'temp', 'GROUP', 'BY', 'NetID)', 'as', 'temp2']
['credits', 'DESC']
desc
['FirstName']
firstname
Parsed:  (274, 'SELECT * FROM (SELECT FirstName, LastName, NetId, SUM(credits) as credits FROM (SELECT * FROM Students S NATURAL JOIN Enrollments E) as temp GROUP BY NetID) as a WHERE (credits > 12) ORDER BY credits DESC, FirstName')
=============
New Query

select Students.FirstName, Students.LastName, Students.NetId, Enrollments.SC as TotalCredits
from Students
    inner join (select NetId, sum(Credits) as SC from Enrollments group by NetId) Enrollments on Students.NetId = Enrollments.NetId
    where Enrollments.SC > 12
    order by Enrollments.SC desc, Students.FirstName

['Students']
['(select', 'NetId,', 'sum(Credits)', 'as', 'SC', 'from', 'Enrollments', 'group', 'by', 'NetId)', 'Enrollments']
Parsed:  (275, 'select Students.FirstName, Students.LastName, Students.NetId, a.SC as TotalCredits\nfrom Students\n    inner join (select NetId, sum(Credits) as SC from a group by NetId) a on Students.NetId = a.NetId\n    where a.SC > 12\n    order by a.SC desc, Students.FirstName\n    ')
=============
New Query

select FirstName, LastName, NetId, sum(Credits) as total
from Students natural join Enrollments
group by NetId
having total > 12
order by total desc, FirstName

['Students']
['Enrollments']
['total', 'desc']
desc
['FirstName']
firstname
Parsed:  (276, 'select FirstName, LastName, NetId, sum(Credits) as total\nfrom Students natural join Enrollments\ngroup by NetId\nhaving total > 12\norder by total desc, FirstName\n')
=============
New Query

SELECT DISTINCT FirstName, LastName, Students.NetId, totalCredits
FROM Students LEFT JOIN (SELECT Enrollments.NetId, SUM(credits) as totalCredits FROM Enrollments GROUP BY NetId) as Credits ON Students.NetId = Credits.NetId
WHERE totalCredits > 12
ORDER BY totalCredits DESC, FirstName
['Students']
['(SELECT', 'Enrollments.NetId,', 'SUM(credits)', 'as', 'totalCredits', 'FROM', 'Enrollments', 'GROUP', 'BY', 'NetId)', 'as', 'Credits']
['totalCredits', 'DESC']
desc
['FirstName']
firstname
Parsed:  (277, 'SELECT DISTINCT FirstName, LastName, Students.NetId, totalCredits\nFROM Students LEFT JOIN (SELECT Enrollments.NetId, SUM(credits) as totalCredits FROM Enrollments GROUP BY NetId) as a ON Students.NetId = a.NetId\nWHERE totalCredits > 12\nORDER BY totalCredits DESC, FirstName')
=============
New Query

SELECT s.FirstName, s.LastName, a.NetId, a.Sum
FROM Students s INNER JOIN
    (SELECT NetId, SUM(Credits) as Sum
    FROM Enrollments
    GROUP by NetId) AS a
WHERE s.NetId = a.NetId AND a.Sum > 12
ORDER BY a.Sum DESC, s.FirstName ASC
['Students', 's']
['(SELECT', 'NetId,', 'SUM(Credits)', 'as', 'Sum\n', '', '', '', 'FROM', 'Enrollments\n', '', '', '', 'GROUP', 'by', 'NetId)', 'AS', 'a']
Parsed:  (278, 'SELECT b.FirstName, b.LastName, b.NetId, b.Sum\nFROM Students b INNER JOIN\n    (SELECT NetId, SUM(Credits) as Sum\n    FROM Enrollments\n    GROUP by NetId) AS a\nWHERE b.NetId = b.NetId AND b.Sum > 12\nORDER BY b.Sum DESC, b.FirstName ASC')
=============
New Query

SELECT FirstName, LastName, NetId, Q.T
FROM (SELECT *
FROM (SELECT NetId ID, SUM(Credits) T
FROM Enrollments
GROUP BY NetId) as Temp
WHERE Temp.T > 12 ) as Q, Students S
WHERE S.NetId = Q.ID
ORDER BY Q.T DESC, FirstName ASC

Parsed:  (279, 'SELECT FirstName, LastName, NetId, Q.T\nFROM (SELECT *\nFROM (SELECT NetId ID, SUM(Credits) T\nFROM Enrollments\nGROUP BY NetId) as Temp\nWHERE Temp.T > 12 ) as Q, Students S\nWHERE S.NetId = Q.ID\nORDER BY Q.T DESC, FirstName ASC\n')
=============
New Query

select FirstName, LastName, NetId, sum(Credits) as totalHours
from Students natural join Enrollments
group by NetId
having sum(Credits) > 12
order by totalHours DESC, FirstName ASC;
['Students']
['Enrollments']
['totalHours', 'DESC']
desc
['FirstName', 'ASC']
asc
Parsed:  (280, 'select FirstName, LastName, NetId, sum(Credits) as totalHours\nfrom Students natural join Enrollments\ngroup by NetId\nhaving sum(Credits) > 12\norder by totalHours DESC, FirstName ASC;')
=============
New Query

SELECT FirstName, LastName, NetId, SUM(Credits) as sum
FROM Students NATURAL JOIN Enrollments
GROUP BY NetID
HAVING sum > 12
ORDER BY sum DESC, FirstName ASC
['Students']
['Enrollments']
Parsed:  (281, 'SELECT FirstName, LastName, NetId, SUM(Credits) as sum\nFROM Students NATURAL JOIN Enrollments \nGROUP BY NetID\nHAVING sum > 12\nORDER BY sum DESC, FirstName ASC')
=============
New Query

SELECT *
FROM (SELECT FirstName, LastName, S.NetID AS NetID, SUM(Credits) AS TotalCredits
FROM Students S LEFT OUTER JOIN Enrollments E ON S.NetID = E.NetID
GROUP BY NetID) as temp
WHERE temp.TotalCredits > 12
ORDER BY temp.TotalCredits DESC, temp.FirstName
['(SELECT', 'FirstName,', 'LastName,', 'S.NetID', 'AS', 'NetID,', 'SUM(Credits)', 'AS', 'TotalCredits\nFROM', 'Students', 'S', 'LEFT', 'OUTER', 'JOIN', 'Enrollments', 'E', 'ON', 'S.NetID', '=', 'E.NetID\nGROUP', 'BY', 'NetID)', 'as', 'temp']
Parsed:  (282, 'SELECT *\nFROM (SELECT FirstName, LastName, S.NetID AS NetID, SUM(Credits) AS TotalCredits\nFROM Students S LEFT OUTER JOIN Enrollments E ON S.NetID = E.NetID\nGROUP BY NetID) as temp\nWHERE a.TotalCredits > 12\nORDER BY a.TotalCredits DESC, a.FirstName')
=============
New Query

SELECT FirstName,LastName,NetId,SUM(Credits)
FROM Students NATURAL JOIN Enrollments
GROUP BY NetId
HAVING SUM(Credits) > 12
ORDER BY SUM(Credits) DESC,FirstName


['Students']
['Enrollments']
Parsed:  (283, 'SELECT FirstName,LastName,NetId,SUM(Credits)\nFROM Students NATURAL JOIN Enrollments \nGROUP BY NetId\nHAVING SUM(Credits) > 12\nORDER BY SUM(Credits) DESC,FirstName\n\n')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, SUM(E.Credits) AS CreditHours
FROM Students S
LEFT OUTER JOIN Enrollments E on S.NetId = E.NetId
GROUP BY S.NetId
HAVING CreditHours > 12
ORDER BY CreditHours DESC, S.FirstName
['Students', 'S']
['Enrollments', 'E']
['CreditHours', 'DESC']
desc
['S.FirstName']
s.firstname
Parsed:  (284, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits) AS CreditHours\nFROM Students S\nLEFT OUTER JOIN Enrollments b on a.NetId = b.NetId\nGROUP BY a.NetId\nHAVING CreditHours > 12\nORDER BY CreditHours DESC, a.FirstName')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, SUM(e.Credits)
FROM Students s JOIN Enrollments e ON s.NetId = e.NetId
GROUP BY s.NetId
HAVING SUM(e.Credits) > 12
ORDER BY SUM(e.Credits) DESC, s.FirstName ASC
['Students', 's']
['Enrollments', 'e']
Parsed:  (285, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFROM Students a JOIN Enrollments b ON a.NetId = b.NetId\nGROUP BY a.NetId\nHAVING SUM(b.Credits) > 12\nORDER BY SUM(b.Credits) DESC, a.FirstName ASC')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, SUM(E.Credits)
FROM Students S, Enrollments E
WHERE S.NetId = E.NetId
GROUP BY E.NetID
HAVING SUM(E.Credits) > 12
ORDER BY SUM(E.Credits) DESC, FirstName
['Students', 'S']
s
['Enrollments', 'E']
e
Parsed:  (286, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFROM Students a, Enrollments b\nWHERE a.NetId = b.NetId\nGROUP BY b.NetID\nHAVING SUM(b.Credits) > 12\nORDER BY SUM(b.Credits) DESC, FirstName')
=============
New Query

select s.FirstName, s.LastName, s.NetId, SUM(e.Credits)
from Students s inner join Enrollments e on s.NetId = e.NetId
group by s.FirstName, s.LastName, s.NetId having SUM(e.Credits) > 12
order by SUM(e.Credits) desc, s.FirstName asc
['Students', 's']
['Enrollments', 'e']
Parsed:  (287, 'select a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nfrom Students a inner join Enrollments b on a.NetId = b.NetId\ngroup by a.FirstName, a.LastName, a.NetId having SUM(b.Credits) > 12\norder by SUM(b.Credits) desc, a.FirstName asc')
=============
New Query

SELECT S.FirstName, S.LastName, Temp.NetId, Temp.TotalCredits
FROM (SELECT NetId, SUM(Credits) AS TotalCredits
FROM Students S NATURAL JOIN Enrollments E WHERE S.NetId = E.NetId
GROUP BY NetId) AS Temp, Students S
WHERE S.NetId = Temp.NetId AND Temp.TotalCredits > 12
ORDER BY TotalCredits DESC, FirstName
['TotalCredits', 'DESC']
desc
['FirstName']
firstname
Parsed:  (288, 'SELECT S.FirstName, S.LastName, Temp.NetId, Temp.TotalCredits\nFROM (SELECT NetId, SUM(Credits) AS TotalCredits \nFROM Students S NATURAL JOIN Enrollments E WHERE S.NetId = E.NetId\nGROUP BY NetId) AS Temp, Students S\nWHERE S.NetId = Temp.NetId AND Temp.TotalCredits > 12\nORDER BY TotalCredits DESC, FirstName')
=============
New Query

SELECT FirstName, LastName, NetID, TotalCredits
FROM (SELECT s.FirstName, s.LastName, s.NetID, SUM(e.Credits) AS TotalCredits
      FROM Students s NATURAL JOIN Enrollments e
      GROUP BY s.NetID) AS T
Where TotalCredits > 12
ORDER BY TotalCredits DESC, FirstName ASC
['(SELECT', 's.FirstName,', 's.LastName,', 's.NetID,', 'SUM(e.Credits)', 'AS', 'TotalCredits\n', '', '', '', '', '', 'FROM', 'Students', 's', 'NATURAL', 'JOIN', 'Enrollments', 'e\n', '', '', '', '', '', 'GROUP', 'BY', 's.NetID)', 'AS', 'T']
['TotalCredits', 'DESC']
desc
['FirstName', 'ASC']
asc
Parsed:  (289, 'SELECT FirstName, LastName, NetID, TotalCredits\nFROM (SELECT s.FirstName, s.LastName, s.NetID, SUM(e.Credits) AS TotalCredits\n      FROM Students s NATURAL JOIN Enrollments e\n      GROUP BY s.NetID) AS T\nWhere TotalCredits > 12\nORDER BY TotalCredits DESC, FirstName ASC')
=============
New Query

select * from (
    select FirstName, LastName, Enrollments.NetId, sum(Credits) TotalCredits
    from Enrollments
    inner join Students
    on Enrollments.NetId = Students.NetId
    group by Enrollments.NetId
) as t1
where TotalCredits > 12
order by TotalCredits desc, FirstName

['(\n', '', '', '', 'select', 'FirstName,', 'LastName,', 'Enrollments.NetId,', 'sum(Credits)', 'TotalCredits\n', '', '', '', 'from', 'Enrollments\n', '', '', '', 'inner', 'join', 'Students\n', '', '', '', 'on', 'Enrollments.NetId', '=', 'Students.NetId\n', '', '', '', 'group', 'by', 'Enrollments.NetId\n)', 'as', 't1']
['TotalCredits', 'desc']
desc
['FirstName']
firstname
Parsed:  (290, 'select * from (\n    select FirstName, LastName, Enrollments.NetId, sum(Credits) TotalCredits\n    from Enrollments\n    inner join Students\n    on Enrollments.NetId = Students.NetId\n    group by Enrollments.NetId\n) as t1\nwhere TotalCredits > 12\norder by TotalCredits desc, FirstName\n')
=============
New Query

select Students.FirstName, Students.LastName, Students.NetID, sum(Enrollments.Credits)
-- from Students join Enrollments on Enrollments.NetID = Students.NetID
from Students, Enrollments
where Students.NetID = Enrollments.NetID
Group by Students.FirstName,Students.LastName, Students.NetID
Having sum(Enrollments.Credits) > 12
order by sum(Enrollments.Credits) DESC, Students.FirstName




Parsed:  (291, 'select Students.FirstName, Students.LastName, Students.NetID, sum(Enrollments.Credits)\n-- from Students join Enrollments on Enrollments.NetID = Students.NetID\nfrom Students, Enrollments\nwhere Students.NetID = Enrollments.NetID \nGroup by Students.FirstName,Students.LastName, Students.NetID\nHaving sum(Enrollments.Credits) > 12\norder by sum(Enrollments.Credits) DESC, Students.FirstName\n\n\n\n')
=============
New Query

SELECT S.FirstName,S.LastName,E.NetId,SUM(Credits) as total
FROM Students S,Enrollments E
WHERE E.NetId = S.NetId
GROUP BY S.NetId
HAVING total>12
ORDER BY total DESC, FirstName asc
['Students', 'S']
s
['Enrollments', 'E']
e
['total', 'DESC']
desc
['FirstName', 'asc']
asc
Parsed:  (292, 'SELECT a.FirstName,a.LastName,b.NetId,SUM(Credits) as total\nFROM Students a,Enrollments b\nWHERE b.NetId = a.NetId\nGROUP BY a.NetId\nHAVING total>12\nORDER BY total DESC, FirstName asc')
=============
New Query

SELECT * FROM
(
    SELECT FirstName, LastName, NetId, SUM(Credits) as TotCredits
    FROM Enrollments NATURAL JOIN Students
    GROUP BY NetId
) AS CreditTable
WHERE CreditTable.TotCredits > 12
ORDER BY CreditTable.TotCredits DESC, CreditTable.FirstName ASC

['(', '\n', '', '', '', 'SELECT', 'FirstName,', 'LastName,', 'NetId,', 'SUM(Credits)', 'as', 'TotCredits', '\n', '', '', '', 'FROM', 'Enrollments', 'NATURAL', 'JOIN', 'Students\n', '', '', '', 'GROUP', 'BY', 'NetId\n)', 'AS', 'CreditTable']

['Students', 'AS', 's']
['(SELECT', 'Enrollments.NetId,', 'SUM(Enrollments.Credits)', 'AS', 'TotalCredits\n', '', '', '', '', '', 'FROM', 'Enrollments\n', '', '', '', '', '', 'GROUP', 'BY', 'Enrollments.NetId)', 'AS', 'e']
Parsed:  (296, 'SELECT a.FirstName, a.LastName, a.NetId, b.TotalCredits\nFROM Students AS s\nJOIN (SELECT Enrollmenta.NetId, SUM(Enrollmenta.Credits) AS TotalCredits\n      FROM Enrollments\n      GROUP BY Enrollmenta.NetId) AS e\nON a.NetId = b.NetId\nWHERE b.TotalCredits > 12\nORDER BY b.TotalCredits desc, a.FirstName asc')
=============
New Query

select s.FirstName, s.LastName, s.NetId, sum(e.Credits) as temp
from Enrollments e join Students s on e.netid = s.netid
group by netid
having temp > 12
order by temp DESC, s.FirstName ASC;
['Enrollments', 'e']
['Students', 's']
Parsed:  (297, 'select b.FirstName, b.LastName, b.NetId, sum(a.Credits) as temp\nfrom Enrollments a join Students b on a.netid = b.netid\ngroup by netid\nhaving temp > 12\norder by temp DESC, b.FirstName ASC; ')
=============
New Query

SELECT FirstName, LastName, NetId, totalCredits
FROM Students NATURAL JOIN (SELECT NETID, SUM(Credits) totalCredits
FROM Enrollments
GROUP BY NetId) AS sumCredits
WHERE totalCredits > 12
ORDER BY totalCredits DESC, FirstName ASC
['Students']
['(SELECT', 'NETID,', 'SUM(Credits)', 'totalCredits\nFROM', 'Enrollments\nGROUP', 'BY', 'NetId)', 'AS', 'sumCredits']
['totalCredits', 'DESC']
desc
['FirstName', 'ASC']
asc
Parsed:  (298, 'SELECT FirstName, LastName, NetId, totalCredits\nFROM Students NATURAL JOIN (SELECT NETID, SUM(Credits) totalCredits\nFROM Enrollments\nGROUP BY NetId) AS sumCredits\nWHERE totalCredits > 12\nORDER BY totalCredits DESC, FirstName ASC')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, T.SU
FROM Students as S,
    (
    SELECT NetId, SUM(credits) as SU
    FROM Enrollments
    GROUP BY NetId
                    ) as T
WHERE S.NetId = T.NetId and T.SU > 12 ORDER BY T.SU DESC, S.FirstName
['Students', 'as', 'S']
s
['(\n', '', '', '', 'SELECT', 'NetId']
netid
['SUM(credits)', 'as', 'SU\n', '', '', '', 'FROM', 'Enrollments\n', '', '', '', 'GROUP', 'BY', 'NetId\n', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ')', 'as', 'T']
t
Parsed:  (299, 'SELECT a.FirstName, a.LastName, a.NetId, c.SU \nFROM Students as a, \n    (\n    SELECT b, SUM(credits) as SU\n    FROM Enrollments\n    GROUP BY b\n                    ) as c\nWHERE a.NetId = c.NetId and c.SU > 12 ORDER BY c.SU DESC, a.FirstName')
=============
New Query

SELECT b.FirstName, b.LastName, b.NetId, b.total
FROM
    (
    SELECT SUM(a.Credits) AS total, a.FirstName, a.LastName, a.NetId
    FROM
        (
        SELECT FirstName, LastName, s.NetId, e.Credits
        FROM Enrollments AS e, Students AS s
        WHERE e.NetId = s.NetId
        ) AS a
    GROUP BY a.NetId
    ) AS b
WHERE b.total > 12
ORDER BY b.total DESC, FirstName ASC

['(\n', '', '', '', 'SELECT', 'SUM(a.Credits)', 'AS', 'total,', 'a.FirstName,', 'a.LastName,', 'a.NetId\n', '', '', '', 'FROM\n', '', '', '', '', '', '', '', '(\n', '', '', '', '', '', '', '', 'SELECT', 'FirstName,', 'LastName,', 's.NetId,', 'e.Credits\n', '', '', '', '', '', '', '', 'FROM', 'Enrollments', 'AS', 'e,', 'Students', 'AS', 's\n', '', '', '', '', '', '', '', 'WHERE', 'e.NetId', '=', 's.NetId\n', '', '', '', '', '', '', '', ')', 'AS', 'a\n', '', '', '', 'GROUP', 'BY', 'a.NetId\n', '', '', '', ')', 'AS', 'b']
Parsed:  (300, 'SELECT a.FirstName, a.LastName, a.NetId, a.total\nFROM\n    (\n    SELECT SUM(a.Credits) AS total, a.FirstName, a.LastName, a.NetId\n    FROM\n        (\n        SELECT FirstName, LastName, s.NetId, e.Credits\n        FROM Enrollments AS e, Students AS s\n        WHERE e.NetId = s.NetId\n        ) AS a\n    GROUP BY a.NetId\n    ) AS b\nWHERE a.total > 12\nORDER BY a.total DESC, FirstName ASC\n')
=============
New Query

Select FirstName,LastName,Students.NetId,sum(Credits)
from Students,Enrollments
where Students.NetId = Enrollments.NetId
group by Students.NetId
having sum(Credits) > 12
order by sum(Credits) DESC,FirstName
Parsed:  (301, 'Select FirstName,LastName,Students.NetId,sum(Credits)\nfrom Students,Enrollments \nwhere Students.NetId = Enrollments.NetId\ngroup by Students.NetId\nhaving sum(Credits) > 12\norder by sum(Credits) DESC,FirstName')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, SUM(e.Credits)
FROM Students s, Enrollments e
WHERE s.NetId = e.NetId
GROUP BY NetId
HAVING SUM(e.Credits) > 12
ORDER BY SUM(e.Credits) DESC, s.FirstName
-- 12 < (SELECT SUM(Credits)
--             FROM Enrollments e, Students s
--             WHERE e.NetId = s.NetId)
['Students', 's']
s
['Enrollments', 'e']
e
Parsed:  (302, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFROM Students a, Enrollments b\nWHERE a.NetId = b.NetId\nGROUP BY NetId\nHAVING SUM(b.Credits) > 12\nORDER BY SUM(b.Credits) DESC, a.FirstName\n-- 12 < (SELECT SUM(Credits)\n--             FROM Enrollments b, Students a\n--             WHERE b.NetId = a.NetId)')
=============
New Query

SELECT
    S.FirstName, S.LastName, S.NetId, SUM(E.Credits)
FROM
    Students AS S,
    Enrollments AS E
WHERE
    S.NetId = E.NetID
GROUP BY
    E.NetId  /* use Group in order to you aggreation SUM */
HAVING
    SUM(E.Credits) > 12
ORDER BY
    SUM(E.Credits) DESC,
    S.FirstName ASC




['Students', 'AS', 'S']
s
['Enrollments', 'AS', 'E']
e
Parsed:  (303, 'SELECT \n    a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFROM \n    Students AS a, \n    Enrollments AS b\nWHERE \n    a.NetId = b.NetID\nGROUP BY \n    b.NetId  /* use Group in order to you aggreation SUM */\nHAVING \n    SUM(b.Credits) > 12\nORDER BY\n    SUM(b.Credits) DESC,\n    a.FirstName ASC\n    \n    \n\n    ')
=============
New Query

SELECT FirstName, LastName, NetId, s
FROM Students NATURAL JOIN (SELECT NetId, SUM(Credits) s FROM Enrollments GROUP BY NetId ) as temp
WHERE s > 12
ORDER BY s DESC, FirstName
['Students']
['(SELECT', 'NetId,', 'SUM(Credits)', 's', 'FROM', 'Enrollments', 'GROUP', 'BY', 'NetId', ')', 'as', 'temp']
['s', 'DESC']
desc
['FirstName']
firstname
Parsed:  (304, 'SELECT FirstName, LastName, NetId, s\nFROM Students NATURAL JOIN (SELECT NetId, SUM(Credits) s FROM Enrollments GROUP BY NetId ) as temp\nWHERE s > 12\nORDER BY s DESC, FirstName')
=============
New Query

select s.FirstName, s.LastName, s.NetId, SUM(e.Credits)
    FROM Students s JOIN Enrollments e ON s.NetId = e.NetId
    GROUP BY e.NetId
    HAVING SUM(e.Credits) > 12
    ORDER BY SUM(e.Credits) DESC, s.FirstName ASC;
['Students', 's']
['Enrollments', 'e']
Parsed:  (305, 'select a.FirstName, a.LastName, a.NetId, SUM(b.Credits) \n    FROM Students a JOIN Enrollments b ON a.NetId = b.NetId \n    GROUP BY b.NetId \n    HAVING SUM(b.Credits) > 12 \n    ORDER BY SUM(b.Credits) DESC, a.FirstName ASC;')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, SUM(E.Credits)
FROM Students S, Enrollments E
WHERE S.NetId = E.NetId
GROUP BY S.FirstName, S.LastName, S.NetId
HAVING SUM(E.Credits) > 12
ORDER BY SUM(E.Credits) DESC, S.FirstName;
['Students', 'S']
s
['Enrollments', 'E']
e
Parsed:  (306, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFROM Students a, Enrollments b\nWHERE a.NetId = b.NetId\nGROUP BY a.FirstName, a.LastName, a.NetId\nHAVING SUM(b.Credits) > 12\nORDER BY SUM(b.Credits) DESC, a.FirstName;')
=============
New Query

SELECT FirstName, LastName, Students.NetId, Total
FROM    Students,
        (select NetId, SUM(Credits) as Total from Enrollments GROUP BY NetId) as TotalCredits
WHERE Students.NetId = TotalCredits.NetId and Total > 12
ORDER BY Total DESC, FirstName
['Total', 'DESC']
desc
['FirstName']
firstname
Parsed:  (307, 'SELECT FirstName, LastName, Students.NetId, Total\nFROM    Students, \n        (select NetId, SUM(Credits) as Total from Enrollments GROUP BY NetId) as TotalCredits\nWHERE Students.NetId = TotalCredits.NetId and Total > 12\nORDER BY Total DESC, FirstName')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, Credits
FROM Students s
LEFT JOIN (
        SELECT minE.NetId AS NetId, sum(minE.Credits) AS Credits
        FROM (
            SELECT e.NetId AS NetId, e.Credits AS Credits
            FROM Enrollments e
            ) AS minE
        GROUP BY minE.NetId
    ) AS enr
ON enr.NetId = s.NetId
WHERE Credits > 12
ORDER BY Credits DESC, FirstName

['Students', 's']
['(\n', '', '', '', '', '', '', '', 'SELECT', 'minE.NetId', 'AS', 'NetId,', 'sum(minE.Credits)', 'AS', 'Credits\n', '', '', '', '', '', '', '', 'FROM', '(\n', '', '', '', '', '', '', '', '', '', '', '', 'SELECT', 'e.NetId', 'AS', 'NetId,', 'e.Credits', 'AS', 'Credits\n', '', '', '', '', '', '', '', '', '', '', '', 'FROM', 'Enrollments', 'e\n', '', '', '', '', '', '', '', '', '', '', '', ')', 'AS', 'minE\n', '', '', '', '', '', '', '', 'GROUP', 'BY', 'minE.NetId\n', '', '', '', ')', 'AS', 'enr']
['Credits', 'DESC']
desc
['FirstName']
firstname
Parsed:  (308, 'SELECT a.FirstName, a.LastName, a.NetId, Credits\nFROM Students s\nLEFT JOIN (\n        SELECT minE.NetId AS NetId, sum(minE.Credits) AS Credits\n        FROM (\n            SELECT e.NetId AS NetId, e.Credits AS Credits\n            FROM Enrollments e\n            ) AS minE\n        GROUP BY minE.NetId\n    ) AS enr\nON b.NetId = a.NetId\nWHERE Credits > 12\nORDER BY Credits DESC, FirstName\n')
=============
New Query

SELECT FirstName, LastName, NetId, SUM(Credits) total_credits
FROM Students JOIN Enrollments USING(NetId)
GROUP BY NetId
HAVING total_credits > 12
ORDER BY total_credits DESC, FirstName ASC

['Students']
['Enrollments']
Parsed:  (309, 'SELECT FirstName, LastName, NetId, SUM(Credits) total_credits\nFROM Students JOIN Enrollments USING(NetId)\nGROUP BY NetId\nHAVING total_credits > 12\nORDER BY total_credits DESC, FirstName ASC\n')
=============
New Query

Select s.FirstName, s.LastName, s.NetId, e.p
from Students s, (select NetId, sum(Credits) as p from Enrollments group by NetId) e
where s.NetId = e.NetId AND e.p > 12
order by e.p desc, s.FirstName asc;
['Students', 's']
s
['(select', 'NetId']
netid
['sum(Credits)', 'as', 'p', 'from', 'Enrollments', 'group', 'by', 'NetId)', 'e']
e
Parsed:  (310, 'Select a.FirstName, a.LastName, a.NetId, c.p\nfrom Students a, (select b, sum(Credits) as p from Enrollments group by NetId) c\nwhere a.NetId = c.NetId AND c.p > 12\norder by c.p desc, a.FirstName asc;')
=============
New Query

Select S.FirstName, S.LastName, S.NetId, E.TCH
From Students S, (Select NetId, Sum(Credits) as TCH from Enrollments group by NetId) as E
Where S.NetId = E.NetId and E.TCH > 12
Order by E.TCH DESC, S.FirstName ASC
['Students', 'S']
s
['(Select', 'NetId']
netid
['Sum(Credits)', 'as', 'TCH', 'from', 'Enrollments', 'group', 'by', 'NetId)', 'as', 'E']
e
Parsed:  (311, 'Select a.FirstName, a.LastName, a.NetId, c.TCH\nFrom Students a, (Select b, Sum(Credits) as TCH from Enrollments group by NetId) as c\nWhere a.NetId = c.NetId and c.TCH > 12\nOrder by c.TCH DESC, a.FirstName ASC')
=============
New Query

SELECT FirstName, LastName, NetId, TotalCredits
FROM Students NATURAL JOIN (SELECT NetId, SUM(Credits) AS TotalCredits
FROM Enrollments
GROUP BY NetId) AS temp
WHERE TotalCredits > 12
ORDER BY TotalCredits DESC, FirstName
['Students']
['(SELECT', 'NetId,', 'SUM(Credits)', 'AS', 'TotalCredits\nFROM', 'Enrollments\nGROUP', 'BY', 'NetId)', 'AS', 'temp']
['TotalCredits', 'DESC']
desc
['FirstName']
firstname
Parsed:  (312, 'SELECT FirstName, LastName, NetId, TotalCredits\nFROM Students NATURAL JOIN (SELECT NetId, SUM(Credits) AS TotalCredits\nFROM Enrollments\nGROUP BY NetId) AS temp\nWHERE TotalCredits > 12\nORDER BY TotalCredits DESC, FirstName')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, SUM(e.Credits)
From Students s JOIN Enrollments e ON s.NetId = e.NetId
GROUP BY e.NetId
HAVING SUM(e.Credits) > 12
ORDER BY SUM(e.Credits) DESC, s.FirstName;
['Students', 's']
['Enrollments', 'e']
Parsed:  (313, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFrom Students a JOIN Enrollments b ON a.NetId = b.NetId\nGROUP BY b.NetId\nHAVING SUM(b.Credits) > 12\nORDER BY SUM(b.Credits) DESC, a.FirstName;')
=============
New Query

SELECT FirstName, LastName, NetId, sumCredit
FROM Students natural join (
    SELECT sum(Credits) as sumCredit, NetId
    FROM Enrollments E
    GROUP by NetId) as A
WHERE sumCredit > 12
ORDER by sumCredit DESC, FirstName
['Students']
['(\n', '', '', '', 'SELECT', 'sum(Credits)', 'as', 'sumCredit,', 'NetId\n', '', '', '', 'FROM', 'Enrollments', 'E\n', '', '', '', 'GROUP', 'by', 'NetId)', 'as', 'A']
['sumCredit', 'DESC']
desc
['FirstName']
firstname
Parsed:  (314, 'SELECT FirstName, LastName, NetId, sumCredit\nFROM Students natural join (\n    SELECT sum(Credits) as sumCredit, NetId\n    FROM Enrollments E\n    GROUP by NetId) as A\nWHERE sumCredit > 12\nORDER by sumCredit DESC, FirstName')
=============
New Query

SELECT
  Students.FirstName,
  Students.LastName,
  Enrollments.NetId,
  sum(Enrollments.Credits)
from
  Enrollments,
  Students
where Students.NetId = Enrollments.NetId
group by Enrollments.NetId
having sum(Enrollments.Credits) > 12
order by sum(Enrollments.Credits) desc , Students.FirstName


Parsed:  (315, 'SELECT\n  Students.FirstName,\n  Students.LastName,\n  Enrollments.NetId,\n  sum(Enrollments.Credits)\nfrom\n  Enrollments,\n  Students\nwhere Students.NetId = Enrollments.NetId\ngroup by Enrollments.NetId\nhaving sum(Enrollments.Credits) > 12\norder by sum(Enrollments.Credits) desc , Students.FirstName\n\n')
=============
New Query

SELECT FirstName, LastName, NetID, SUM(Credits)
FROM Enrollments NATURAL JOIN Students
GROUP BY NetId
HAVING SUM(Credits) > 12
ORDER BY SUM(Credits) DESC, FirstName
['Enrollments']
['Students']
Parsed:  (316, 'SELECT FirstName, LastName, NetID, SUM(Credits)\nFROM Enrollments NATURAL JOIN Students\nGROUP BY NetId\nHAVING SUM(Credits) > 12\nORDER BY SUM(Credits) DESC, FirstName')
=============
New Query

SELECT S.FirstName, S.LastName, S.NetId, SUM(E.Credits)
FROM Students S, Enrollments E
WHERE S.NetId = E.NetId
GROUP BY 1, 2, 3
HAVING SUM(E.Credits) > 12
ORDER BY SUM(E.Credits) DESC, S.FirstName ASC;
['Students', 'S']
s
['Enrollments', 'E']
e
Parsed:  (317, 'SELECT a.FirstName, a.LastName, a.NetId, SUM(b.Credits)\nFROM Students a, Enrollments b\nWHERE a.NetId = b.NetId\nGROUP BY 1, 2, 3\nHAVING SUM(b.Credits) > 12\nORDER BY SUM(b.Credits) DESC, a.FirstName ASC;')
=============
New Query

SELECT s.FirstName, s.LastName, s.NetId, sum(e.Credits) AS totalCredits
FROM Students s JOIN Enrollments e ON (s.NetId = e.NetId)
GROUP BY s.NetId
HAVING SUM(e.Credits) > 12
ORDER BY totalCredits DESC, s.FirstName ASC
['Students', 's']
['Enrollments', 'e']
['totalCredits', 'DESC']
desc
['s.FirstName', 'ASC']
asc
Parsed:  (318, 'SELECT a.FirstName, a.LastName, a.NetId, sum(b.Credits) AS totalCredits\nFROM Students a JOIN Enrollments b ON (a.NetId = b.NetId)\nGROUP BY a.NetId\nHAVING SUM(b.Credits) > 12\nORDER BY totalCredits DESC, a.FirstName ASC')
=============
New Query

SELECT DISTINCT FirstName, LastName, s.NetId, SUM(Credits) as credithours
FROM Students s NATURAL JOIN Enrollments e
GROUP BY NetId
HAVING SUM(Credits) > 12
ORDER BY credithours DESC, s.FirstName ASC
['Students', 's']
['Enrollments', 'e']
['credithours', 'DESC']
desc
['s.FirstName', 'ASC']
asc
Parsed:  (319, 'SELECT DISTINCT FirstName, LastName, a.NetId, SUM(Credits) as credithours\nFROM Students a NATURAL JOIN Enrollments e\nGROUP BY NetId\nHAVING SUM(Credits) > 12\nORDER BY credithours DESC, a.FirstName ASC')
=============
New Query

SELECT C1.FirstName, C1.LastName, COUNT(P1.PurchaseId)
FROM Customers C1 NATURAL JOIN Purchases P1
WHERE C1.CustomerId IN (SELECT C.CustomerId
FROM Customers C, Purchases P
WHERE C.CustomerId=P.CustomerId
AND P.Price <= ALL (SELECT Price FROM Purchases p2
WHERE p2.ProductId=P.ProductId))
GROUP BY P1.CustomerId
ORDER BY P1.CustomerId DESC;
['Customers', 'C1']
['Purchases', 'P1']
Parsed:  (320, 'SELECT a.FirstName, a.LastName, COUNT(b.PurchaseId)\nFROM Customers a NATURAL JOIN Purchases P1\nWHERE a.CustomerId IN (SELECT C.CustomerId\nFROM Customers C, Purchases P\nWHERE C.CustomerId=P.CustomerId\nAND P.Price <= ALL (SELECT Price FROM Purchases p2\nWHERE p2.ProductId=P.ProductId))\nGROUP BY b.CustomerId\nORDER BY b.CustomerId DESC;')
=============
New Query

select c1.FirstName, c1.LastName, count(distinct p2.PurchaseId)
from Customers c1 natural join Purchases p1, Purchases p2,
    (select p3.ProductId, min(p3.Price) as cn from Purchases p3 group by p3.ProductId) as tmp
where p1.ProductId = tmp.ProductId and p1.price = tmp.cn and p2.CustomerId = p1.CustomerId
group by p1.CustomerId
order by p1.CustomerId desc;
['Customers', 'c1']
['Purchases', 'p1']
p1
['Purchases', 'p2']
p2
['(select', 'p3.ProductId']
p3.productid

IndexError: list index out of range